"{{Short description|none}} <!-- \"none\" is preferred when the title is sufficiently descriptive; see [[WP:SDNONE]] -->\n{{AI-generated|date=September 2025}}\n{{Politics of Kazakhstan}}\nKazakhstan's approach to foreign relations is multifaceted and strategic, reflecting the country's unique geopolitical position, historical context, and economic ambitions. At the heart of its international [[diplomacy]] is a multivector [[foreign policy]], which aims to maintain balanced and diverse relations with all major global powers and regional neighbours. [[Kazakhstan]] is a member of the United Nations, [[Collective Security Treaty Organization]], [[Organization for Security and Co-operation in Europe]] (which it chaired in 2010), [[North Atlantic Cooperation Council]], [[Commonwealth of Independent States]], the [[Shanghai Cooperation Organisation]], and [[NATO]]'s [[Partnership for Peace]] program. Kazakhstan established a customs union with Russia and [[Belarus]] which eventually became the [[Eurasian Economic Union]]. President Nazarbayev has prioritized economic diplomacy into Kazakhstan's foreign policy.<ref name=\"ed\">{{cite web|title=New tasks from the President on facilitating economic diplomacy|url=http://www.kazakhembus.com/content/new-tasks-president-facilitating-economic-diplomacy|publisher=Foreign Ministry of Kazakhstan|access-date=2016-02-29|archive-date=2017-07-05|archive-url=https://web.archive.org/web/20170705003203/http://www.kazakhembus.com/content/new-tasks-president-facilitating-economic-diplomacy|url-status=dead}}</ref>\n\nEconomic cooperation and development are pivotal in Kazakhstan's foreign policy framework. The nation actively seeks to attract foreign investment, especially in its oil and gas sectors. Kazakhstan is keen on expanding its economic ties across the globe, understanding the critical role of economic interdependence in fostering stable international relations. \n\nKazakhstan is a proponent of nuclear [[Nuclear proliferation|non-proliferation]],<ref>{{Cite web |title=NTI |url=https://www.nti.org/analysis/articles/kazakhstan-nuclear-disarmament/}}</ref> having renounced its nuclear arsenal after the dissolution of the [[Soviet Union]]. The country actively participates in global discussions on nuclear disarmament and non-proliferation, leveraging its history to influence these debates.\n\nIn December 2010, Kazakhstan held its first [[Organization for Security and Co-operation in Europe|OSCE]] summit since 1999.<ref>{{cite web|url=http://www.osce.org/event/summit_2010|title=2010 OSCE Summit in Astana|access-date=February 20, 2015}}</ref>\n\nIn recent years, Kazakhstan has increasingly positioned itself as a mediator in international disputes,<ref>{{Cite web |title=Kazakhstan's Role in International Mediation under Nursultan Nazarbayev |url=https://www.isdp.eu/publication/kazakhstans-role-in-international-mediation-under-first-president-nursultan-nazarbayev/ |access-date=2024-11-12 |website=Institute for Security and Development Policy |language=en}}</ref> offering its territory as a neutral ground for diplomatic engagement and hosting high-profile international meetings and negotiations.\n\nEnvironmental sustainability is another focus of Kazakhstan's international engagement.<ref>{{Cite web |title=Transition to a Green Economy |url=https://www.un-page.org/static/f50d1480edb10ffbd09b60eb67133f1a/2020-kazakhstan-stocktaking-report-en.pdf}}</ref> Confronted with challenges like the desiccation of the [[Aral Sea]], Kazakhstan advocates for global cooperation on environmental issues, emphasizing the necessity of collective action to address ecological concerns.\n\nKazakhstan’s [[foreign policy]] is grounded in a respect for [[international law]], sovereignty, and the territorial integrity of states.<ref>{{Cite web |title=Akorda |url=https://www.akorda.kz/en/legal_acts/decrees/on-the-concept-of-the-foreign-policy-of-the-republic-of-kazakhstan-for-2020-2030}}</ref> The nation is an active participant in the [[United Nations]] and various international organisations.\n\n== Multilateral agreements ==\nKazakhstan, since gaining independence in 1991, has been an active participant in the international community, signing numerous multilateral agreements.\n\nKazakhstan became a member of the [[United Nations|UN]] in 1992<ref>{{Cite journal |last=Sess.: 1991-1992) |first=UN General Assembly (46th |date=1992-07-20 |title=Admission of the Republic of Kazakhstan to membership in the United Nations :: resolution /: adopted by the General Assembly. |url=https://digitallibrary.un.org/record/147692?ln=en&v=pdf |language=en}}</ref> and has since been a participant in various UN treaties and conventions.\n\nKazakhstan joined the [[Nuclear Non-Proliferation Treaty]] as a non-nuclear weapon state in 1993,<ref>{{Cite web |title=Nuclear Non-Proliferation |url=https://www.gov.kz/memleket/entities/mfa/press/article/details/579?lang=en#:~:text=On%2013%20December%201993%2C%20the,realization%20of%20country%27s%20foreign%20policy.}}</ref> emphasizing its commitment to nuclear disarmament and non-proliferation.\n\nKazakhstan signed the [[Comprehensive Nuclear-Test-Ban Treaty]] in 1996,<ref>{{Cite web |title=CTBTO |url=https://www.ctbto.org/resources/for-the-media/press-releases/kazakhstan-signs-facility-agreement#:~:text=The%20Comprehensive%20Nuclear%2DTest%2DBan%20Treaty%20(CTBT)%2C,by%20a%20global%20verification%20regime.}}</ref> further solidifying its stance against nuclear testing.\n\nKazakhstan is a founding member of the [[Shanghai Cooperation Organisation|Shanghai Cooperation Organization]], a political, economic, and security organization established in 2001, along with China, Russia, Kyrgyzstan, Tajikistan, and Uzbekistan.\n\nKazakhstan became a [[World Trade Organization]] member in 2015,<ref>{{Cite web |title=WTO {{!}} Accessions: Kazakhstan |url=https://www.wto.org/english/thewto_e/acc_e/a1_kazakhstan_e.htm#:~:text=Kazakhstan%20became%20the%20162nd%20WTO%20member%20on%2030%20November%202015. |access-date=2024-11-12 |website=www.wto.org}}</ref> committing to the organisation's rules and regulations to promote international trade.\n\nIn 2015 Kazakhstan joined the Inter-American Convention on Mutual Assistance in Criminal Matters. In September the Kazakh Senate ratified the Convention, which unites 26 countries, including the United States, South Korea, Canada, Mexico, Brazil, Venezuela and other countries.<ref>{{Cite web|title = Kazakhstan Increases Crime Fighting Cooperation with the Nations of the Americas – The Astana Times|date = 16 September 2015|url = http://astanatimes.com/2015/09/kazakhstan-increases-crime-fighting-cooperation-with-the-nations-of-the-americas/|access-date = 2015-09-30}}</ref>\n\nIn December 2015, the [[European Union]] and Kazakhstan signed an Enhanced Partnership and Cooperation Agreement (EPCA).<ref>{{Cite web |title=EPCA |url=https://www.consilium.europa.eu/en/documents-publications/treaties-agreements/agreement/?id=2015045}}</ref> This new Agreement, the first of its kind with a Central Asian partner, brought relations between the EU and Kazakhstan to a new level and represented an important milestone in more than 25 years of EU-Kazakhstan relations. \n\nKazakhstan is a signatory to the [[Paris Agreement on Climate Change]] within the United Nations Framework Convention on Climate Change (UNFCCC), dealing with greenhouse-gas-emissions mitigation, adaptation, and finance.\n\nIn November 2025 Kazakhstan confirmed that it had joined the [[Abraham Accords]].  The country has maintained diplomatic relations with [[Israel–Kazakhstan relations|Israel]] since 1992.<ref>{{Cite news |date=Nov 7, 2025 |title=Kazakhstan confirms joining Abraham Accords |url=https://www.anews.com.tr/world/2025/11/07/kazakhstan-confirms-joining-abraham-accords |access-date=Nov 7, 2025 |work=Andalou Agency| quote=\"This important decision was made solely in the interests of Kazakhstan and is fully consistent with the nature of republic's balanced, constructive, and peaceful foreign policy. Joining the Abraham Accords will contribute to strengthening our country's cooperation with all interested states and, therefore, is fully in line with Kazakhstan's strategic goals,\" the ministry said.}}</ref>\n\n== Concept of Foreign Policy of the Republic of Kazakhstan for 2020-2030 ==\nThe Concept of Foreign Policy of the Republic of Kazakhstan for 2020-2030<ref>{{Cite web |title=On the Concept of the Foreign Policy of the Republic of Kazakhstan for 2020-2030 |url=https://www.akorda.kz/en/legal_acts/decrees/on-the-concept-of-the-foreign-policy-of-the-republic-of-kazakhstan-for-2020-2030}}</ref> outlines the country's diplomatic strategy and priorities in the international arena. Key aspects include:\n\n# '''Analysis of the Current Situation''': Recognises the complex transformation of international relations, including crises of confidence, conflict, erosion of international law, and security challenges like terrorism and cyber warfare.\n# '''Basic Foreign Policy Principles''': Emphasizes continuity with the policies of the First President, Nursultan Nazarbayev, and focuses on building a stable, fair, and democratic world order. It promotes the external openness of the state, a multi-vector policy, multilateralism, and links between security and development.\n# '''Strategic Goals''': Aims to strengthen the independence, sovereignty, and territorial integrity of Kazakhstan, consolidate its position in Central Asia, and position the country as a responsible member of the international community. It focuses on maintaining friendly relations with other states and using foreign policy to enhance the national economy and the quality of life of its citizens.\n# '''Implementation Tasks''': Includes forming a stable and secure space around Kazakhstan, continuing to strengthen international peace and cooperation, and developing new approaches to key foreign policy issues. It also aims to achieve a new level of \"economisation\" of foreign policy and enhance the country's image globally through humanitarian diplomacy.\n# '''Key Priorities''': The concept outlines priorities in maintaining international peace and security, economic diplomacy, human rights, humanitarian diplomacy, and environmental protection. It emphasizes cooperation in various fields, including human rights, intercultural dialogue, environmental protection, and regional and multilateral diplomacy.\n# '''Implementation Tools and Expected Results''': The President of Kazakhstan sets the main directions of foreign policy, with support from the Parliament and the Ministry of Foreign Affairs. The implementation is expected to consolidate Kazakhstan's state independence, strengthen security, form favourable external relations, and integrate the country further into the international community.\n\n==Economic diplomacy==\nThe Foreign Ministry of Kazakhstan assumed the new function of attracting investments to Kazakhstan in December 2018. As part of the new responsibilities, the Ministry oversees activities in attracting foreign investment and promoting Kazakh exports abroad, taking away these responsibilities from the reformed Ministry for Investment and Development.<ref>{{cite web |title=Kazakhstan opens doors to new foreign investment |url=https://www.euractiv.com/section/central-europe/news/kazakhstan-opens-doors-to-new-foreign-investment/ |website=euractiv.com|date=7 January 2019 }}</ref> Two main objectives of Kazakhstan's economic diplomacy include comprehensive support of Kazakh business abroad and promotion of non-resource export.<ref>{{cite web |title=Kazakhstan's economic diplomacy: on solid footing and with clear goals in mind |url=https://astanatimes.com/2019/11/kazakhstans-economic-diplomacy-on-solid-footing-and-with-clear-goals-in-mind/ |website=The Astana Times |date=26 November 2019 |access-date=5 July 2020}}</ref> These objectives are set to help achieve the goals of diversifying the economy, creating new jobs, promoting innovative technologies and attracting foreign investors.\n\nAs part of economic diplomacy, Kazakhstan compiled a list of 40 countries its Foreign Ministry is to target in a bid to attract more foreign investment.<ref>{{cite web |title=Kazakhstan to engage 40 nations in economic diplomacy to attract FDI |url=https://www.efe.com/efe/english/patrocinada/kazakhstan-to-engage-40-nations-in-economic-diplomacy-attract-fdi/50000268-3890116 |website=efe.com}}</ref> Coordinated by the Foreign Ministry, Kazakhstan's diplomatic missions also address issues of strategic interest to Kazakhstan's business community in their receiving states.\n\n==Border issues==\nKazakhstan resolved the border determination issues with [[Kyrgyzstan]] in 2001, [[Uzbekistan]] in 2002, and [[Turkmenistan]] in 2017. The country became the first country to resolve border issues with the countries of the region.<ref>{{Cite web |title=Border disputes of Central Asian countries |url=https://www.aa.com.tr/en/asia-pacific/border-disputes-of-central-asian-countries-inherited-from-soviets/2687809#:~:text=Kazakhstan%20resolved%20the%20border%20determination,Uzbekistan%20and%20Kazakhstan%20in%202017}}</ref>\n\nKazakhstan and [[China]] resolved their longstanding border issues, fostering a strong partnership that enabled increased investment and economic collaboration. The resolution of these border disputes was pivotal in the development of Kazakh-Chinese economic ties and in combating terrorism. This resolution was also a significant step in reducing tensions and enhancing security in the region.<ref>{{Cite web |date=2022-08-01 |title=China's Kazakhstan Gambit |url=https://hir.harvard.edu/chinas-kazakhstan-gambit/ |access-date=2024-11-12 |website=Harvard International Review |language=en}}</ref> \n\nKazakhstan reached an agreement on the delimitation of adjacent sections of the [[Caspian Sea]] with Russia and [[Azerbaijan]]. This agreement was a crucial step in defining the borders of the national sectors of the Caspian seabed for Kazakhstan, Russia, and Azerbaijan, allowing these littoral states exclusive rights for the development and use of the seabed.<ref>{{Cite web |title= New Phase of the Caspian Sea Delimitation|url=https://www.eurasian-research.org/publication/new-phase-of-the-caspian-sea-delimitation/#:~:text=The%20Agreement%20on%20the%20delimitation,use%20of%20bottom%20and}}</ref> Kazakhstan, along with Azerbaijan, [[Iran]], the Russian Federation, and Turkmenistan, signed the [[Convention on the legal status of the Caspian Sea|Convention on the Legal Status of the Caspian Sea]]. This convention, signed in [[Aktau]], Kazakhstan, represented a significant diplomatic achievement, concluding more than two decades of negotiations.<ref>{{Cite web |title=Five Nations Bicker over Whether the Caspian is Lake or Sea |url=https://www.wilsoncenter.org/blog-post/five-nations-bicker-over-whether-the-caspian-lake-or-sea#:~:text=Azerbaijan,%20Iran,%20Kazakhstan,%20the%20Russian,summit%20as%20a%20historic%20success |access-date=2024-11-12 |website=www.wilsoncenter.org |language=en}}</ref> \n\n==Nuclear weapons non-proliferation==\nWhen the Soviet Union collapsed in December 1991, Kazakhstan inherited 1,410 [[nuclear warhead]]s and the [[Semipalatinsk Test Site|Semipalatinsk nuclear-weapon test site]]. By April 1995, Kazakhstan had returned the warheads to Russia and, by July 2000, had destroyed the nuclear testing infrastructure at Semipalatinsk.<ref name=NTI1>{{cite web |title=NTI Kazakhstan Profile |url=http://www.nti.org/country-profiles/kazakhstan/ |publisher=Nuclear Threat Initiative |access-date=2016-03-28 |archive-url=https://web.archive.org/web/20160224065903/http://www.nti.org/country-profiles/kazakhstan/ |archive-date=2016-02-24 |url-status=dead }}</ref>\n\nKazakhstan launched The ATOM (Abolish Testing. Our Mission) Project,<ref>{{Citation |title=The ATOM Project |date=2023-12-02 |work=Wikipedia |url=https://en.wikipedia.org/wiki/The_ATOM_Project |access-date=2024-11-12 |language=en}}</ref> an international campaign aimed at raising awareness about the human and environmental impacts of [[nuclear weapons testing]]. The project seeks to bring an end to nuclear weapons testing globally and to achieve a nuclear-weapon-free world.\n\nKazakhstan was instrumental in the establishment of the [[Central Asian Nuclear Weapon Free Zone|Central Asian Nuclear-Weapon-Free Zone]] (CANWFZ), which includes Kazakhstan, Kyrgyzstan, Tajikistan, Turkmenistan, and Uzbekistan. This zone is the first in the Northern Hemisphere and is significant for regional security.\n\nOn December 2, 2009, UN secretary general [[Ban Ki-moon]] and the Republic of Kazakhstan designated August 29 as [[International Day against Nuclear Tests]], the anniversary of the date that Kazakhstan closed the Semipalatinsk test site in 1991.<ref>{{cite web |url=https://www.un.org/en/events/againstnucleartestsday/ |title=International Day against Nuclear Tests (29 August) |publisher=United Nations |access-date=September 9, 2013}}</ref><ref>{{cite web |url=https://en-maktoob.news.yahoo.com/un-calls-global-efforts-ban-n-tests-023921015.html |title=UN calls for global efforts to ban n-tests |work=Yahoo! News Maktoob |date=August 30, 2013 |access-date=September 9, 2013}}</ref>\n\nKazakhstan is a strong supporter of the CTBT and advocates for its universal adoption and entry into force. The country has also established a network of monitoring stations as part of the International Monitoring System to detect nuclear tests.\n\nThe contribution of Kazakhstan's President Nazarbayev to nuclear non-proliferation was highly recognized by Japan. During his visit to Japan in November 2016, Nursultan Nazarbayev was awarded the title of special honorary citizen of Hiroshima for his non-proliferation efforts.<ref>{{cite web|title=Nazarbayev's Visit to Hiroshima Highlights Joint Striving for Nuclear Disarmament|url=http://astanatimes.com/2016/11/nazarbayevs-visit-to-hiroshima-highlights-joint-striving-for-nuclear-disarmament/|website=astanatimes.com|date=10 November 2016}}</ref>\n\n==Peacekeeping initiatives==\nThe first country to which Kazakhstan deployed its peacekeeping forces was [[Tajikistan]]. On November 11, 1992, due to a worsening situation, the Supreme Soviet of Tajikistan appealed to the CIS countries for peacekeeping support. On January 22, 1993, at a [[Commonwealth of Independent States|CIS]] summit in [[Minsk]], state leaders reviewed and approved this request. President [[Nursultan Nazarbayev]] ordered a composite battalion of 700 soldiers, composed of border, internal, and ground forces, to be sent to Tajikistan to secure a section of the border with Afghanistan. During the mission, Kazakhstani soldiers successfully repelled multiple attacks by armed groups attempting to cross into Tajikistan, establishing a reliable barrier against arms and drug smuggling. The Kazakhstani battalion remained stationed on the [[Afghanistan–Tajikistan border]] until 2001 when the situation stabilized.<ref name=mylife>{{cite book|author=Назарбаев Н. Н. |date=2023 |isbn=978-601-271-803-4 |location=Астана |pages=708 |publisher=Фолиант |title=Моя жизнь: От зависимости к свободе}}<!-- auto-translated from Russian by Module:CS1 translator --></ref><ref name=kurmanguzhin>{{cite book|author=Курмангужин Р. |date=2022 |isbn=978-601-294-345-0 |location=Алматы |pages=304 |publisher=ИД «Жибек Жолы» |title=История независимого Казахстана: внешняя политика}}<!-- auto-translated from Russian by Module:CS1 translator --></ref>\n\nKazakhstan peacekeepers have also participated in operations in [[Iraq]], where they neutralized approximately 4 million explosive devices. Additionally, Kazakhstan peacekeeping forces have been deployed to Western Sahara, Côte d’Ivoire, and Lebanon.\nIn 1987, Nazarbayev acted as a mediator in the [[Nagorno-Karabakh conflict]]. On August 27, 1992, he initiated trilateral negotiations in Almaty with the foreign ministers of [[Azerbaijan]], [[Armenia]], and Kazakhstan. These discussions led to an agreement on September 1, 1992, to halt hostilities between Azerbaijan and Armenia.<ref name=mylife/>\n\nIn 2010, Nazarbayev played a key role in resolving the crisis in [[Kyrgyzstan]]. He held talks with former president [[Kurmanbek Bakiyev]] and arranged for his evacuation to Kazakhstan, thereby helping prevent a civil war.<ref name=mylife/>\n\nPresident Nazarbayev also supported efforts to resolve the [[Russo-Ukrainian War]] from 2014 onwards. Kazakhstan organized Normandy Format talks with leaders from [[Russia]], [[Ukraine]], [[France]], and [[Germany]] on February 11–12, 2015, in Minsk, which aimed to pave the way toward peace.<ref name=mylife/>\n\nKazakhstan has been actively involved in the Syrian conflict resolution process. In 2015, at Nazarbayev’s initiative, meetings among Syrian opposition groups were held in Astana, resulting in the Astana Initiative. Nazarbayev also conducted discussions with leaders from the Muslim world, including the King of Jordan, the Emir of Qatar, and the President of Iran, seeking to foster a peaceful resolution to the Syrian crisis.<ref>{{cite web | url = https://tengrinews.kz/article/kazahstanu-siriyskie-peregovoryi-pochemu-provodilas-1241/ | title = Зачем Казахстану сирийские переговоры и почему проводилась операция «Жусан» | publisher = Tengrinews.kz | accessdate = 2021-06-25 | date = 2019-07-25 | archive-date = 2021-01-28 | archive-url = https://web.archive.org/web/20210128105940/https://tengrinews.kz/article/kazahstanu-siriyskie-peregovoryi-pochemu-provodilas-1241/}}</ref><ref>{{cite web | url = https://thediplomat.com/2015/05/kazakhstan-to-host-syria-talks/ | title = Kazakhstan to Host Syria Talks | publisher = The Diplomat | accessdate = 2021-06-25 | date = 2015-05-08 | archive-date = 2015-05-08 | archive-url = https://web.archive.org/web/20150508151357/https://thediplomat.com/2015/05/kazakhstan-to-host-syria-talks/}}</ref>\n\nKazakhstan has played an active role in international organizations. In 2010, Kazakhstan chaired the OSCE, and in 2011, the Organization of Islamic Cooperation. Kazakhstan has been actively involved in the Shanghai Cooperation Organization since its inception and chaired it in 2010–2011. In 2016, Kazakhstan was elected as a non-permanent member of the United Nations Security Council for 2017–2018.<ref>{{cite web|url=https://www.dw.com/ru/казахстан-впервые-стал-председателем-совбеза-оон/a-41988111|title=Казахстан впервые стал председателем Совбеза ООН|date=2019-07-25|publisher=dw.com|archive-url=https://web.archive.org/web/20210622230850/https://www.dw.com/ru/%D0%BA%D0%B0%D0%B7%D0%B0%D1%85%D1%81%D1%82%D0%B0%D0%BD-%D0%B2%D0%BF%D0%B5%D1%80%D0%B2%D1%8B%D0%B5-%D1%81%D1%82%D0%B0%D0%BB-%D0%BF%D1%80%D0%B5%D0%B4%D1%81%D0%B5%D0%B4%D0%B0%D1%82%D0%B5%D0%BB%D0%B5%D0%BC-%D1%81%D0%BE%D0%B2%D0%B1%D0%B5%D0%B7%D0%B0-%D0%BE%D0%BE%D0%BD/a-41988111|archive-date=2021-06-22|access-date=2021-06-25|url-status=live}}</ref>\n\n==Illicit drugs==\nIllegal [[cannabis (drug)|cannabis]] and, to a lesser extent, [[opium]] production in Kazakhstan is an international issue since much of the crop ends up being sold in other countries, particularly in other member-states of [[Commonwealth of Independent States]] (CIS).<ref name=\"CIA1\">[https://www.cia.gov/the-world-factbook/countries/kazakhstan/ Kazakhstan – Transnational Issues] CIA World Factbook</ref> In 1998, the [[United Nations Office on Drugs and Crime]] estimated that a \"minimum of 1,517 tons of cannabis was harvested\" in Kazakhstan.<ref name=narco>[http://www.silkroadstudies.org/new/inside/research/narcotics_crime/FactSheet/2004/Kazakhstan.pdf Kazakhstan Narcotics Factsheet 2004] {{Webarchive|url=https://web.archive.org/web/20061007164407/http://www.silkroadstudies.org/new/inside/research/narcotics_crime/FactSheet/2004/Kazakhstan.pdf |date=2006-10-07 }} The Central Asia-Caucasus Institute & Silk Road Studies Program</ref>\n\nWith the fall of the [[Soviet Union]], Kazakhstan became a major transit country for narcotics produced in Southwest Asia, primarily from Afghanistan.<ref name=narco/> In 2001, Kazakh authorities reported 1,320 cases of drug trafficking and seized 18 metric tons of narcotics. However, this is viewed as a fraction of the actual total volume trafficked and widespread corruption continues to hamper government anti-drug efforts; [[Transparency International]] gave Kazakhstan a score of 2.2, on a scale of 0–10 with 0 indicating a \"highly corrupt\" state.<ref name=narco/><ref>[http://www.transparency.org/content/download/2274/14262/file/TI%20Annual%20Report%202004.pdf 2004 Annual Report] {{Webarchive|url=https://web.archive.org/web/20100902224502/http://www.transparency.org/content/download/2274/14262/file/TI%20Annual%20Report%202004.pdf |date=2010-09-02 }} Transparency International</ref> Russia and other parts of Europe are the main markets for these drugs although drug use is growing in Kazakhstan as well.<ref name=CIA1/><ref name=narco/>\n\n==KazAID==\nIn November 2014 Kazakh Foreign Minister and Resident Representative of UNDP in Kazakhstan signed a project document supporting Kazakhstan's Foreign Affairs Ministry in forming KazAID, a system of Official Development Assistance (ODA).<ref>{{cite web|title=Articles Press Releases Speeches Events Start of KazAID marks significant transition in Kazakhstan from aid-recipient to donor|url=http://www.eurasia.undp.org/content/rbec/en/home/presscenter/articles/2014/11/3/start-kazaid-significant-transition-kazakhstan.html|website=eurasia.undp.org}}</ref> KazAID is the first ODA programme among the Central Asian states.<ref name=\"eureporter.co\">{{cite web |title=Kazakhstan is now taking another important role in the world |url=https://www.eureporter.co/featured/2018/04/06/kazakhstan-is-now-taking-another-important-role-in-the-world/ |website=eureporter.co|date=6 April 2018 }}</ref> The KazAID program implies technical assistance and humanitarian aid to Afghanistan. As of 2016, Kazakhstan provided Afghanistan with 20,000 tons of food products valued at some $20&nbsp;million.<ref>{{cite web|title=Kazakhstan Vows to Expand Afghan Aid Programs|url=http://www.laht.com/article.asp?CategoryId=12395&ArticleId=2422506|website=laht.com}}</ref>\n\nKazakhstan's Ministry of Foreign Affairs with assistance of the UNDP and Japan International Cooperation Agency (JICA) leads ODA titled \"Promoting Kazakhstan's ODA Cooperation with Afghanistan.\" The ODA is aimed at expanding economic independence and rights of Afghan women.<ref>{{cite web|title=Kazakhstan, UNDP and Japan have launched pilot project of Kazakhstan's ODA aimed at expanding economic independence and rights of women of Afghanistan|url=http://www.kz.undp.org/content/kazakhstan/en/home/presscenter/pressreleases/2016/08/19/kazakhstan-undp-and-japan-have-launched-pilot-project-of-kazakhstan-s-oda-aimed-at-expanding-economic-independence-and-rights-of-women-of-afghanistan.html|website=kz.undp.org|access-date=2017-07-13|archive-url=https://web.archive.org/web/20170704114311/http://www.kz.undp.org/content/kazakhstan/en/home/presscenter/pressreleases/2016/08/19/kazakhstan-undp-and-japan-have-launched-pilot-project-of-kazakhstan-s-oda-aimed-at-expanding-economic-independence-and-rights-of-women-of-afghanistan.html|archive-date=2017-07-04|url-status=dead}}</ref> The project marks Kazakhstan's first international cooperation for Afghanistan in the framework of national system of ODA.<ref>{{cite web|title=Japan and Kazakhstan promote gender equality, women's rights in Afghanistan|url=https://www.timesca.com/index.php/news/18334-japan-and-kazakhstan-promote-gender-equality-women-s-rights-in-afghanistan|website=timesca.com|date=3 November 2023 }}</ref>\n\nOver the past two decades, Kazakhstan has distributed more than $500 million for ODA activities.<ref>{{Cite web |title=KazAID – Kazakhstan's Emerging Foreign Policy Instrument |url=https://www.eurasian-research.org/publication/kazaid-kazakhstans-emerging-foreign-policy-instrument/ |access-date=2024-11-12 |language=en-US}}</ref> Countries of Central Asia and Afghanistan are a priority for Kazakhstan's ODA.<ref name=\"eureporter.co\"/>\n\n== Diplomatic relations ==\nList of countries which Kazakhstan maintains diplomatic relations with:\n{| class=\"wikitable sortable\"\n! colspan=\"3\" |[[File:Diplomatic relations of Kazakhstan.svg|frameless|425x425px]]\n|-\n!#\n!Country\n!Date<ref>{{Cite web|author=[[Government of Kazakhstan]]|date=10 December 2013|title=Страны, установившие дипломатические отношения с Республикой Казахстан |url=http://mfa.kz/ru/content-view/spisok-stran-ustanovivshikh-diplomaticheskie-otnosheniya-s-rk|website=[[Ministry of Foreign Affairs (Kazakhstan)|Ministry of Foreign Affairs of Kazakhstan]]|url-status=dead |archive-url=https://web.archive.org/web/20200220233503/http://mfa.kz/ru/content-view/spisok-stran-ustanovivshikh-diplomaticheskie-otnosheniya-s-rk |archive-date=20 February 2020 |access-date=30 April 2022 |language=ru}}</ref><ref name=\"un2\">{{cite web |title=Diplomatic relations between Kazakhstan and ... |url=https://digitallibrary.un.org/search?ln=en&as=1&m1=p&p1=Diplomatic+relations+between+Kazakhstan+and+...&f1=series&op1=a&m2=a&p2=&f2=&op2=a&m3=a&p3=&f3=&dt=&d1d=&d1m=&d1y=&d2d=&d2m=&d2y=&rm=&action_search=Search&sf=year&so=a&rg=50&c=United+Nations+Digital+Library+System&of=hb&fti=0&fti=0 |access-date=26 March 2022 |website=United Nations Digital Library}}</ref>\n|-\n|1\n|{{Flag|Nigeria}}\n|{{Date table sorting|16 December 1991}}\n|-\n|2\n|{{Flag|United States}}\n|{{dts|26 December 1991}}\n|-\n|3\n|{{Flag|China}}\n|{{dts|3 January 1992}}\n|-\n|4\n|{{Flag|United Kingdom}}\n|{{dts|19 January 1992}}\n|-\n|5\n|{{Flag|Mongolia}}\n|{{dts|22 January 1992}}\n|-\n|6\n|{{Flag|France}}\n|{{dts|25 January 1992}}\n|-\n|7\n|{{Flag|Japan}}\n|{{dts|26 January 1992}}\n|-\n|8\n|{{Flag|North Korea}}\n|{{dts|28 January 1992}}\n|-\n|9\n|{{Flag|South Korea}}\n|{{dts|28 January 1992}}\n|-\n|10\n|{{Flag|Iran}}\n|{{dts|29 January 1992}}\n|-\n|11\n|{{Flag|Germany}}\n|{{dts|11 February 1992}}\n|-\n|12\n|{{Flag|Spain}}\n|{{dts|11 February 1992}}\n|-\n|13\n|{{flag|Afghanistan|2013}}\n|{{dts|12 February 1992}}\n|-\n|14\n|{{Flag|Austria}}\n|{{dts|14 February 1992}}\n|-\n|15\n|{{Flag|India}}\n|{{dts|22 February 1992}}<ref>{{Cite web |title=Kazakhstan - India relations |url=https://www.gov.kz/memleket/entities/mfa-delhi/activities/2126?lang=en |access-date=6 June 2025 |website=The Embassy of Kazakhstan in India}}</ref>\n|-\n|16\n|{{Flag|Pakistan}}\n|{{dts|24 February 1992}}\n|-\n|17\n|{{Flag|Bangladesh}}\n|{{dts|1 March 1992}}\n|-\n|18\n|{{Flag|Turkey}}\n|{{dts|2 March 1992}}\n|-\n|19\n|{{Flag|South Africa}}\n|{{dts|5 March 1992}}\n|-\n|20\n|{{Flag|Egypt}}\n|{{dts|6 March 1992}}\n|-\n|21\n|{{Flag|Libya}}\n|{{dts|13 March 1992}}\n|-\n|22\n|{{Flag|Malaysia}}\n|{{dts|16 March 1992}}\n|-\n|23\n|{{Flag|Cuba}}\n|{{dts|24 March 1992}}\n|-\n|24\n|{{Flag|Philippines}}\n|{{dts|25 March 1992}}\n|-\n|25\n|{{Flag|Syria}}\n|{{dts|27 March 1992}}\n|-\n|26\n|{{Flag|Cyprus}}\n|{{dts|2 April 1992}}\n|-\n|27\n|{{Flag|Hungary}}\n|{{dts|2 April 1992}}<ref>{{Cite web |title=Kazahsztánról |url=https://kazahkonzul.eu/kazahsztanrol/ |access-date=6 June 2025 |website=tiszteletbeli Kazah Konzulátus Karcag |language=hu}}</ref>\n|-\n|28\n|{{Flag|Canada}}\n|{{dts|6 April 1992}}\n|-\n|—\n|{{Flag|State of Palestine}}\n|{{dts|6 April 1992}}\n|-\n|29\n|{{Flag|Poland}}\n|{{dts|6 April 1992}}<ref>{{Cite web |title=Kazakhstan – Poland Bilateral relations |url=https://www.gov.kz/memleket/entities/mfa-warsaw/activities/1882?lang=en |access-date=6 June 2025 |website=Embassy of the Republic of Kazakhstan in the Republic of Poland}}</ref>\n|-\n|30\n|{{Flag|Sweden}}\n|{{dts|7 April 1992}}\n|-\n|31\n|{{Flag|Ireland}}\n|{{dts|10 April 1992}}\n|-\n|32\n|{{Flag|Israel}}\n|{{dts|10 April 1992}}\n|-\n|33\n|{{Flag|Madagascar}}\n|{{dts|10 April 1992}}\n|-\n|34\n|{{Flag|Zimbabwe}}\n|{{dts|10 April 1992}}\n|-\n|35\n|{{Flag|Mexico}}\n|{{dts|13 April 1992}}\n|-\n|36\n|{{Flag|Oman}}\n|{{dts|27 April 1992}}\n|-\n|37\n|{{Flag|Denmark}}\n|{{dts|7 May 1992}}\n|-\n|38\n|{{Flag|New Zealand}}\n|{{dts|12 May 1992}}\n|-\n|39\n|{{Flag|Finland}}\n|{{dts|13 May 1992}}\n|-\n|40\n|{{Flag|Morocco}}\n|{{dts|26 May 1992}}\n|-\n|41\n|{{Flag|Estonia}}\n|{{dts|27 May 1992}}\n|-\n|42\n|{{Flag|Bahrain}}\n|{{dts|28 May 1992}}<ref>{{Cite web |date=6 July 2021 |title=Ambassador of Kazakhstan Presented Credentials to King of Bahrain |url=https://www.gov.kz/memleket/entities/mfa/press/news/details/227414?lang=en |access-date=6 June 2025 |website=Ministry of Foreign Affairs of the Republic of Kazakhstan}}</ref>\n|-\n|43\n|{{Flag|Switzerland}}\n|{{dts|1 June 1992}}\n|-\n|44\n|{{Flag|Bulgaria}}\n|{{dts|5 June 1992}}\n|-\n|45\n|{{Flag|Norway}}\n|{{dts|5 June 1992}}\n|-\n|46\n|{{Flag|Guinea}}\n|{{dts|6 June 1992}}\n|-\n|47\n|{{Flag|Lithuania}}\n|{{dts|15 June 1992}}\n|-\n|48\n|{{Flag|Australia}}\n|{{dts|22 June 1992}}\n|-\n|49\n|{{Flag|Luxembourg}}\n|{{dts|29 June 1992}}\n|-\n|50\n|{{Flag|Sri Lanka}}\n|{{dts|29 June 1992}}<ref>{{Cite news |date=20 November 2012 |title=President begins State visit to Kazakhstan |url=https://www.ft.lk/news/president-begins-state-visit-to-kazakhstan/56-120642 |work=[[Daily FT]] |access-date=5 June 2025}}</ref>\n|-\n|51\n|{{Flag|Vietnam}}\n|{{dts|29 June 1992}}\n|-\n|52\n|{{Flag|Thailand}}\n|{{dts|6 July 1992}}\n|-\n|53\n|{{Flag|Romania}}\n|{{dts|15 July 1992}}\n|-\n|54\n|{{Flag|Colombia}}\n|{{dts|23 July 1992}}\n|-\n|55\n|{{Flag|Georgia}}\n|{{dts|23 July 1992}}\n|-\n|56\n|{{Flag|Ukraine}}\n|{{dts|23 July 1992}}<ref>{{Cite web |title=Угода про встановлення дипломатичних відносин у повному обсязі між Україною і Республікою Казахстан (у формі обміну нотами) |url=https://zakon.rada.gov.ua/laws/show/398_036?lang=en#Text |access-date=6 June 2025 |website=zakon.rada.gov.ua |language=uk}}</ref>\n|-\n|57\n|{{Flag|Cape Verde}}\n|{{dts|30 July 1992}}\n|-\n|58\n|{{Flag|Ghana}}\n|{{dts|14 August 1992}}\n|-\n|59\n|{{Flag|Belgium}}\n|{{dts|25 August 1992}}<ref>{{Cite web |date=17 October 2022 |title=Political consultations between Kazakhstan and Belgium confirm commitment to strengthening cooperation |url=https://el.kz/en/political_consultations_between_kazakhstan_and_belgium_confirm_commitment_to_strengthening_cooperati_53145/ |access-date=6 June 2025}}</ref>\n|-\n|60\n|{{Flag|Portugal}}\n|{{dts|19 August 1992}}\n|-\n|61\n|{{Flag|Italy}}\n|{{dts|21 August 1992}}\n|-\n|62\n|{{Flag|Armenia}}\n|{{dts|27 August 1992}}\n|-\n|63\n|{{Flag|Azerbaijan}}\n|{{dts|27 August 1992}}\n|-\n|64\n|{{Flag|United Arab Emirates}}\n|{{dts|1 September 1992}}\n|-\n|65\n|{{Flag|Netherlands}}\n|{{dts|10 September 1992}}\n|-\n|66\n|{{Flag|Belarus}}\n|{{dts|16 September 1992}}\n|-\n|67\n|{{Flag|Moldova}}\n|{{dts|16 September 1992}}<ref>{{Cite web |title=Kazakhstan-Moldova relations |url=https://www.gov.kz/memleket/entities/mfa-kishinev/activities/2197?lang=en |access-date=6 June 2025 |website=Embassy of the Republic of Kazakhstan to the Republic of Moldova}}</ref>\n|-\n|68\n|{{Flag|Greece}}\n|{{dts|1 October 1992}}\n|-\n|69\n|{{Flag|Turkmenistan}}\n|{{dts|5 October 1992}}\n|-\n|70\n|{{Flag|Kyrgyzstan}}\n|{{dts|15 October 1992}}\n|-\n|—\n|{{Flag|Holy See}}\n|{{dts|17 October 1992}}\n|-\n|71\n|{{Flag|Croatia}}\n|{{dts|20 October 1992}}<ref>{{Cite web |title=Kazakhstan - Croatia |url=https://www.gov.kz/memleket/entities/mfa-zagreb/activities/4541?lang=en |access-date=6 June 2025 |website=Embassy of the Republic of Kazakhstan to the Republic of Croatia}}</ref>\n|-\n|72\n|{{Flag|Slovenia}}\n|{{dts|20 October 1992}}<ref>{{Cite web |date=20 October 2022 |title=30th Anniversary of Kazakh-Slovenian Relationship |url=https://www.gov.kz/memleket/entities/mfa/press/news/details/444897?lang=en |access-date=6 June 2025 |website=Ministry of Foreign Affairs of the Republic of Kazakhstan}}</ref>\n|-\n|73\n|{{Flag|Russia}}\n|{{dts|22 October 1992}}\n|-\n|74\n|{{Flag|Tunisia}}\n|{{dts|23 November 1992}}\n|-\n|75\n|{{Flag|Uzbekistan}}\n|{{dts|23 November 1992}}\n|-\n|76\n|{{Flag|Mali}}\n|{{dts|26 November 1992}}\n|-\n|77\n|{{Flag|Latvia}}\n|{{dts|10 December 1992}}\n|-\n|78\n|{{Flag|Czech Republic}}\n|{{dts|1 January 1993}}\n|-\n|79\n|{{Flag|Slovakia}}\n|{{dts|1 January 1993}}\n|-\n|80\n|{{Flag|Tajikistan}}\n|{{dts|7 January 1993}}\n|-\n|81\n|{{Flag|Kuwait}}\n|{{dts|11 January 1993}}\n|-\n|82\n|{{Flag|Malta}}\n|{{dts|4 February 1993}}\n|-\n|—\n|{{Flag|Sovereign Military Order of Malta}}\n|{{dts|4 February 1993}}\n|-\n|83\n|{{Flag|Jordan}}\n|{{dts|9 February 1993}}\n|-\n|84\n|{{Flag|Singapore}}\n|{{dts|30 March 1993}}\n|-\n|85\n|{{Flag|Lebanon}}\n|{{dts|20 April 1993}}<ref>{{Cite web |date=6 February 2015 |title=Lebanon, Kazakhstan Enjoy Strong Mutual Bonds, Ambassador Says |url=https://astanatimes.com/2015/02/lebanon-kazakhstan-enjoy-strong-mutual-bonds-ambassador-says/ |access-date=6 June 2025 |website=The Astana Times |lang=en}}</ref>\n|-\n|86\n|{{Flag|Mauritania}}\n|{{dts|28 April 1993}}\n|-\n|87\n|{{Flag|Indonesia}}\n|{{dts|2 June 1993}}\n|-\n|88\n|{{Flag|Argentina}}\n|{{dts|25 June 1993}}\n|-\n|89\n|{{Flag|Qatar}}\n|{{dts|1 July 1993}}\n|-\n|90\n|{{Flag|Uruguay}}\n|{{dts|30 July 1993}}\n|-\n|91\n|{{Flag|Chile}}\n|{{dts|19 August 1993}}\n|-\n|92\n|{{Flag|Albania}}\n|{{dts|21 September 1993}}\n|-\n|93\n|{{Flag|Brazil}}\n|{{dts|22 September 1993}}\n|-\n|94\n|{{Flag|Kenya}}\n|{{dts|15 November 1993}}\n|-\n|95\n|{{Flag|Cambodia}}\n|{{dts|25 February 1994}}\n|-\n|96\n|{{Flag|Saudi Arabia}}\n|{{dts|30 April 1994}}\n|-\n|97\n|{{Flag|Nicaragua}}\n|{{dts|5 July 1994}}\n|-\n|98\n|{{Flag|Angola}}\n|{{dts|3 October 1994}}\n|-\n|99\n|{{Flag|North Macedonia}}\n|{{dts|1 June 1995}}\n|-\n|100\n|{{Flag|Jamaica}}\n|{{dts|27 July 1995}}\n|-\n|101\n|{{Flag|Panama}}\n|{{dts|28 July 1995}}\n|-\n|102\n|{{Flag|Iraq}}\n|{{dts|14 September 1995}}\n|-\n|103\n|{{Flag|Honduras}}\n|{{dts|28 November 1995}}\n|-\n|104\n|{{Flag|Algeria}}\n|{{dts|15 March 1996}}\n|-\n|105\n|{{Flag|Zambia}}\n|{{dts|25 March 1996}}\n|-\n|106\n|{{Flag|Venezuela}}\n|{{dts|8 May 1996}}\n|-\n|107\n|{{Flag|Costa Rica}}\n|{{dts|1 October 1996}}\n|-\n|108\n|{{Flag|Serbia}}\n|{{dts|10 December 1996}}\n|-\n|109\n|{{Flag|Bosnia and Herzegovina}}\n|{{dts|20 December 1996}}\n|-\n|110\n|{{Flag|Peru}}\n|{{dts|6 February 1997}}\n|-\n|111\n|{{Flag|Laos}}\n|{{dts|19 September 1997}}\n|-\n|112\n|{{Flag|Yemen}}\n|{{dts|9 December 1997}}\n|-\n|113\n|{{Flag|Chad}}\n|{{dts|21 July 1999}}\n|-\n|114\n|{{Flag|Republic of the Congo}}\n|{{dts|21 September 1999}}\n|-\n|115\n|{{Flag|Myanmar}}\n|{{dts|23 September 1999}}\n|-\n|116\n|{{Flag|Maldives}}\n|{{dts|15 March 2000}}\n|-\n|117\n|{{Flag|Brunei}}\n|{{dts|14 June 2000}}\n|-\n|118\n|{{Flag|Iceland}}\n|{{dts|14 May 2004}}\n|-\n|119\n|{{Flag|Paraguay}}\n|{{dts|20 September 2004}}\n|-\n|120\n|{{Flag|San Marino}}\n|{{dts|20 September 2004}}\n|-\n|121\n|{{Flag|Montenegro}}\n|{{dts|14 July 2006}}\n|-\n|122\n|{{Flag|Liechtenstein}}\n|{{dts|31 January 2007}}\n|-\n|123\n|{{Flag|Antigua and Barbuda}}\n|{{dts|16 November 2007}}\n|-\n|124\n|{{Flag|Andorra}}\n|{{dts|30 January 2008}}\n|-\n|125\n|{{Flag|Senegal}}\n|{{dts|13 March 2008}}\n|-\n|126\n|{{Flag|Mozambique}}\n|{{dts|18 June 2008}}\n|-\n|127\n|{{Flag|Sudan}}\n|{{dts|19 June 2008}}\n|-\n|128\n|{{Flag|Uganda}}\n|{{dts|20 June 2008}}\n|-\n|129\n|{{Flag|Monaco}}\n|{{dts|15 January 2009}}<ref>{{cite news |date=9 October 2013 |title=Kazakhstan and Monaco Strengthen Cooperation |url=https://astanatimes.com/2013/10/kazakhstan-and-monaco-strengthen-cooperation/ |work=The Astana Times |url-status=live |access-date=3 November 2025 |archive-url=https://web.archive.org/web/20211219010634/https://astanatimes.com/2013/10/kazakhstan-and-monaco-strengthen-cooperation/ |archive-date=19 December 2021}}</ref>\n|-\n|130\n|{{Flag|Cameroon}}\n|{{dts|14 May 2009}}\n|-\n|131\n|{{Flag|Gabon}}\n|{{dts|23 May 2009}}\n|-\n|132\n|{{Flag|Ivory Coast}}\n|{{dts|23 May 2009}}\n|-\n|133\n|{{Flag|Djibouti}}\n|{{dts|5 May 2010}}\n|-\n|134\n|{{Flag|Burkina Faso}}\n|{{dts|10 February 2011}}\n|-\n|135\n|{{Flag|Gambia}}\n|{{dts|26 April 2011}}\n|-\n|136\n|{{Flag|Dominican Republic}}\n|{{dts|7 June 2011}}\n|-\n|137\n|{{Flag|Guatemala}}\n|{{dts|2 September 2011}}\n|-\n|138\n|{{Flag|Ethiopia}}\n|{{dts|5 September 2011}}\n|-\n|139\n|{{Flag|Benin}}\n|{{dts|13 September 2011}}\n|-\n|140\n|{{Flag|Ecuador}}\n|{{dts|23 January 2012}}\n|-\n|141\n|{{Flag|Comoros}}\n|{{dts|29 March 2012}}\n|-\n|142\n|{{Flag|Rwanda}}\n|{{dts|10 May 2012}}\n|-\n|143\n|{{Flag|Fiji}}\n|{{dts|6 June 2012}}\n|-\n|144\n|{{Flag|Tuvalu}}\n|{{dts|27 July 2012}}\n|-\n|145\n|{{Flag|Solomon Islands}}\n|{{dts|17 August 2012}}\n|-\n|146\n|{{Flag|Grenada}}\n|{{dts|15 November 2012}}\n|-\n|147\n|{{Flag|Palau}}\n|{{dts|19 November 2012}}\n|-\n|148\n|{{Flag|Bhutan}}\n|{{dts|20 November 2012}}\n|-\n|149\n|{{Flag|Saint Vincent and the Grenadines}}\n|{{dts|21 November 2012}}\n|-\n|150\n|{{Flag|Saint Lucia}}\n|{{dts|5 December 2012}}\n|-\n|151\n|{{Flag|Guyana}}\n|{{dts|11 January 2013}}\n|-\n|152\n|{{Flag|Samoa}}\n|{{dts|7 February 2013}}\n|-\n|153\n|{{Flag|Suriname}}\n|{{dts|11 April 2013}}\n|-\n|154\n|{{Flag|Guinea-Bissau}}\n|{{dts|19 April 2013}}\n|-\n|155\n|{{Flag|Dominica}}\n|{{dts|30 April 2013}}\n|-\n|156\n|{{Flag|Saint Kitts and Nevis}}\n|{{dts|8 May 2013}}\n|-\n|157\n|{{Flag|Bolivia}}\n|{{dts|17 May 2013}}\n|-\n|158\n|{{Flag|Haiti}}\n|{{dts|20 September 2013}}\n|-\n|159\n|{{Flag|Belize}}\n|{{dts|7 November 2013}}\n|-\n|160\n|{{Flag|Trinidad and Tobago}}\n|{{dts|16 January 2014}}\n|-\n|161\n|{{Flag|El Salvador}}\n|{{dts|30 January 2014}}\n|-\n|162\n|{{Flag|Kiribati}}\n|{{dts|18 February 2014}}\n|-\n|163\n|{{Flag|Vanuatu}}\n|{{dts|19 February 2014}}\n|-\n|164\n|{{Flag|Seychelles}}\n|{{dts|11 March 2014}}\n|-\n|165\n|{{Flag|Namibia}}\n|{{dts|7 October 2014}}\n|-\n|166\n|{{Flag|Togo}}\n|{{dts|9 October 2014}}\n|-\n|167\n|{{Flag|Mauritius}}\n|{{dts|15 October 2014}}\n|-\n|168\n|{{Flag|Sierra Leone}}\n|{{dts|20 November 2014}}\n|-\n|169\n|{{Flag|São Tomé and Príncipe}}\n|{{dts|20 November 2014}}\n|-\n|170\n|{{Flag|Burundi}}\n|{{dts|4 December 2014}}\n|-\n|171\n|{{Flag|Bahamas}}\n|{{dts|8 December 2014}}\n|-\n|172\n|{{Flag|Tonga}}\n|{{dts|17 March 2015}}\n|-\n|173\n|{{Flag|Lesotho}}\n|{{dts|2 April 2015}}\n|-\n|174\n|{{Flag|Nepal}}\n|{{dts|30 June 2015}}\n|-\n|175\n|{{Flag|Federated States of Micronesia}}\n|{{dts|27 October 2015}}\n|-\n|176\n|{{Flag|Liberia}}\n|{{dts|27 April 2016}}\n|-\n|177\n|{{Flag|Eswatini}}\n|{{dts|16 May 2016}}\n|-\n|178\n|{{Flag|Eritrea}}\n|{{dts|7 December 2016}}\n|-\n|179\n|{{Flag|Equatorial Guinea}}\n|{{dts|24 May 2017}}\n|-\n|180\n|{{Flag|Niger}}\n|{{dts|21 September 2017}}\n|-\n|181\n|{{Flag|Barbados}}\n|{{dts|27 March 2018}}\n|-\n|182\n|{{Flag|Marshall Islands}}\n|{{dts|12 February 2019}}\n|-\n|183\n|{{Flag|Tanzania}}\n|{{dts|13 February 2019}}\n|-\n|184\n|{{Flag|Democratic Republic of the Congo}}\n|{{dts|2022}}<ref>{{Cite news |date=10 September 2025 |title=Democratic Republic of Congo is Kazakhstan’s important partner in Africa, President |url=https://qazinform.com/news/democratic-republic-of-congo-is-kazakhstans-important-partner-in-africa-president-17ee75 |work=Qazinform |access-date=10 September 2025}}</ref>\n|-\n|185\n|{{Flag|Papua New Guinea}}\n|{{dts|24 March 2023}}\n|-\n|186\n|{{Flag|Somalia}}\n|{{dts|27 August 2025}}<ref>{{Cite web |date=27 August 2025 |title=Kazakhstan and Somalia established diplomatic relations |url=https://www.gov.kz/memleket/entities/mfa-kazakhstanun/press/news/details/1058078?lang=en |website=GOV.KZ |access-date=21 October 2025}}</ref>\n|-\n|187\n|{{Flag|Botswana}}\n|{{dts|30 October 2025}}\n|}\n\n==Bilateral relations== \n===Multilateral===\n{| class=\"wikitable sortable\" border=\"1\" style=\"width:100%; margin:auto;\" \n!width=\"15%\"| Organization\n!width=\"12%\"| Formal Relations Began\n!Notes\n|--valign=\"top\"\n|{{Flag|European Union}}||<!--Start date-->\n|See [[Kazakhstan–European Union relations]] \n|--valign=\"top\"\n|{{Flag|NATO}}||<!--Start date-->\n| See [[Foreign relations of NATO|Kazakhstan–NATO relations]]\n|}\n===Africa===\nKazakhstan has proactively worked to establish ties with African nations.<ref name=AUties>{{cite news|title=Kazakhstan Seeks Stronger African Ties during 25th Assembly of AU Leaders|url=http://www.astanatimes.com/2015/06/kazakhstan-seeks-stronger-african-ties-during-25th-assembly-of-au-leaders/|publisher=The Astana Times}}</ref> Deputy Minister of Foreign Affairs Askar Mussinov participated in the 25th Assembly of Heads of State and Government of the [[African Union]] in [[Johannesburg]], South Africa June 12–15.<ref name=\"AUties\"/>\n\nResponding to an international call to help ease the suffering that Ebola is causing in West Africa, Kazakhstan transferred $50,000 to the UN Ebola Trust Fund in late 2014.<ref name=WestAfrica>{{cite web|title=Kazakhstan Increases Allocation to Fight Ebola in West Africa|url=http://laht.com/article.asp?ArticleId=2367035&CategoryId=13936|website=laht.com/}}</ref> After that Astana expressed its intention to provide $300,000 to the African Union's special project to fight Ebola.<ref name=\"who11\"/>\n\nThe 1st day of the VIII Astana Economic Forum held on May 21, 2015, was dedicated to Africa and was titled \"Africa – the Next Driver of the Global Economy\".<ref name=africa11>{{cite web|title=Kazakhstan Eyes New Opportunities in Africa|url=http://www.astanatimes.com/2015/05/kazakhstan-eyes-new-opportunities-in-africa/|website=astanatimes.com/|date=26 May 2015}}</ref> The Foreign Minister of Kazakhstan Erlan Idrissov noted: \"We recognise that Africa is a continent with huge potential. It has enormous human capital and a large, young population.”<ref name=\"africa11\"/> More than 20 permanent representatives to the United Nations (UN) from Africa participated in the session.<ref name=\"africa11\"/>\n\nOn September 28, 2015, Kazakhstan and the UNDP signed a $2 million cost-sharing agreement launching a new program to help 45 African countries implement the UN's [[Sustainable Development Goals]].<ref>{{Cite web|title = Kazakhstan, UNDP to Assist African Countries with Sustainable Development Goals|date = 6 October 2015|url = http://astanatimes.com/2015/10/kazakhstan-undp-to-assist-african-countries-with-sustainable-development-goals/|access-date = 2015-10-06}}</ref>\n\nOn August 8, 2024, Kazakhstan and Congo-Brazzaville signed several cooperation agreements, covering the oil and gas industry, information and communication technologies, and cyber security.<ref>{{Cite web|title = Coopération : le Congo et le Kazakhstan signent des accords multisectoriels|date = 8 August 2024|url = https://ambacongofr.org/index.php/l-ambassade/actualites/1101-cooperation-le-congo-et-le-kazakhstan-signent-des-accords-multisectoriels|access-date = 2024-08-14}}</ref>\n\n{| class=\"wikitable sortable\" border=\"1\" style=\"width:100%; margin:auto;\"\n!width=\"15%\"| Country\n!width=\"12%\"| Formal Relations Began\n!Notes\n|--valign=\"top\"\n|{{flagu|Libya}}||13 March 1992||See [[Kazakhstan–Libya relations]]\n\n* Libya has an embassy in [[Astana]].\n* Kazakhstan is accredited to Libya from its embassy in [[Cairo]].\n|}\n\n===Americas===\nKazakhstan's Deputy Foreign Minister [[Yerzhan Ashikbayev]] said that Kazakhstan is seeking \"new perspectives\" and boosting its relations with Latin American nations via a series of diplomatic visits.<ref name=KZLatAm>{{cite news|title=Kazakhstan seeking \"new perspectives\" for cooperation with LatAm|url=http://latino.foxnews.com/latino/politics/2014/06/03/kazakhstan-seeking-new-perspectives-for-cooperation-with-latam/|work=Fox News Latino|access-date=2014-06-12|archive-url=https://web.archive.org/web/20140714183212/http://latino.foxnews.com/latino/politics/2014/06/03/kazakhstan-seeking-new-perspectives-for-cooperation-with-latam/|archive-date=2014-07-14|url-status=dead}}</ref>\n\nAshikbayev attended the 44th General Assembly of the Organization of American States in Asuncion, Paraguay on June 4. Kazakhstan was the largest delegation among the conference's 39 observer nations.<ref name=\"KZLatAm\"/>\n\nThe Secretary General of the Organization of American States (OAS), [[José Miguel Insulza]], on June 3 met with the Deputy Foreign Minister, Yerzhan Ashikbayev, in Asunción, Paraguay, for the 44th OAS General Assembly where Ashikbayev presented a contribution to help fund important OAS programs.<ref name=kzoas>{{cite web|title=OAS Secretary General and Deputy Foreign Minister of Kazakhstan Met in the Context of the General Assembly|date = August 2009|url=https://www.oas.org/en/media_center/photonews.asp?sCodigo=FNE-14809|publisher=Organization of American States}}</ref>\n\nForeign Minister [[Erlan Idrissov]] conducted a four-day visit to Mexico on September 17–20, 2014.<ref name=fox1>{{cite news|title=Mexico, Kazakhstan seek to link Eurasia with Latin America|url=http://latino.foxnews.com/latino/politics/2014/09/19/mexico-kazakhstan-seek-to-link-eurasia-with-latin-america/|work=Fox News Latino|access-date=2014-09-29|archive-url=https://web.archive.org/web/20140922060446/http://latino.foxnews.com/latino/politics/2014/09/19/mexico-kazakhstan-seek-to-link-eurasia-with-latin-america/|archive-date=2014-09-22|url-status=dead}}</ref> During his visit Idrissov met with Mexican Economy Secretary Ildefonso Guajardo, Foreign Secretary Jose Antonio Meade, former President Vincente Fox, other senior officials and business leaders.<ref name=\"fox1\"/> The Minister and his delegation will view the future site of Kazakhstan's embassy in Mexico City.<ref name=fox2>{{cite news|title=Kazakh foreign minister makes historic visit to Mexico|url=http://latino.foxnews.com/latino/politics/2014/09/17/kazakh-foreign-minister-makes-historic-visit-to-mexico/|work=Fox News Latino|access-date=2014-09-29|archive-url=https://web.archive.org/web/20140922150947/http://latino.foxnews.com/latino/politics/2014/09/17/kazakh-foreign-minister-makes-historic-visit-to-mexico/|archive-date=2014-09-22|url-status=dead}}</ref>\nIdrissov said that the main objective of his visit was to build a bridge between Latin America and Eurasia.<ref name=\"fox1\"/> The Foreign Minister underlined that economic and trade collaboration with Kazakhstan will allow investors to reach neighboring markets, such as Russia and China.<ref name=\"fox1\"/> Idrissov also said that Kazakhstan seeks to expand its presence in Latin America and considers Mexico as a strategic ally in building these relations, while Kazakhstan can offer the same support to Mexico in the Eurasian region.<ref name=\"fox1\"/>\n{| class=\"wikitable sortable\" border=\"1\" style=\"width:100%; margin:auto;\"\n!width=\"15%\"| Country\n!width=\"12%\"| Formal Relations Began\n!Notes\n|--valign=\"top\"\n|{{flagu|Brazil}}||<!-- start date -->September 22, 1993||See [[Brazil–Kazakhstan relations]]\n\n* Brazil has an embassy in Astana.\n* Kazakhstan has an embassy in [[Brasília]].\n|--valign=\"top\"\n|{{flagu|Canada}}||<!-- start date -->||See [[Canada–Kazakhstan relations]]\n\nThe countries established diplomatic relations with each other in 1992. Canada has an embassy in [[Astana]]. Kazakhstan has an embassy in [[Ottawa]] and a consulate in [[Toronto]]. Both countries are full members of the [[Organization for Security and Co-operation in Europe]]. The [[President of Kazakhstan]], Nursultan Nazarbayev, made an official visit to Canada in May 2003.\n|--valign=\"top\"\n|{{flagu|Chile}}||<!-- start date -->||\n* Kazakhstan and Chile signed an agreement on mining and energy as well as citizens can visit visa free<ref>{{cite web| url = http://www.santiagotimes.cl/world/chile-abroad/26786-chile-and-kazakhstan-sign-milestone-cooperation-agreements| url-status = dead| archive-url = https://web.archive.org/web/20131005004442/http://www.santiagotimes.cl/world/chile-abroad/26786-chile-and-kazakhstan-sign-milestone-cooperation-agreements| archive-date = 2013-10-05| title = Chile and Kazakhstan sign 'milestone' cooperation agreements}}</ref><ref>{{cite web|url=http://en.trend.az/regions/casia/kazakhstan/2196364.html|title=Kazakhstan, Chile plan to abolish visa system|date=October 1, 2013|work=Trend|access-date=February 20, 2015|archive-url=https://web.archive.org/web/20131219034403/http://en.trend.az/regions/casia/kazakhstan/2196364.html|archive-date=December 19, 2013|url-status=dead}}</ref>\n* Chile is accredited to Kazakhstan from its embassy in Moscow, Russia.\n* Kazakhstan is accredited to Chile from its embassy in Brasilia, Brazil.\n|--valign=\"top\"\n|{{flagu|Mexico}}||<!-- start date -->January 14, 1992|| See [[Kazakhstan–Mexico relations]]\n* Kazakhstan has an embassy in [[Mexico City]].<ref>{{cite web| url = http://mfa.gov.kz/es/mexico| title = Embassy of Kazakhstan in Mexico City (in Kazakh and Spanish)}}</ref>\n* Mexico is accredited to Kazakhstan from its embassy in [[Ankara]], [[Turkey]] and maintains an honorary consulate in [[Almaty]].<ref>{{cite web| url = https://embamex.sre.gob.mx/turquia/| title = Embassy of Mexico in Turkey (in Spanish and Turkish)}}</ref>\n|--valign=\"top\"\n|{{flagu|United States}}||December 16, 1991<!-- start date -->\n| See [[Kazakhstan–United States relations]]\n* Former [[United States Vice President|Vice President]] [[Dick Cheney]] visited Kazakhstan on May 5, 2006.<ref name=VISIT>[https://select.nytimes.com/gst/abstract.html?res=F40B15FA345B0C758CDDAC0894DE404482&n=Top%2fNews%2fWorld%2fCountries%20and%20Territories%2fKazakhstan Cheney, Visiting Kazakhstan, Wades Into Energy Battle] {{Webarchive|url=https://web.archive.org/web/20120315222220/http://select.nytimes.com/gst/abstract.html?res=F40B15FA345B0C758CDDAC0894DE404482&n=Top%2fNews%2fWorld%2fCountries%20and%20Territories%2fKazakhstan |date=2012-03-15 }} New York Times</ref> The bedrock of U.S. – Kazakhstan cooperation is on nuclear nonproliferation and security.<ref name=\"factsheet2016\">{{cite web|title=U.S. Relations With Kazakhstan|url=https://2009-2017.state.gov/r/pa/ei/bgn/5487.htm|publisher=U.S. State Department}}</ref>\n\nThe United States and Kazakhstan have a platform for bilateral communication called the U.S.-Kazakhstan Strategic Partnership Dialogue.<ref name=\"spdkzusa\">{{cite web|title=Joint Statement of the Fourth U.S.-Kazakhstan Strategic Partnership Dialogue|url=https://2009-2017.state.gov/r/pa/prs/ps/2015/11/249067.htm|publisher=US State Department|access-date=2017-06-24}}</ref>\n\n* Kazakhstan has an embassy in [[Washington, D.C.]],<ref>{{cite web| url = http://www.kazakhembus.com/| title = Embassy of Kazakhstan in Washington, D.C.| access-date = 2014-03-23| archive-date = 2015-03-16| archive-url = https://web.archive.org/web/20150316153559/http://www.kazakhembus.com/| url-status = dead}}</ref> and a consulate general in New York City.<ref>{{cite web| url = http://www.kazconsulny.org| title = Consulate general of Kazakhstan in New York City}}</ref>\n* United States has an embassy in Astana and a consulate-general in Almaty.<ref>{{Cite web |url=http://kazakhstan.usembassy.gov/ |title=Embassy of the United States in Astana |access-date=2015-11-09 |archive-url=https://web.archive.org/web/20151022041116/http://kazakhstan.usembassy.gov/ |archive-date=2015-10-22 |url-status=dead }}</ref>\n|}\n\n===Asia===\n{| class=\"wikitable sortable\" border=\"1\" style=\"width:100%; margin:auto;\"\n!width=\"15%\"| Country\n!width=\"12%\"| Formal relations began\n!Notes\n|--valign=\"top\"\n|{{flagu|Afghanistan|2013}}<!-- start date -->||February 1992\n|\nSee [[Afghanistan–Kazakhstan relations]]\n* Afghanistan has an embassy in Astana.\n* Kazakhstan has an embassy in [[Kabul]].\n|--valign=\"top\"\n|{{flagu|Armenia}}<!-- start date -->||\n|\nSee [[Armenia–Kazakhstan relations]]\n* Since 1992, Armenia has had an embassy in Astana.\n* Kazakhstan has an embassy in [[Yerevan]].\n* Both countries are full members of the [[Collective Security Treaty Organisation]], of the [[Organization for Security and Co-operation in Europe]] and of the [[Commonwealth of Independent States]].\n* There are 25,000 people of [[Armenians|Armenian descent]] living in Kazakhstan.\n* Between September 1 and 2, 1999, Armenian president [[Robert Kocharyan]] made an official visit to Kazakhstan.\n* In May 2001, [[List of leaders of Kazakhstan|Kazakh president]] [[Nursultan Nazarbayev]] made an official visit to Armenia.\n* [https://web.archive.org/web/20120419065538/http://portal.mfa.kz/portal/page/portal/mfa/en/content/policy/cooperation/CIS/07  Kazakh Ministry of Foreign Affairs about relations with Armenia]\n|--valign=\"top\"\n|{{flagu|Azerbaijan }}||<!-- start date -->27 August 1992||See [[Azerbaijan–Kazakhstan relations]]\n\n* Azerbaijan has an embassy in Astana. \n* Kazakhstan has had an embassy in [[Baku]].\n*Both countries are full members of the [[Turkic Council]], the [[International Organization of Turkic Culture]], and [[Organization for Security and Co-operation in Europe]].\n*There are over 85,000 people of [[Azerbaijanis|Azerbaijani descent]] living in Kazakhstan. See [[Azerbaijanis in Kazakhstan]].\n|--valign=\"top\"\n|{{flagu|Bahrain}}||<!--start date-->||\nPresident Nursultan Nazarbayev welcomed [[Sheikh Hamad Bin Isa Al-Khalifa]], King of the Kingdom of Bahrain, on his first ever trip and the first by an Arab leader to the Republic.<ref>{{cite web|url=http://www.gulf-daily-news.com/NewsDetails.aspx?storyid=374924|title=Gulf Daily News \" Local News \" THE WAY FORWARD|access-date=February 20, 2015|archive-date=February 21, 2015|archive-url=https://web.archive.org/web/20150221010423/http://www.gulf-daily-news.com/NewsDetails.aspx?storyid=374924|url-status=dead}}</ref> He has stressed Bahrain as a key partner in the Arab world at a press conference and has ensured that this visit has led to a new page in the relations between bonding the two nations<ref>{{cite web|url=http://www.gulf-daily-news.com/NewsDetails.aspx?storyid=374937|title=Gulf Daily News \" Local News \" Bahrain 'key partner in Arab world'|access-date=February 20, 2015}}</ref> The Kazakh Government has created the Bahraini-Kazakh Business Council, unveiling plans to sign an agreement on encouraging and protecting investment, avoiding taxation and fiscal evasion.<ref>{{cite web|url=http://www.tradearabia.com/news/LAW_256132.html|title=Bahrain plans major Kazakhstan investment|access-date=February 20, 2015}}</ref>\n|--valign=\"top\"\n|{{flag|Bangladesh}}||\n|See [[Bangladesh–Kazakhstan relations]]\nBoth Bangladesh and Kazakhstan are keen to expand the bilateral trade and have been undertaking various measures in this regard.<ref>{{cite news |url=http://archive.thedailystar.net/newDesign/news-details.php?nid=187006 |title=FM stresses trade with Kazakhstan |work=The Daily Star |date=2011-05-24 |access-date=2014-01-23 |archive-date=2014-02-01 |archive-url=https://web.archive.org/web/20140201223955/http://archive.thedailystar.net/newDesign/news-details.php?nid=187006 |url-status=dead }}</ref><ref>{{cite web |url=http://bangladesh2day.com/newsfinance/2009/October/30/Kazakhstan-to-open-consulate-in-Dhaka.php |title=Kazakhstan to open consulate in Dhaka 30 October, 2009 |publisher=Bangladesh Today |date=2009-10-30 |access-date=2014-01-23 |archive-url=https://web.archive.org/web/20140201170058/http://bangladesh2day.com/newsfinance/2009/October/30/Kazakhstan-to-open-consulate-in-Dhaka.php |archive-date=2014-02-01 |url-status=dead }}</ref> Bangladeshi products including jute, jute goods, tea, medicine and garments have been identified as products with high potential in Kazakhstani market.<ref name=\"ib\">{{cite web |url=http://www.independent-bangladesh.com/200804194512/country/relationship-with-kazakhstan-would-grow-further.html |title=Relationship with Kazakhstan would grow further |publisher=Daily Independent |date=2008-04-19 |access-date=2014-01-23 |archive-date=2015-09-24 |archive-url=https://web.archive.org/web/20150924034241/http://www.independent-bangladesh.com/200804194512/country/relationship-with-kazakhstan-would-grow-further.html |url-status=usurped }}</ref> In 2008, the two countries formed joint economic commission to increase the economic activities between the two countries.<ref>{{cite news |url=http://archive.thedailystar.net/newDesign/news-details.php?nid=32650 |title=Form joint economic body to strengthen ties |work=The Daily Star |date=2008-04-18 |access-date=2014-01-23 |archive-date=2014-02-01 |archive-url=https://web.archive.org/web/20140201223942/http://archive.thedailystar.net/newDesign/news-details.php?nid=32650 |url-status=dead }}</ref> In 2012, Bangladesh was granted duty-free access to Kazakhstan's market.<ref>{{cite news |url=http://www1.bssnews.net/newsDetails.php?cat=0&id=292131&date=2012-11-11 |title=Dhaka to get duty-free access to Russia, Belarus and Kazakhstan |work=Bangladesh Sangbad Sangstha (BSS) |access-date=2014-01-23 |archive-url=https://web.archive.org/web/20140201222211/http://www1.bssnews.net/newsDetails.php?cat=0&id=292131&date=2012-11-11 |archive-date=2014-02-01 |url-status=dead }}</ref> In 2013, a high level business delegation from Bangladesh, led by former commerce secretary Mahbub Ahmed, paid a visit to Kazakhstan to explore ways for increasing bilateral trade.<ref>{{cite news |url=http://www.dhakatribune.com/business/2013/sep/27/team-visit-russia-explore-trade-opportunities |title=Team to visit Russia to explore trade opportunities |work=Dhaka Tribune |access-date=2014-01-23}}</ref>\n|--valign=\"top\"\n|{{flagu|China}} ||<!-- start date --> 1992-01-03\n| See [[China–Kazakhstan relations]]\n* The two nations signed their first boundary agreement in April 1994, and their second supplementary boundary agreement in July 1998 to mark their 1,700&nbsp;km shared border.<ref name=CHINA>[http://www.chinadaily.com.cn/en/doc/2003-05/27/content_166588.htm   Brief introduction to relations between China and Kazakhstan] China Daily</ref> \n|--valign=\"top\" \n|{{flagu|Georgia}}||{{dts|format=dmy|1992|7|24}}<ref>{{cite web|title=Relations between Georgia and the Republic of Kazakhstan|url=http://www.mfa.gov.ge/index.php?sec_id=375&lang_id=ENG|publisher=[[Ministry of Foreign Affairs (Georgia)]]|access-date=12 July 2011|archive-url=https://web.archive.org/web/20110904152454/http://www.mfa.gov.ge/index.php?sec_id=375&lang_id=ENG|archive-date=4 September 2011|url-status=dead}}</ref>\n|\n*Georgia has an embassy in Astana and an honorary consulate in [[Almaty]].\n*Kazakhstan has an embassy in [[Tbilisi]].\n*Both countries are full members of the [[Organization for Security and Co-operation in Europe]].\n*[https://web.archive.org/web/20080903225856/http://www.mfa.gov.ge/index.php?sec_id=445&lang_id=ENG Georgian Ministry of Foreign Affairs about the relation with Kazakhstan]\n*[https://web.archive.org/web/20110727053103/http://portal.mfa.kz/portal/page/portal/mfa/en/content/policy/cooperation/CIS/05 Kazakh Ministry of Foreign Affairs about the relation with Georgia] \n|--valign=\"top\"\n|{{flagu|India }}||<!-- start date -->|| See [[India–Kazakhstan relations]]\n|--valign=\"top\"\n|{{flagu|Indonesia }}||<!-- start date -->2 June 1993|| See [[Indonesia–Kazakhstan relations]]\n*Indonesia has an embassy in [[Astana]].\n*Kazakhstan has an embassy in [[Jakarta]].\n*Both nations are member of [[Organisation of Islamic Cooperation]]. \n|--valign=\"top\"\n|{{flagu|Iran }}<!-- start date -->||\n|See [[Iran–Kazakhstan relations]]\n* Iran has an embassy in Astana and consulates-general in Aktau and Almaty.\n* Kazakhstan has an embassy in [[Tehran]] and consulates-general in [[Bandar Abbas]] and [[Gorgan]].\n|--valign=\"top\"\n|{{flagu|Israel }}||<!-- start date -->|| See [[Israel–Kazakhstan relations]]\nNotwithstanding its membership in the [[Organisation of Islamic Cooperation]], Kazakhstan has good relations with Israel. Diplomatic relations were established in 1992 and President [[Nazarbayev]] paid official visits to Israel in 1995 and 2000.<ref name=is>[http://www.kazakhemb.org.il/?CategoryID=165&ArticleID=163 About Kazakhstan–Israeli relations] {{webarchive|url=https://web.archive.org/web/20110721203600/http://www.kazakhemb.org.il/?CategoryID=165&ArticleID=163 |date=2011-07-21 }} Embassy of Kazakhstan in Israel</ref> In 2006, during a state visit by Kazakh Deputy Prime Minister [[Karim Masimov]], Israeli Prime Minister [[Ehud Olmert]] remarked, \"Kazakhstan can show a beautiful face of Islam ... Contemporary, ever-developing Kazakhstan is a perfect example of both economic development and interethnic accord that should be followed by more Muslim states.\"<ref>{{Cite news|last=Eglash|first=Ruth|title=Kazakhs seek stronger ties with Israel|newspaper=The Jerusalem Post|date=November 6, 2006|url=http://fr.jpost.com/servlet/Satellite?cid=1162378331988&pagename=JPost/JPArticle/ShowFull|url-status=dead|archive-url=https://web.archive.org/web/20120111191347/http://fr.jpost.com/servlet/Satellite?cid=1162378331988&pagename=JPost%2FJPArticle%2FShowFull|archive-date=January 11, 2012}}</ref> Bilateral trade between the two countries amounted to $364m  in exports to Israel, mostly crude oil, and $118M in imports.<ref>{{Cite web |title=Kazakhstan (KAZ) and Israel (ISR) Trade |url=https://oec.world/en/profile/bilateral-country/kaz/partner/isr |access-date=2025-11-07 |website=The Observatory of Economic Complexity |language=en}}</ref> \n|--valign=\"top\"\n|{{flagu|Kyrgyzstan }}||<!-- start date -->||See [[Kazakhstan–Kyrgyzstan relations]]\n\nBilateral relationships between the countries are very strong and Kyrgyz and Kazakh are very close in terms of language, culture and religion. Kyrgyz-Kazakh relationships have always been at a very high level and economic and other formal unification of two countries have been greeted with strong appreciation by both nations since the two share a lot in common.  On April 26, 2007, the presidents of Kazakhstan and Kyrgyzstan signed an agreement to create an \"International Supreme Council\" between the two states. This historic event took place during an official visit of the Kazakh president to the Kyrgyzstan capital, Bishkek.<ref name=cs>s\". [http://www.caucaz.com/home_eng/depeches.php?idp=1703 ''Central Asia: A Kyrgyz-Kazakh Step Towards Regional Union''] ''This article incorporates text from this source, which is in the public domain.''</ref>\n|--valign=\"top\"\n|{{flagu|Malaysia}}||March 16, 1992|| See [[Kazakhstan–Malaysia relations]]\nKazakhstan has an embassy in [[Kuala Lumpur]] while Malaysia has an embassy in Almaty. Both are members of [[Organisation of Islamic Cooperation]] (OIC).\n|--valign=\"top\"\n|{{flagu|Pakistan }}||<!-- start date -->|| See [[Kazakhstan–Pakistan relations]]\nRelations between the two countries began when Pakistan recognized Kazakhstan on December 20, 1991. On February 24, 1992, diplomatic and consular relations were established during an official visit by Kazakhstani president Nursultan Nazarbayev to Pakistan.<ref name=kzmfa>[http://portal.mfa.kz/portal/page/portal/mfa/en/content/policy/cooperation/asia_africa/03 Cooperation of the Republic of Kazakhstan with the Islamic Republic of Pakistan] {{webarchive |url=https://web.archive.org/web/20120419065721/http://portal.mfa.kz/portal/page/portal/mfa/en/content/policy/cooperation/asia_africa/03 |date=April 19, 2012 }} Kazakhstan Ministry of Foreign Affairs</ref> Kazakhstan is an emerging market for Pakistani goods.<ref>[http://www.epb.gov.pk/v1/news/details.php?param=MzU5d  Trade Development Authority of Pakistan] {{webarchive|url=https://web.archive.org/web/20120717084656/http://www.epb.gov.pk/v1/news/details.php?param=MzU5d |date=2012-07-17 }}</ref>\n|--valign=\"top\"\n|{{flagu|Philippines}} ||<!-- start date --> 1992-03-19\n| \nDiplomatic relations between the Kazakhstan and the Philippines were formally established on March 19, 1992. The Philippines maintains relations with Kazakhstan through its embassy in Moscow in Russia. Kazakhstan has an honorary consulate in [[Manila]].<ref name=\"philstar\">{{Cite web|url=http://www.philstar.com/headlines/227525/kazakh-leader-arrives-state-visit|title = Kazakh leader arrives for state visit| website=[[The Philippine STAR]] }}</ref><ref>{{cite web|url=http://www.kazakhstan.com.ph/index.html|archive-url=https://web.archive.org/web/20120426063318/http://www.kazakhstan.com.ph/index.html|url-status=dead|archive-date=April 26, 2012|title=The Honorary Consulate of the Republic of Kazakhstan to the Republic of the Philippines|access-date=February 20, 2015}}</ref>\nTrade between Kazakhstan and the Philippines amounted to 7.3&nbsp;million during January to November 2010. In 2009, about 1,500 Kazakh tourists visited the Philippines. As of 2009, there are about 7,000 [[Overseas Filipino Workers]] are working in Western Kazakhstan, mostly in the oil and gas sector. Kazakhstan is attracting Philippine companies to invest in the country.<ref name=\"malay\">{{cite web |url=http://www.kazembassy.org.my/kaz_phi.htm |title=Kazakhstan - Philippines |access-date=2013-11-11 |url-status=dead |archive-url=https://web.archive.org/web/20131111164841/http://www.kazembassy.org.my/kaz_phi.htm |archive-date=2013-11-11 }}</ref>\nOn 2011, Kazakhstan is planning to put up a Kazakhstan house in the Philippines either in the [[Bonifacio Global City]] or [[Makati]] to showcase Kazakh products and promote its tourist destinations. There is also plans to put up a Philippine House in Kazakhstan for the same purpose and there is also plans to put Filipino art exhibits in Kazakhstan<ref>{{cite web|url=http://www.kazakhstan.com.ph/news.html|title=The Honorary Consulate of the Republic of Kazakhstan to the Republic of the Philippines|access-date=February 20, 2015|url-status=dead|archive-url=https://web.archive.org/web/20131111171016/http://www.kazakhstan.com.ph/news.html|archive-date=November 11, 2013}}</ref>\nKazakh President Nursultan Nazarbayev, and his 27 delegates arrived in the Philippines for a three-day state visit on November 10, 2003, at the [[Villamor Airbase]] in [[Pasay]]. The Kazakh officials met with their Filipino counterparts and conducted meetings. Former Philippine President [[Gloria Macapagal Arroyo]] met with Nazarbayev to finalize the Philippine's intent to import oil and coal from Kazakhstan and discussed possible infrastructure projects in the Central Asian country.<ref name=\"philstar\"/>\nThe Philippines also supported Kazakhstan bid to become a member of the [[ASEAN Regional Forum]] on security.<ref name=\"malay\"/>\n|--valign=\"top\"\n|{{flagu|Qatar }}||July 1, 1993||See [[Kazakhstan–Qatar relations]] \n|--valign=\"top\"\n|{{flagu|South Korea }}||<!-- start date -->January 28, 1992<ref name=\"mofa.go.kr\">{{cite web |url=http://www.mofa.go.kr/ENG/countries/europe/countries/20070803/1_24646.jsp?menu=m_30_40 |title=Ministry of Foreign Affairs, Republic of Korea |website=www.mofa.go.kr |access-date=15 January 2022 |archive-url=https://web.archive.org/web/20131224082349/http://www.mofa.go.kr/ENG/countries/europe/countries/20070803/1_24646.jsp?menu=m_30_40 |archive-date=24 December 2013 |url-status=dead}}</ref>|| See [[Kazakhstan–South Korea relations]] \n* The establishment of diplomatic relations between South Korea and Kazakhstan began on January 28, 1992.\n* The South Korea has an embassy in Astana.\n* The Kazakhstan of has an embassy in [[Seoul]].  \n* Number of the South Korean living in Kazakhstan as of in 2013 is about 2,500. \n* Bilateral Trade in 2013 about US$1,323 million\n** Exports 1,074million US dollars\n** Imports 249&nbsp;million US dollars\n* The Republic of Korea's Investment in Kazakhstan of in 2013 about US$3,246 million (Largest Investment in Asia)\n\nBilateral relations have grown steadily since that time. Cooperation between the two nations has grown in political, economic, and educational spheres. The presence of 100,000 ethnic Koreans living in Kazakhstan (known as [[Koryo-saram]]) creates an additional link between the two countries.<ref name=rokmofa>[https://web.archive.org/web/20080524022727/http://www.mofat.go.kr/english/regions/europe/20070803/1_311.jsp Kazakhstan] Korean Ministry of Foreign Affairs</ref>\n|--valign=\"top\"\n|{{flagu|Syria }}||<!-- start date -->||\n\nSyria faces the largest humanitarian crisis as a civil war has been raging in the country since 2011. Kazakhstan donated funds to help Syrian refugees fleeing the country. In 2012, about $400,000 were allocated by the country through the Organization of Islamic Cooperation, to the governments of Jordan and Lebanon to provide assistance to Syrians residing in refugee camps.{{Citation needed|date=November 2020}} Also, in 2015 Kazakhstan allocated 300,000 euros to Syrian refugees for the supply of medicine, food and construction materials.{{Citation needed|date=November 2020}}\n\nKazakhstan sent its next humanitarian aid to Syria in January 2017. The 500 tonnes of supply of food and medications were delivered to Tartus Port on the Mediterranean coast of Syria.<ref>{{cite web|title=Kazakhstan delivers humanitarian aid to Syrian Tartus|url=http://www.inform.kz/en/kazakhstan-delivers-humanitarian-aid-to-syrian-tartus_a2986484|website=inform.kz|date=6 January 2017}}</ref>\n|--valign=\"top\"\n\n|{{flagu|Turkey}}||<!-- start date -->March 2, 1992<ref name=\"auto38\">{{Cite web | url=http://www.mfa.gov.tr/relations-between-turkey-and-kazakhstan.en.mfa |title=Relations between Turkey and Kazakhstan|publisher=Ministry of Foreign Affairs |access-date=6 October 2020}}</ref>||See [[Kazakhstan–Turkey relations]]\n* Kazakhstan has an embassy in [[Ankara]] and an consulates-general in [[Antalya]] and [[Istanbul]]. \n* Turkey has an embassy in [[Astana]] and an consulates-general in [[Aktau]] and [[Almaty]].\n*Both countries are members of [[Asia Cooperation Dialogue]], [[Economic Cooperation Organization]], [[International Organization of Turkic Culture]], [[OIC]], [[TAKM]], [[Turkic Council]], [[TURKPA]], [[OSCE]] and [[WTO]]. \n*Trade volume between the two countries was US$3.9 billion in 2019 (Kazakh exports/imports: 3/0.9 billion USD).<ref>{{Cite web | url=http://www.mfa.gov.tr/economic-relations-between-turkey-and-republic-of-kazakhstan.en.mfa| title=Relations between Turkey and Kazakhstan|publisher=Ministry of Foreign Affairs |access-date=6 October 2020}}</ref>\n*[[Yunus Emre Institute]] has a local headquarters in [[Astana]].\n|--valign=\"top\"\n\n|{{flagu|Turkmenistan }}||<!-- start date -->||See [[Kazakhstan–Turkmenistan relations]]\n\n* Kazakhstan has an embassy in [[Ashgabat]].\n* Turkmenistan has an embassy in Astana.\n* During a meeting in October 2023, Kazakhstan and Turkmenistan released a statement affirming their strategic partnership and cooperation. Kazakh Deputy Prime Minister and Foreign Minister [[Murat Nurtleu]] and Turkmen Deputy Prime Minister and Foreign Minister [[Rashid Meredov]] issued the statement during a meeting in [[Ashgabat]] on 30 October 2023.<ref> {{Citation | vauthors=((Ualikhanova, A.)) | date=31 October 2023 | title=Kazakhstan, Turkmenistan Affirm Commitment to Strengthen Strategic Partnership | website=Astana Times | url=https://astanatimes.com/2023/10/kazakhstan-turkmenistan-affirm-commitment-to-strengthen-strategic-partnership/ | access-date=3 May 2024}}</ref>\n|--valign=\"top\"\n|{{flagu|Uzbekistan }}||<!-- start date -->||See [[Kazakhstan–Uzbekistan relations]]\n\n* Kazakhstan–Uzbekistan relations have always been sincere and strong. Since the rapid development of Kazakhstan the president of Uzbekistan Mr. Karimov has visited Kazakhstan several times.\n|}\n\n===Europe===\n==== European Free Trade Association ====\nDelegations from the [[European Free Trade Association|EFTA]] States, Iceland, Liechtenstein, Norway and Switzerland met with Russia, Belarus and Kazakhstan for a first round of negotiations on a broad-based Free Trade Agreement on January 11–13, 2011 in Geneva.\n\nThe launching of EFTA-Russia/Belarus/Kazakhstan free trade negotiations had been announced in November 2010 by Ministers from the seven participating States, following a preparatory process including a Joint Feasibility Study.\n\nThe 11th round of free trade negotiations was conducted from January 27 to 30, 2014 in Astana, Kazakhstan. A 12th round of negotiations scheduled for April 2014 has been postponed. No new dates have been set yet.\n\n====European Union====\n{{See also|Kazakhstan–European Union relations}}\nThe Partnership and Cooperation Agreement (PCA) with Kazakhstan has been the legal framework for [[European Union]]-Kazakhstan bilateral relations since it entered into force in 1999. In November 2006 a Memorandum of Understanding on cooperation in the field of energy between the EU and Kazakhstan has been signed establishing the basis for enhanced cooperation.\n\nThe future European Commission assistance will focus on the following priority areas: promotion of the ongoing reform process at political, economic, judiciary and social level, infrastructure building, and cooperation in the energy sector.\n\nThe overall EU co-operation objectives, policy responses and priority fields for Central Asia can be found in the EC Regional Strategy Paper for Central Asia 2007–2013. In addition to the assistance under the Development Cooperation Instrument (DCI), Kazakhstan participates in several ongoing regional programs.\n\nOn January 20, 2015 Kazakhstan and the EU initialed the EU-Kazakhstan Enhanced Partnership and Cooperation Agreement.<ref name=EPCA>{{cite web|title=Press release: EU and Kazakhstan initial Enhanced Partnership and Cooperation Agreement|url=http://eeas.europa.eu/statements-eeas/2015/150120_01_en.htm|website=eeas.europa.eu/}}</ref> This agreement will greatly facilitate stronger political and economic relations between Kazakhstan and the EU.<ref name=EPCA /> It will increase the flow of trade, services and investment between the parties and will contribute to Kazakhstan's political and social development.<ref name=EPCA />\n\nBilateral relations received a post-pandemic refocus with the EU visit by Kazakhstan's president in November 2021.<ref name=\"eu-1st-visit\">{{cite web |title=EU-Kazakhstan cooperation in the spotlight as President Tokayev visits Brussels |url=https://www.european-views.com/2021/11/eu-kazakhstan-cooperation-in-the-spotlight-as-president-tokayev-visits-brussels/}}</ref> The visit was the first to Europe by Tokayev since becoming president in 2019.<ref name=\"eu-1st-visit\" />\n\n====European countries====\n{| class=\"wikitable sortable\" border=\"1\" style=\"width:100%; margin:auto;\"\n!width=\"15%\"| Country\n!width=\"12%\"| Formal Relations Began\n!Notes\n|--valign=\"top\"\n|{{flagu|Austria}}<!-- start date -->||\n|See [[Austria–Kazakhstan relations]]\n* Austria has an embassy in Astana.\n* Kazakhstan has an embassy in [[Vienna]]. \n|--valign=\"top\"\n|{{flagu|Bulgaria }}||<!-- start date -->1992-07-05|| \n* Since 1994, Bulgaria has had an embassy in Astana.<ref>{{cite web| url = http://www.mfa.bg/almaty/index.php?lang=en| title = Bulgarian embassy in Astana}}</ref>\n* Since November 2004, Kazakhstan has had an embassy and an honorary consulate in [[Sofia]].\n|--valign=\"top\"\n|{{flagu|Croatia}}||<!-- start date -->||See [[Foreign relations of Croatia|Croatia–Kazakhstan relations]]\n* Relations between two countries are very close. Kazakh President Nursultan Nazarbayev made a state visits to Croatia in 2001,2006 and is expected to visit Croatia in summer of 2015.Croatian President [[Stjepan Mesić]] visited Kazakhstan several times. Croatian Foreign Minister [[Vesna Pusić]] visited Kazakhstan in 2014, while Prime Minister [[Zoran Milanović]] visited that country on May 27, 2015.\n|--valign=\"top\"\n|{{flagu|Denmark}}||<!-- start date -->1992-05-06||See [[Denmark–Kazakhstan relations]] \n|--valign=\"top\"\n|{{flagu|Finland}}<!-- start date -->||\n|See [[Finland–Kazakhstan relations]]\n* Finland has an embassy in Astana.\n* Kazakhstan has an embassy in [[Helsinki]].\n|--valign=\"top\"\n|{{flagu|France}}||<!-- start date -->25 January 1992\n|See [[France–Kazakhstan relations]] \n* France has an embassy in Astana.\n* Kazakhstan has an embassy in [[Paris]].\n* Kazakhstan and France formed bilateral relation in 1993 under President [[François Mitterrand|Mitterrand]].\n* President Nazarbayev has visited the country ten times since its independence.\n* President [[Nicolas Sarkozy]] visited Kazakhstan in 2009.\n* The Franco-Kazakh relationship has become stronger from #Kazakhstan hosting the [[Expo 2017|2017 World Expo]].\n* Kazakhstan and France implemented 11 technology projects focusing on aerospace.<ref>{{cite web|url=http://bnews.kz/en/news/post/186885/|title=Kazakhstan & France implemented 11 new joint technologic projects|work=bnews.kz|access-date=February 20, 2015|archive-url=https://web.archive.org/web/20150220235908/http://bnews.kz/en/news/post/186885/|archive-date=February 20, 2015|url-status=dead}}</ref>\n* President [[François Hollande]] visited Kazakhstan in December 2014.<ref>{{cite news|title=Hollande in uranium-rich Kazakhstan to discuss contracts, relations with Russia|url=http://www.english.rfi.fr/asia-pacific/20141205-hollande-uranium-rich-kazakhstan-discuss-contracts-relations-russia|access-date=January 26, 2015|publisher=[[Radio France Internationale]]|date=December 5, 2014}}</ref> \n|--valign=\"top\"\n|{{flagu|Germany}}<!-- start date -->||\n|See [[Germany–Kazakhstan relations]]\n* Germany has an embassy in Astana.\n* Kazakhstan has an embassy in [[Berlin]].\n|--valign=\"top\"\n|{{flagu|Greece}}||<!-- start date -->1 October 1992||See [[Greece–Kazakhstan relations]] \n* Greece has an embassy in Astana.\n* Kazakhstan has an embassy in [[Athens]].\n|--valign=\"top\"\n|{{flagu|Hungary}}||<!-- start date --> 1992-03-23\n|See [[Hungary–Kazakhstan relations]]\n* Hungary opened an embassy in Astana in March 1992.\n* Kazakhstan opened an embassy in [[Budapest]] in September 1993.\n* Foreign Minister [[Erlan Idrisov]] made his first state visit to Hungary on November 20, 2013<ref>{{cite web|url=http://www.bnews.kz/en/news/post/172155/|title=Kazakhstan FM paid an official visit to Hungary|work=bnews.kz|access-date=February 20, 2015|archive-url=https://web.archive.org/web/20150221000656/http://bnews.kz/en/news/post/172155/|archive-date=February 21, 2015|url-status=dead}}</ref>\n* Hungarian Foreign Minister [[Viktor Orbán]] has intensified the bilateral relationship with \"progress of the brotherly people.\"<ref>{{cite web|url=http://www.kazinform.kz/eng/article/2606884|title=Hungarians have warm feelings towards Kazakhstan and they are \"proud to follow the progress of the brotherly people\" – Hungarian Prime Minister Viktor Orban|access-date=February 20, 2015}}</ref>\n* [https://web.archive.org/web/20150222021810/http://www.kazembassy.hu/eng/index.php?x=almenuk%2Fkazah_magy_alt%2F Kazakhstan Embassy in Hungary] \n|--valign=\"top\"\n|{{flagu|Italy}}<!-- start date -->||\n|See [[Italy–Kazakhstan relations]]\n* Italy has an embassy in Astana.\n* Kazakhstan has an embassy in [[Rome]].\n|--valign=\"top\"\n|{{flagu|Latvia}}||<!-- start date --> 1992-12-30\n|\n* Kazakhstan recognised Latvia's independence on December 23, 1991.\n* Latvia recognised the independence of Kazakhstan on January 8, 1992.\n* Kazakhstan is represented in Latvia through its embassy in [[Vilnius]] (Lithuania) and through an honorary consulate in [[Riga]].<ref>{{cite web| url = http://kazakhstan.embassy.lt/| title = Kazakh embassy in Vilnius (also accredited to Latvia)| access-date = 2009-05-23| archive-date = 2009-08-30| archive-url = https://web.archive.org/web/20090830182127/http://kazakhstan.embassy.lt/| url-status = dead}}</ref>\n* Latvia has an embassy in Astana and an honorary consulate in Almaty.\n* [https://web.archive.org/web/20080621120412/http://www.am.gov.lv/en/policy/bilateral-relations/4542/Kazakhstan/  Latvian Ministry of Foreign Affairs about the relation with Kazakhstan]\n|--valign=\"top\"\n|{{flagu|Lithuania }}||<!-- start date -->\n|\n* Kazakhstan has an embassy in [[Vilnius]].<ref>{{cite web| url = http://kazakhstan.embassy.lt/| title = Kazakh embassy in Vilnius| access-date = 2009-05-23| archive-date = 2009-08-30| archive-url = https://web.archive.org/web/20090830182127/http://kazakhstan.embassy.lt/| url-status = dead}}</ref>\n* Lithuania has an embassy in Astana and an honorary consulate in Almaty.<ref>{{cite web|url=http://kz.mfa.lt/|title=Ministry of Foreign Affairs – Ministry of Foreign Affairs|author=Dizaino Kryptis|access-date=February 20, 2015}}</ref>\n* [http://www.urm.lt/index.php?-1518343441   Lithuanian Ministry of Foreign Affairs: list of bilateral treaties with Kazakhstan (in Lithuanian only)] {{Webarchive|url=https://web.archive.org/web/20110930134053/http://www.urm.lt/index.php?-1518343441 |date=2011-09-30 }}\n* Foreign Minister [[Erlan Idrissov|Idrissov]] and Foreign Minister Linas Linkevicius signed an action plan for 2014–2015.<ref>{{cite web|url=http://www.bnews.kz/en/news/post/183396/|title=Kazakhstan and Lithuania sign cooperation plan for 2014–2015|work=bnews.kz|access-date=February 20, 2015|archive-url=https://web.archive.org/web/20150221002607/http://bnews.kz/en/news/post/183396/|archive-date=February 21, 2015|url-status=dead}}</ref> \n|--valign=\"top\"\n|{{flagu|Monaco}}||<!-- start date -->\n|\n* Kazakhstan and Monaco signed a tourism cooperation agreement on September 27, 2013<ref>{{cite web|url=http://www.inform.kz/eng/article/2592923|title=Kazakhstan and Monaco step up tourism cooperation|access-date=February 20, 2015}}</ref>\n* Kazakhstan and Monaco signed a trade and investment agreement worth $73&nbsp;billion in 2013<ref>{{Cite web |url=http://kazpravda.kz/eng/?p=1694 |title=Kazakhstan — Monaco: A new stage of relations |access-date=2013-11-01 |archive-url=https://web.archive.org/web/20131102132228/http://kazpravda.kz/eng/?p=1694 |archive-date=2013-11-02 |url-status=dead }}</ref> \n|--valign=\"top\"\n|{{flagu|Netherlands}}<!-- start date -->||\n|See [[Kazakhstan–Netherlands relations]]\n* Kazakhstan has an embassy in [[The Hague]].\n* Netherlands has an embassy in Astana.\n|--valign=\"top\"\n|{{flagu|Norway}}||<!-- start date -->\n|\n* Kazakhstan has an embassy in [[Oslo]].\n*President Nazarbayev visited Oslo for the first time in April 2001.<ref>{{Cite web|author=Talgat Marat |date=2021-04-26|title=Kazakhstan and Norway: Discovering Each Other Twenty Years Since Nazarbayev's First Visit to Oslo|url=https://astanatimes.com/2021/04/kazakhstan-and-norway-discovering-each-other-twenty-years-since-nazarbayevs-first-visit-to-oslo/|access-date=2021-05-19|website=The Astana Times|type=Op-ed|language=en}}</ref> \n|--valign=\"top\"\n|{{flagu|Poland}}<!-- start date -->||\n|See [[Kazakhstan–Poland relations]]\n* Kazakhstan has an embassy in [[Warsaw]].\n* Poland has an embassy in Astana.\n|--valign=\"top\"\n|{{flagu|Romania }}||<!-- start date -->1992-07-15\n|\n* Kazakhstan has an embassy in [[Bucharest]] and an honorary consulate in [[Cluj-Napoca]].\n* Romania has an embassy in Astana.\n* There are around 20,000 Romanians living in Kazakhstan.<ref>{{Cite web|last=Seisembayeva |first=Aigerim |date=2018-04-25|title=Romania, Kazakhstan interested in multiple partnerships, Romanian MP says|url=https://astanatimes.com/2018/04/romania-kazakhstan-interested-in-multiple-partnerships-romanian-mp-says-2/|access-date=2021-05-19|website=The Astana Times|language=en}}</ref>\n* [https://web.archive.org/web/20180626220618/http://mfa.kz/en/content-view/sotrudnichestvo-respubliki-kazakhstan-s-rumyniej  Kazakh Ministry of Foreign Affairs about the relations with Romania]\n|--valign=\"top\"\n|{{flagu|Russia }}||<!-- start date -->|| See [[Kazakhstan–Russia relations]]\n\nKazakhstan has an [[Embassy of Kazakhstan in Moscow]], consulate-general in Saint Petersburg, [[Astrakhan]] and [[Omsk]]. Russia has an [[Embassy of Russia in Astana|embassy in Astana]] and consulates in [[Almaty]] and [[Oral, Kazakhstan|Oral]].\n\nDiplomatic relations between Russia and Kazakhstan have fluctuated since the fall of the [[Soviet Union]] but both nations remain particularly strong partners in regional affairs and major supporters of the [[Collective Security Treaty Organization]], the [[Shanghai Cooperation Organisation]] and [[Eurasian Economic Union]].<ref>{{Cite book|title=\"Russia's Relations with Kazakhstan: Rethinking Ex-Soviet Transitions in the Emerging World System\"|last=Zabortseva|first=Yelena Nikolayevna|publisher=Routledge|year=2016|isbn=9781315668727|location=London-New York}}</ref> Kazakhstani-Russian relations have been strained at times by Astana's military and economic cooperation with the United States as well as negotiations over Russia's continued use of the Baikonur Cosmodrome, however the two nations retain high-level military and economic cooperation perhaps second among former Soviet states only to that between Russia and Belarus.  Kazakhstan sells oil and gas to Russia at a significantly reduced rate and Russian businesses are heavily invested in Kazakhstan's economy.\n|--valign=\"top\"\n|{{flagu|Spain}}||<!-- start date -->11 February 1992||See [[Kazakhstan–Spain relations]]\n\n* Kazakhstan has an embassy in [[Madrid]].<ref>{{Cite web |url=http://www.kazesp.org/ |title=Embassy of Kazakhstan in Madrid |access-date=2018-12-05 |archive-url=https://web.archive.org/web/20180912190315/http://www.kazesp.org/ |archive-date=2018-09-12 |url-status=dead }}</ref>\n* Spain has an embassy in Astana.<ref>{{cite web| url = http://www.exteriores.gob.es/embajadas/astana/es/Paginas/inicio.aspx| title = Embassy of Spain in Astana}}</ref> \n|--valign=\"top\"\n|{{flagu|Switzerland}}||<!-- start date -->||\n[[Rakhat Aliyev]], the First Vice [[Foreign Minister]] of Kazakhstan met with [[Anton Tahlmann]], the Vice Foreign Minister of Switzerland, in [[Bern]], Switzerland from November 13–14, 2006. Tahlmann announced that the [[Swiss Federal Council]] is considering opening an embassy in Kazakhstan, saying, \"Switzerland is interested in comprehensive development of relations with your country because of its dynamic development and the growing role in the region. In relation with this Bern regards an increase of its diplomatic presence in this country, an opening of the Swiss embassy in perspective.\" He confirmed his government's support for Kazakhstan's candidacy for the Chairmanship of the [[Organization for Security and Cooperation in Europe]] in 2009. The two ministers also discussed trade, migration, and the environment.<ref name=SWISSOSCE>[http://eng.gazeta.kz/art.asp?aid=83338 Switzerland confirms support of Kazakhstan's candidacy for OSCE chairmanship] {{Webarchive|url=https://web.archive.org/web/20081004122723/http://eng.gazeta.kz/art.asp?aid=83338 |date=2008-10-04 }} Gazeta. KZ</ref><ref name=SWISSRELATIONS>[http://www.trend.az/?mod=shownews&news=31790&lang=en Switzerland considers opening embassy in Kazakhstan] Gazeta. KZ</ref>\n|--valign=\"top\"\n|{{flagu|Ukraine }}||<!-- start date -->1991|| See [[Kazakhstan–Ukraine relations]]\n\n* Kazakhstan has an embassy in [[Kyiv]] and an honorary consulate in [[Odesa]].\n* Ukraine has an embassy in Astana and a consulate-general in Almaty.\n\nKazakhstan provided Ukraine with humanitarian aid after the beginning of military conflict in southeast Ukraine in 2014.<ref name=Ukraine>{{cite web|title=Kazakhstan delivers humanitarian aid to Ukraine |url=http://www.globalpost.com/dispatch/news/agencia-efe/150111/kazakhstan-delivers-humanitarian-aid-ukraine |website=globalpost.com/ |url-status=dead |archive-url=https://web.archive.org/web/20150205230451/https://www.globalpost.com/dispatch/news/agencia-efe/150111/kazakhstan-delivers-humanitarian-aid-ukraine |archive-date=February 5, 2015 |df=mdy }}</ref> In October 2014, Kazakhstan donated $30,000 to the International Committee of the Red Cross's humanitarian effort in Ukraine.<ref name=\"who11\"/> In January 2015 Kazakhstan sent $400,000 worth of aid to Ukraine's southeastern regions to help ease the humanitarian crisis.<ref name=\"who11\"/>\n|--valign=\"top\"\n|{{flagu|United Kingdom }}||<!-- start date --> 19 February 1992|| See [[Kazakhstan–United Kingdom relations]]\nThe UK established [[Foreign relations of the United Kingdom|diplomatic relations with the United Kingdom]] on 19 January 1992.\n*Kazakhstan maintains an [[Embassy of Kazakhstan, London|embassy]] in London.<ref>{{cite web|author=Diplomat Magazine|date=12 November 2021|title=Kazakhstan|website=Diplomat Magazine|url=https://diplomatmagazine.com/heads-of-mission/middle-east-asia/kazakhstan/|access-date=25 March 2025|archive-url=https://web.archive.org/web/20250322221741/https://diplomatmagazine.com/heads-of-mission/middle-east-asia/kazakhstan/|archive-date=22 March 2025|url-status=live}}</ref>\n*The UK is accredited to Kazakhstan through its embassy in [[Astana]].<ref>{{cite web| url=https://www.gov.uk/world/organisations/british-embassy-astana|title=British Embassy Astana|website=[[gov.uk|GOV.UK]]|access-date=25 March 2025|archive-date=23 January 2025|archive-url=https://web.archive.org/web/20250123165635/https://www.gov.uk/world/organisations/british-embassy-astana|url-status=live}}</ref> \nBoth countries share common membership of the [[Organization for Security and Co-operation in Europe|OSCE]], and the [[World Trade Organization]]. Bilaterally the two countries have a Development Partnership,<ref>{{cite web|author-link=Foreign, Commonwealth and Development Office |author=((Foreign, Commonwealth & Development Office)) |url=https://www.gov.uk/government/collections/country-and-regional-development-partnership-summaries|title=Country and regional development partnership summaries|website=GOV.UK|date=17 July 2023 |access-date=27 May 2024|archive-url=https://web.archive.org/web/20240526234739/https://www.gov.uk/government/collections/country-and-regional-development-partnership-summaries|archive-date=26 May 2024|url-status=live}}</ref> a Double Taxation Convention,<ref>{{cite web|author=HM Revenue and Customs|date=6 January 2014|title=Kazakhstan: tax treaties|website=GOV.UK|url=https://www.gov.uk/government/publications/kazakhstan-tax-treaties|access-date=25 March 2025|archive-url=https://web.archive.org/web/20250221093414/https://www.gov.uk/government/publications/kazakhstan-tax-treaties|archive-date=21 February 2025|url-status=live}}</ref> an Investment Agreement,<ref>{{cite web|title=Kazakhstan - United Kingdom BIT (1995)|website=UN Trade and Development|url=https://investmentpolicy.unctad.org/international-investment-agreements/treaties/bit/2217/kazakhstan---united-kingdom-bit-1995-|access-date=25 March 2025|archive-url=https://web.archive.org/web/20210420134347/https://investmentpolicy.unctad.org/international-investment-agreements/treaties/bit/2217/kazakhstan---united-kingdom-bit-1995-|archive-date=20 April 2021|url-status=live}}</ref> and a Strategic Partnership and Cooperation Agreement.<ref>{{cite web|last=Eruygur|first=Burç|title=Kazakhstan, UK sign strategic partnership, cooperation agreement|date=24 April 2024|website=The Astana Times|url=https://www.aa.com.tr/en/europe/kazakhstan-uk-sign-strategic-partnership-cooperation-agreement/3201504|access-date=25 March 2025|archive-url=https://web.archive.org/web/20240425004823/https://www.aa.com.tr/en/europe/kazakhstan-uk-sign-strategic-partnership-cooperation-agreement/3201504|archive-date=25 April 2024|url-status=live}}</ref>\n|}\n\n===Oceania===\n{| class=\"wikitable sortable\" border=\"1\" style=\"width:100%; margin:auto;\"\n!width=\"15%\"| Country\n!width=\"12%\"| Formal Relations Began\n!Notes\n|--valign=\"top\"\n|{{flagu|Australia}}<!-- start date -->||\n|See [[Australia–Kazakhstan relations]]\n* Australia is accredited to Kazakhstan from its embassy in Moscow, Russia.\n* Kazakhstan is accredited to Australia from its embassy in Singapore and maintains a consulate-general in [[Sydney]].\n|}\n\n==NATO==\nKazakhstan has been a member of [[NATO]]'s [[Partnership for Peace]] since May 27, 1994.<ref name=nato1>{{cite web|title=Signatures of Partnership for Peace Framework Document|url=http://www.nato.int/cps/en/natolive/topics_82584.htm|website=North Atlantic Treaty Organization}}</ref>\nIn October 2014 Kazakhstan and NATO marked 20 years of cooperation within the Partnership for Peace. To that end, from October 6 to 10, 2014 a NATO delegation visited Kazakhstan to take part in a series of public diplomacy events.<ref name=nato2>{{cite web|title=NATO and Kazakhstan mark 20 years of cooperation|url=http://www.nato.int/cps/en/natolive/news_113927.htm?selectedLocale=en|website=North Atlantic Treaty Organization}}</ref> Among meetings with Kazakhstan's officials, the delegates also visited the [[Nazarbayev University|Nazarbayev]] and the [[L.N.Gumilyov Eurasian National University|Gumilyov Eurasian National]] universities in Astana, where they delivered lectures explaining NATO's engagement with partners in the Central Asian region and briefed audiences on the key outcomes of the recent NATO Wales Summit, with particular focus on NATO's partnership policy and Afghanistan.<ref name=\"nato2\"/>\n\nA NATO delegation also plans to visit Astana in the first half of 2015 and hold a joint event with the Kazakh side in the second half of 2015.<ref name=nato1b>{{cite web|title=NATO Representatives to Visit Kazakhstan This Year|url=http://www.astanatimes.com/2015/02/nato-representatives-visit-kazakhstan-year/|website=astanatimes.com/}}</ref> The future NATO-Kazakhstan joint activities will be held in the framework of the Partnership for Peace program, which centres on the development and exchange of experience for peacekeeping forces.<ref name=\"who11\"/>\n\n== Visa regimes ==\nAt the 27th meeting of the Foreign Investors' Council, President Nazarbayev announced visa-free entry for citizens of the United States, the Netherlands, UK, France, Germany, Italy, Malaysia, the UAE, South Korea, and Japan.<ref name=visafree>{{cite news|title=Kazakhstan announces visa-free entry for investors from 10 nations|url=http://en.tengrinews.kz/politics_sub/Kazakhstan-announces-visa-free-entry-for-investors-from-10-nations-254140/|publisher=TengriNews}}</ref> Currently Kazakhstan and the United States issue 5-year visas to citizens of each other.\n\nThis will fulfill a goal of diversifying the economy while also helping the world become more acquainted with Kazakhstan's cultural patrimony.  Since 2001 to 2012, Kazakhstan has doubled its tourism earnings.<ref name=worldbank1>{{cite web|title=International tourism, receipts (current US$) – Kazakhstan|url=http://data.worldbank.org/indicator/ST.INT.RCPT.CD/countries/KZ?display=graph|website=World Bank}}</ref> Experts expect that Kazakhstan will continue to benefit from tourism from the eased visa regime.<ref name=silkroadreporters1>{{cite web|title=The New Kazakhstan Visa Regime and Investment|url=http://www.silkroadreporters.com/2014/08/21/new-kazakhstan-visa-regime-investment/|website=Silk Road Reporters|access-date=2014-08-28|archive-url=https://web.archive.org/web/20140903054104/http://www.silkroadreporters.com/2014/08/21/new-kazakhstan-visa-regime-investment/|archive-date=2014-09-03|url-status=dead}}</ref>\n\nOn July 15, 2014, Kazakhstan launched a pilot project of visa-free regime for 10 countries: UK, USA, Germany, France, Italy, the United Arab Emirates (UAE), Malaysia, the Netherlands, South Korea and Japan.<ref name=visar1>{{cite web|title=Visa-Free Travel as Way to Stimulate Investment, Tourism|url=http://www.astanatimes.com/2014/07/visa-free-travel-way-stimulate-investment-tourism/|website=astanatimes.com}}</ref> Citizens of these countries can enter, exit and transit through Kazakhstan without a visa for visits of up to 15 calendar days at a time.<ref name=\"visar1\"/>\n\nOn June 26, 2015, Kazakhstan issued a resolution expanding the number of countries included in a trial visa-free regime and extended that regime until December 31, 2017.<ref name=visar2>{{cite web|title=Kazakhstan Expands Visa-Free Regime up to 19 Countries, Extends It to End of 2017|url=http://www.astanatimes.com/2015/07/kazakhstan-expands-visa-free-regime-up-to-19-countries-extends-it-to-end-of-2017/|website=astanatimes.com}}</ref> The list now includes 19 countries, including Australia, Belgium, Finland, France, Germany, Hungary, Italy, Japan, Malaysia, Monaco, Netherlands, Norway, Singapore, Spain, Sweden, Switzerland, the UAE, the U. K. and the U.S.<ref name=\"visar2\"/>\n\nStarting from January 1, 2017, Kazakhstan introduced visa-free access for 20 developed countries. These countries include the OECD members, Malaysia, Monaco, the UAE and Singapore.<ref>{{cite web|title=Kazakhstan abolished visa regime for 20 developed countries|url=http://www.eturbonews.com/72170/kazakhstan-abolished-visa-regime-20-developed-countries|website=eturbonews.com}}</ref> On August 8, 2024, Congo-Brazaville and Kazakhstan signed a visa exemption cooperation agreement between Congo and Kazakhstan.<ref>{{cite web|title=Coopération : le Congo et le Kazakhstan signent des accords multisectoriels|url=https://ambacongofr.org/index.php/l-ambassade/actualites/1101-cooperation-le-congo-et-le-kazakhstan-signent-des-accords-multisectoriels|website=ambacongofr.org|date=8 August 2024 }}</ref>\n\n'''Countries whose citizens can visit Kazakhstan visa-free for up to 14 days'''\n\nThe updated list for 2023 includes 4 countries: China, India, Iran and, Hong Kong.\n\n'''Countries whose citizens can visit Kazakhstan visa-free for up to 30 days'''<ref>{{Cite web |title=Astana Times |url=https://astanatimes.com/2023/11/kazakhstan-and-san-marino-to-establish-visa-free-regime/#:~:text=ASTANA%20%E2%80%93%20Kazakhstan%20and%20San,exempt%20from%20visa%20requirements%20for%E2%80%A6}}</ref>\n\nThe updated list as of January 2023 includes 63 countries: Argentina, Australia, Austria, Bahrain, Belgium, Brazil, Bulgaria, Canada, Chile, Colombia, Croatia, Cyprus, Czech Republic, Denmark, Ecuador, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Indonesia, Ireland, Israel, Italy, Japan, Kuwait, Latvia, Liechtenstein, Lithuania, Luxembourg, Malaysia, Maldives, Malta, Mexico, Monaco, Netherlands, New Zealand, Nicaragua, Norway, Oman, Philippines, Poland, Portugal, Qatar, Romania, Saudi Arabia, Serbia, Singapore, Slovakia, Slovenia, South Korea, Spain, Sweden, Switzerland, Thailand, the United Kingdom, the United States, Turkiye, Vatican City, Vietnam, and the UAE.\n\n==United Nations==\nKazakhstan became a member of [[the United Nations]] on March 2, 1992, nearly three months after gaining independence.<ref name=gast2012>{{cite web|last=Gast|first=Alice P.|title=From Cold War to Warm Relations|url=http://www.sciencediplomacy.org/perspective/2012/from-cold-war-to-warm-relations|work=Science & Diplomacy|access-date=July 29, 2013|date=March 9, 2012}}</ref>\n\nDuring the General Assembly on November 12, 2012, Kazakhstan was elected to a seat on the [[United Nations Human Rights Council]] for the first time. Their seat is with the Asian Group and their term will expire in 2015.<ref>{{cite web|url=https://thehill.com/blogs/congress-blog/foreign-policy/136524-kazakhstans-appointment-to-unhcr/|title=Kazakhstan's appointment to UNHCR|author=Erlan Idrissov|work=The Hill|date=10 December 2012 |access-date=February 20, 2015}}</ref>\n\nAt United Nations Day 2013, Foreign Minister [[Erlan Idrisov]] addressed the UN General Assembly saying the UN should develop a regional center in Almaty. Since the United Nations has no regional offices between Vienna and Bangkok, Almaty is home to 18 international organization's regional offices and would be vital to the development of Central Asia and its neighbors.<ref>{{cite web|url=http://issuu.com/kazakhstan_mfa/docs/astana_calling_no_327|title=ISSUU – Astana calling no 327 by Ministry of Foreign Affairs, Kazakhstan|author=Ministry of Foreign Affairs, Kazakhstan|work=Issuu|date=25 October 2013 |access-date=February 20, 2015}}</ref>\n\nAt the 68th Assembly of the United Nations, Foreign Minister Idrisov announced Kazakhstan's bid for a non-permanent seat on the [[United Nations Security Council]] for 2017–2018. So far they and Thailand have announced their bids.<ref>{{cite web|url=https://www.usnews.com/opinion/articles/2013/10/21/kazakhstan-is-a-serious-candidate-for-the-un-security-council?page=2|title=Put Kazakhstan on the U.N. Security Council|author=Kairat Umarov|work=U.S. News & World Report|access-date=February 20, 2015}}</ref><ref>{{cite web|url=http://en.trend.az/regions/casia/kazakhstan/2194408.html|title=Kazakh Foreign Minister arrives in New York for 68th session of UN General Assembly|date=September 26, 2013|work=Trend|access-date=February 20, 2015|archive-url=https://web.archive.org/web/20131029203939/http://en.trend.az/regions/casia/kazakhstan/2194408.html|archive-date=October 29, 2013|url-status=dead}}</ref><ref>{{cite web|url=http://www.nationmultimedia.com/politics/Thailand-lobbies-for-position-on-UN-Security-Counc-30215627.html|archive-url=https://web.archive.org/web/20130928003051/http://www.nationmultimedia.com/politics/Thailand-lobbies-for-position-on-UN-Security-Counc-30215627.html|url-status=dead|archive-date=September 28, 2013|title=Thailand lobbies for position on UN Security Council|date=September 25, 2013|work=The Nation|access-date=February 20, 2015}}</ref>\n\nIn February 2015 the United Nations' specialized agency [[World Health Organization]] opened a new geographically dispersed office (GDO) for primary health care in Kazakhstan at the Kazakh National Medical University of S.Asfendiyarov in Almaty.<ref name=who11>{{cite web|title=UN opens GDO in Almaty; More UN agencies want hub offices in Kazakhstan|url=http://en.tengrinews.kz/politics_sub/UN-opens-GDO-in-Almaty-More-UN-agencies-want-hub-offices-in-Kazakhstan-258960/|website=en.tengrinews.kz|date=11 February 2015 }}</ref> According to the head the Kazakh Medical University, the GDO of the WHO's European Bureau in Almaty will be financed by the UN.<ref name=\"who11\"/>\n\nIn July 2015 Kazakhstan was accepted to the Executive Council of the World Federation of [[UNESCO]] (WCF) Clubs at the ninth WCF World Congress, UNESCO Centres and Associations.<ref>{{Cite web|title = Kazakhstan accepted into UNESCO WCF Executive Council|url = http://astanatimes.com/2015/08/kazakhstan-accepted-into-unesco-wcf-executive-council/|access-date = 2015-09-29}}</ref>\n\nOn May 6, 2016, Kazakh Foreign Minister Erlan Idrissov spoke at two high level meetings at the U.N. headquarters in New York. The Foreign Minister said that Kazakhstan was calling for a nuclear free world by 2045, the 100th anniversary of the United Nations.<ref>{{cite web|title=Kazakhstan calls for nuclear free world by 2045|url=http://bigstory.ap.org/article/9168a36dafe64b2e84bd15e38adc358a/kazakhstan-calls-nuclear-free-world-2045|website=bigstory.ap.org}}</ref>\n\nKazakhstan signed the Paris Climate Change Agreement on Aug 2 at UN Headquarters in New York.<ref name=\"un.org\">{{cite web|title=Ban congratulates Kazakhstan on its signing of the Paris Agreement on climate change|url=https://www.un.org/apps/news/story.asp?NewsID=54619#.V-QnmT4rLs1|website=un.org}}</ref> The Kazakh Senate ratified the Paris Agreement on October 27, 2016. Under the Paris Agreement, Kazakhstan has committed to cut its greenhouse gas emissions by 15-20% by 2030 up to the level observed in 1990.<ref>{{cite web|title=Kazakh Senate ratifies Paris Agreement|url=http://www.inform.kz/en/kazakh-senate-ratifies-paris-agreement_a2963203|website=inform.kz}}</ref>\n\nIn March 2017, Kazakhstan marked 25 years of its membership in the United Nations. To celebrate this anniversary, Kazakhstan opened the “Kazakhstan and the United Nations: Interaction for Peace” exhibition in the Museum of the Library of the First President of Kazakhstan. During 25 years of cooperation, the UN opened 15 representative offices in Kazakhstan, including the United Nations Development Programme (UNDP), the United Nations International Children's Emergency Fund (UNICEF), the United Nations Population Fund (UNFPA) and United Nations Educational, Scientific and Cultural Organisation (UNESCO), among others.<ref>{{cite web|title=Exhibition opens marking 25th anniversary of Kazakhstan's accession to UN|url=http://astanatimes.com/2017/03/exhibition-opens-marking-25th-anniversary-of-kazakhstans-accession-to-un/|website=astanatimes.com}}</ref>\n\nAstana is a host city of the Eighth International Forum on Energy for Sustainable Development that is planned to be held in June 2017. The Forum is co-organized through collaboration by Kazakhstan with the UN Regional Commissions, as well as UNDP, IEA, IAEA, IRENA, the World Bank, UNID, the Copenhagen Centre on Energy Efficiency, and the Renewable Energy Policy Network for the 21st Century.<ref>{{Cite web|url=http://www.indepthnews.net/index.php/global-governance/un-insider/1063-kazakhstan-focuses-on-energy-for-sustainable-development|title=Kazakhstan Focuses on Energy for Sustainable Development - IDN-InDepthNews {{!}} Analysis That Matters|last=Kamarajan|first=Devendra|website=indepthnews.net|language=en-gb|access-date=2017-04-13}}</ref>\n\n===United Nations Security Council===\n{{main|Kazakhstan's membership in the United Nations Security Council}}\nKazakhstan, along with Sweden, Bolivia and Ethiopia, were elected to serve on Security Council for a two-year term, starting from January 1, 2017.<ref name=\"un.org\"/> Kazakhstan became the first Central Asian country to be elected as a non-permanent member of the UNSC. Kazakhstan assumed the chairmanship of  UNSC on January 1, 2018.<ref name=\"unscchair\">{{cite news|title=Kazakhstan set to assume UNSC presidency Jan. 1|url=https://astanatimes.com/2017/12/kazakhstan-set-to-assume-unsc-presidency-jan-1/|agency=The Astana Times}}</ref>  Kazakhstan focused on drawing attention on international community to the issues of Central Asia and Afghanistan.<ref>{{cite web|title=Kazakhstan to preside in UNSC in Jan 2018|url=http://www.inform.kz/en/kazakhstan-to-preside-in-unsc-in-jan-2018_a3007345|website=inform.kz}}</ref>\n\nKazakhstan outlined priorities during its UNSC tenure. They included nuclear disarmament and non-proliferation, fight against terrorism and extremism, promotion of peacemaking and peace-building, as well as security and development issues in the Central Asian region.<ref>{{cite web|title=FM Idrissov Visits Kabul, Dushanbe, Gathers Concerns to Present on UNSC|url=http://astanatimes.com/2016/11/fm-idrissov-visits-kabul-dushanbe-gathers-concerns-to-present-on-unsc/|website=astanatimes.com}}</ref>\n\nPresident Nazarbayev's address to the UNSC was presented by the Foreign Minister of Kazakhstan at the ministerial-level open debate of the UNSC held on January 10, 2017. The address was based on the principles of the Kazakh President's earlier Manifesto “The World. The 21st Century.” It declares Kazakhstan's commitment to building a world free of nuclear weapons and to rid humanity of wars and conflicts.<ref>{{cite web|title=President Nazarbayev's Political Address to UN Security Council Presented|url=http://astanatimes.com/2017/01/president-nazarbayevs-political-address-to-un-security-council-presented/|website=astanatimes.com}}</ref>\n\nPresident Nazarbayev chaired the January 18 UN Security Council briefing on WMD non-proliferation and related measures to better provide security for Central Asia.<ref name=\"unscbriefing\">{{cite news|title=Nazarbayev at UN Security Council: binding system to safeguard denuclearisation needed|url=https://astanatimes.com/2018/01/nazarbayev-at-un-security-council-binding-system-to-safeguard-denuclearisation-needed/|agency=The Astana Times}}</ref> It was the first time a president of a Central Asian country chaired a UNSC briefing.\n\nAs a non-permanent member, Kazakhstan was actively involved in the Council’s deliberations and chaired three crucial Sanctions Committees related to ISIL (Da’esh) and Al-Qaida, the Taliban, and Somalia and Eritrea. Kazakhstan’s representatives were responsible for leading council meetings and overseeing crisis management during their presidency of the UNSC.<ref>{{Cite web |last1=InDepthNews |last2=Matters |first2=IDN-InDepthNews {{!}} Analysis That |date=2018-12-24 |title=Kazakhstan Ends Successful Security Council Membership |url=https://indepthnews.net/kazakhstan-ends-successful-security-council-membership/ |access-date=2024-11-12 |website=IDN-InDepthNews |language=en-GB}}</ref>\n\n==Peacekeeping==\nThe Kazakh Peacekeeping Battalion (KazBat) was established in 2000. KazBat's first mission was part of the peacekeeping operation Iraqi Freedom from 2003 to 2008. During this time, nine Kazakh peacekeeping contingents served in Iraq, engaging in demining, convoy safety, base protection, traffic regulation, and humanitarian aid. Kazakh servicemen destroyed about five million explosive ordnance and provided medical assistance to over 500 Iraqi citizens.<ref>{{Cite web |title=Astana Times |url=https://astanatimes.com/2021/06/peacekeeping-activities-remains-a-pillar-of-kazakhstans-contribution-to-world-peace-and-security/}}</ref>\n\nOn October 31, 2018, Kazakhstan deployed 120 Kazakh peacekeepers to serve with the UN mission in furthering peace in south Lebanon. It was the first time Kazakh troops were serving with [[UNIFIL]] in the Mission's 40-year history.<ref>{{cite web |title=120 Kazakh troops join UNIFIL |url=https://peacekeeping.un.org/en/120-kazakh-troops-join-unifil |website=peacekeeping.un.org/}}</ref> On August 20, 2020, Kazakhstan deployed a second group of 60 peacekeepers to the UNIFIL.<ref>{{cite web |title=Kazakhstan Deploys Second Group of Peacekeepers to UN Mission in Lebanon |url=https://astanatimes.com/2020/08/kazakhstan-deploys-second-group-of-peacekeepers-to-un-mission-in-lebanon/ |website=The Astana Times}}</ref>\n\nKazakhstan has regularly conducted joint anti-terrorism and peacekeeping exercises, “Steppe Eagle,” since 2003, with the participation of NATO forces. Additionally, the Partnership for Peace Training Center (KAZCENT), operational since 2008, trains peacekeepers and offers courses certified by the United Nations, such as “Protection of Civilians” and “UN Staff Officers”.<ref>{{Cite web |title=Astana Times |url=https://astanatimes.com/2021/06/peacekeeping-activities-remains-a-pillar-of-kazakhstans-contribution-to-world-peace-and-security/}}</ref>\n==Shanghai Cooperation Organisation==\nKazakhstan is one of the original founding members of the [[Shanghai Cooperation Organisation]], known as the Shanghai Five. They formally began the organization on April 26, 1996, with the signing of the ''Treaty on Deepening Military Trust in Border Regions'' in Shanghai. Since then, Kazakhstan has become a very active member in global politics within the organization.\n\nAt the SCO Summit in [[Bishkek]], Kyrygyzstan on September 20, 2013, Kazakhstan met with leaders to discuss many issues. One of the main issues discussed was the focus on regional stability for Afghanistan after the United States withdraws its troops. Kazakhstan also signed the Bishkek Declaration along with members and observers to find diplomatic solutions for Iran and Syria. On Syria, Kazakhstan wanted to help find a diplomatic solution that would not involve direct intervention due to the need of UN authorization. On Iran, Kazakhstan wanted to see a diplomatic solution between Iran and the P5+1 group for Iran to enrich uranium at levels for energy consumption.<ref>{{Cite web |url=http://mfa.gov.kz/en/#!/blog-of-the-minister/ |title=The Ministry of Foreign Affairs of the Republic of Kazakhstan &#124; Main page |access-date=2013-11-01 |archive-url=https://web.archive.org/web/20171228143721/http://www.mfa.gov.kz/en#!/blog-of-the-minister/ |archive-date=2017-12-28 |url-status=dead }}</ref>\n\nIn November 2016, Kazakhstan chaired first ever SCO human rights consultations. The meetings were held in Beijing and aimed at further consolidation of the SCO member states cooperation in human rights.<ref>{{cite web|title=First human rights consultations in SCO history|url=http://www.inform.kz/en/first-human-rights-consultations-in-sco-history_a2972798|website=inform.kz}}</ref>\n\nAstana hosted the [http://eng.sectsco.org/news/20170609/289274.html 17th Shanghai Cooperation Organisation (SCO) summit] {{Webarchive|url=https://web.archive.org/web/20220405234324/http://eng.sectsco.org/news/20170609/289274.html |date=2022-04-05 }} June 8–9, 2017. The summit featured the ceremony of accession of India and Pakistan to the organization. Therefore, the total number of member states increased to eight: China, Kazakhstan, Kyrgyz Republic, Russia, Tajikistan, Uzbekistan, India, and Pakistan.<ref>{{cite web|title=India, Pakistan expand SCO's borders, anti-extremism convention tops agenda at Astana SCO summit|url=http://astanatimes.com/2017/06/india-pakistan-expand-scos-borders-anti-extremism-convention-tops-agenda-at-astana-sco-summit/|website=astanatimes.com}}</ref>\n\nKazakhstan assumed the rotational chairmanship of the Shanghai Cooperation Organization from July 2023 to July 2024.<ref>{{Cite web |last=Saeed |first=Areej |date=2023-07-07 |title=Kazakhstan assumes SCO chairmanship 2023-2024 |url=https://thediplomaticinsight.com/kazakhstan-assumes-sco-chairmanship-2023-2024/ |access-date=2024-11-12 |website=The Diplomatic Insight |language=en-US}}</ref> During this period, President [[Kassym-Jomart Tokayev]] outlined the country's priorities for its SCO chairmanship. Key focuses included:\n\n# '''Ensuring Security and Stability''': The primary goal under Kazakhstan's chairmanship is to ensure security and stability within the SCO region. This includes preventing geopolitical rifts between East and West and promoting a vision for a sustainable future.\n# '''Promoting Global Unity for Equitable Peace and Harmony''': Kazakhstan introduced the initiative \"Promoting Global Unity for Equitable Peace and Harmony,\" aiming to strengthen confidence-building measures and maintain stability and security.\n# '''Counter-Terrorism and Anti-Drug Strategy''': Kazakhstan committed to updating the Program of Cooperation on Countering Terrorism, Separatism, and Extremism for 2025-2027 and endorsed the SCO Anti-Drug Strategy for 2024-2029, along with its implementation program.\n# '''Economic and Trade Expansion''': Another key area of focus is the expansion of trade and the economy in the SCO region. President Tokayev proposed using the Astana International Financial Center as a platform for stimulating investments in regional projects of the SCO.\n# '''Development of Infrastructure and Strategic Routes''': The creation of a network of major strategic ports and logistics centers among SCO countries was emphasized, highlighting the importance of modern transport infrastructure and new competitive routes.\n# '''New SCO Development Strategy''': President Tokayev underlined the need for a new SCO development strategy to expand cooperation in promising areas, including energy, digital transformation, and humanitarian and cultural ties. He also proposed strengthening the SCO’s potential in various sectors.\n\n==Other international organizations==\n===Antarctic treaty===\nKazakhstan joined the Antarctic Treaty in November 2014 being the 51st country to ratify it.<ref name=MT>{{cite web|title=Kazakhstan Joins Antarctic Treaty|url=http://www.themoscowtimes.com/news/article/kazakhstan-joins-antarctic-treaty/511630.html|website=themoscowtimes.com/|date=21 November 2014 }}</ref>\n\nKazakhstan had shown an interest in the Antarctic before, with officials even identifying it as a potential source of drinking water for the arid steppe nation.<ref name=\"MT\"/> The country staged its first expedition to the South Pole in 2011.<ref name=\"MT\"/>\n\n===Organisation for Economic Co-operation and Development (OECD)===\nOn January 23 in Davos at the World Economic Forum, Prime Minister of Kazakhstan [[Karim Massimov]] and Secretary General of the [[Organisation for Economic Co-operation and Development]] (OECD) Angel Gurria signed a Memorandum of Understanding between Kazakhstan and the OECD on the implementation of the Country Program of Cooperation for 2015–2016.<ref name=OECD>{{cite web|title=Kazakhstan and OECD Sign Cooperation Agreement for 2015–2016|url=http://kznewsline.com/kazakhstan-and-oecd-sign-cooperation-agreement-for-2015-2016/|website=KzNewsline|access-date=2015-02-05|archive-url=https://web.archive.org/web/20150205195657/http://kznewsline.com/kazakhstan-and-oecd-sign-cooperation-agreement-for-2015-2016/|archive-date=2015-02-05|url-status=dead}}</ref>\n\nIn July 2016, it was announced that Kazakhstan was admitted to the OECD Competition Committee that aims to promote antitrust reforms. Kazakhstan is the first Central Asian country to join the committee.<ref>{{Cite news |date=2016-07-30 |title=Kazakhstan Becomes First Central Asian Country on OECD Competition Committee |url=https://astanatimes.com/2016/07/kazakhstan-becomes-first-central-asian-country-on-oecd-competition-committee/ |access-date=2025-11-09 |work=Astana Times}}</ref>\n\nKazakhstan joined the [[Declaration on International Investment and Multinational Enterprises]] of the OECD and became an associated participant of the OECD Investment Committee in June 2017. OECD Investment Committee is the leading government forum for cooperation on international investment issues.<ref>{{cite web|title=Kazakhstan joins OECD Declaration on International Investment|url=http://lenta.inform.kz/en/kazakhstan-joins-oecd-declaration-on-international-investment_a3038346|website=lenta.inform.kz}}</ref>\n\n===World Trade Organization===\nKazakhstan applied for WTO accession on January 29, 1996. The accession negotiations between Kazakhstan and the WTO lasted 20 years and on November 30, 2015, the organization welcomed Kazakhstan as its 162nd Member.<ref>{{cite web|title=Kazakhstan|url=https://www.wto.org/english/thewto_e/acc_e/a1_kazakhstan_e.htm|website=wto.org|access-date=February 23, 2016}}</ref>\n\nIn April 2017, the General Council of the WTO announced that Kazakhstan's Ambassador to Switzerland and Permanent Representative of the Republic of Kazakhstan to the UN structures Zhanar Aitzhanova would be the Chairperson of the WTO Committee for Trade and Environment in 2017.<ref>{{Cite web|url=http://www.inform.kz/en/kazakhstan-chairs-wto-committee-for-trade-and-environment_a3016752|title=Kazakhstan chairs WTO Committee for Trade and Environment|website=inform.kz|language=ru|access-date=2017-05-03}}</ref>\n\n==World Anti-Crisis Conference==\nThe 21st World Anti Crisis Conference was conducted with the support of the UN General Assembly Resolution A/RES/67/19International financial sistem and development from December 21, 2012, on May 23, 2013, within the framework of the VI [[Astana Economic Forum]].<ref name=WAC1>{{cite journal|title=Concept of the World Anti-Crisis Plan|journal=WAC: World Anti-Crisis Conference|pages=1}}</ref> Main outcome of the WAC I was the Astana Declaration and the guidelines of the World Anti-Crisis Plan developed using the contributions from the international expert community, the UN member states and the UN Secretariat.<ref name=\"WAC1\"/>\n\nThe concept of the WAC Plan, based on democratic principles and the interests of all UN member states aims at developing effective measures to overcome the economic and financial crisis, preventing future recessions and ensuring long-term balanced growth of the global economy.<ref name=\"WAC1\"/>\n\n==See also== \n* [[Kazakhstan–European Union relations]]\n* [[List of diplomatic missions in Kazakhstan]]\n* [[List of diplomatic missions of Kazakhstan]]\n* [[Terrorism in Kazakhstan]]\n\n==References==\n{{Reflist|33em}}\n\n==Further reading==\n* {{Cite journal\n|last = Bukkvoll\n|first = Tor\n|date= September 2004\n|title = Astana's privatized independence: private and national interests in the foreign policy of Nursultan Nazarbayev\n|journal = [[Nationalities Papers]]\n|volume = 32\n|issue = 3\n|pages = 631–650\n|doi = 10.1080/0090599042000246424\n |s2cid = 167766281\n}}\n* {{Cite journal\n|last = Contessi\n|first = Nicola P. \n|date= December 2019\n|title = Status Seeking in the Steppe. Taking Stock of Kazakhstan's Foreign Policy, 1992-2019\n|journal = [[Eurasiatica]]\n|volume = 13\n|pages = 137–156\n|doi =  10.30687/978-88-6969-376-2/010\n |doi-access = free\n}}\n* {{Cite journal\n|last = Contessi\n|first = Nicola P. \n|date= June 2018\n|title = Foreign Policy Diversification and Intercontinental Transport Corridors: The Case of Kazakhstan's Railways Diplomacy\n|journal = [[Europe-Asia Studies]]\n|volume = 70\n|issue = 5\n|pages = 759–790\n|doi = 10.1080/09668136.2018.1473342 \n |s2cid = 159027829 \n}}\n* {{Cite book|last=Shiryayev|first=Boris|title=Großmächte auf dem Weg zur neuen Konfrontation?. Das \"Great Game\" am Kaspischen Meer: eine Untersuchung der neuen Konfliktlage am Beispiel Kasachstan|publisher=Verlag Dr. Kovac|place=Hamburg|year=2008|isbn=978-3-8300-3749-1}}\n\n==External links==\n* [https://web.archive.org/web/20121108060917/http://mfa.kz/en/ Ministry of Foreign Affairs]\n** [https://web.archive.org/web/20121108060917/http://mfa.kz/en/#!/foreign_policy/ Overview of Kazakhstan's foreign policy]\n\n{{Foreign relations of Kazakhstan}}\n{{Asia in topic|Foreign relations of}} \n{{Foreign relations of Europe}}\n{{Kazakhstan topics}}\n\n{{DEFAULTSORT:Foreign Relations Of Kazakhstan}}\n[[Category:Foreign relations of Kazakhstan| ]]"