"{{Short description|none}} <!-- \"none\" is preferred when the title is sufficiently descriptive; see [[WP:SDNONE]] -->\n{{Politics of Cuba}}[[Cuba]]'s foreign policy has been highly dynamic depending on world events throughout [[Latin America]] and the [[Caribbean]]. Cuban foreign policy is impacted by the various [[Sphere of influence|spheres of influence]] and [[Economy of Cuba|economic development]] of neighboring countries. During the 1980s, its geopolitical alignment with the [[Soviet Union]] isolated Cuba on the international stage. The [[Dissolution of the Soviet Union|fall of the Soviet Union]], end of the [[Cold War]], and emergence of [[Russia]] as a key trading partner led to limited regional relations. Cuba began to establish bilateral relations with [[South America]]n countries during the late-1990s, mainly with [[Venezuela]] and [[Bolivia]]. Cuba has a cold [[Cuba–United States relations|relationship with the United States]], with a variety of bilateral issues due to historic conflict and divergent political ideologies. It has a [[Cuba–European Union relations|similarly strained relationship]] with the [[European Union]] (EU) due to Cuba's [[Human rights in Cuba|human rights policies]].<ref>{{Cite web|url=http://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=OJ:C:2004:076E:0384:0386:EN:PDF|title=The requested document does not exist. - EUR-Lex|access-date=2009-03-19|archive-date=2009-09-05|archive-url=https://web.archive.org/web/20090905060853/http://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=OJ:C:2004:076E:0384:0386:EN:PDF|url-status=dead}}</ref> Since the late-2010s, Cuba has developed closer ties to Venezuela, Russia, and [[China]]. \n\nCuba provided civilian assistance workers – principally medical – to more than 20 countries as [[medical diplomacy]].<ref>[https://2001-2009.state.gov/outofdate/bgn/c/13238.htm Cuba (09/01)]  US Department of State report</ref> More than [[Cuban exile|one million exiles]] have escaped to foreign countries. Cuba is slated to be a part of the [[United Nations Human Rights Council]] from 2024 to 2026. It is a founding member of the [[Bolivarian Alternative for the Americas]], a member of the [[Community of Latin American and Caribbean States]], the [[Latin American Integration Association]] and the [[United Nations]]. Cuba is a member of the [[Non-Aligned Movement]] and hosted its September 2006 summit. In addition as a member of the [[Association of Caribbean States]] (ACS), Cuba was re-appointed as the chair of the special committee on transportation issues for the Caribbean region.<ref>[http://www.caribbeaninvestor.com/article.shtml?browser_query=varticle&field=4800 Cuba Takes Over Chair of ACS Transport Committee] Caribbean Investor</ref> Since November 2004, several leaders of South America have attempted to make Cuba either a full or associate member of the South American [[trade bloc]] known as [[Mercosur]].<ref>[http://www.brazzilmag.com/content/view/800/41/ How Cuba Fits into Brazil's Plans] {{webarchive|url=https://web.archive.org/web/20091202015109/http://www.brazzilmag.com/content/view/800/41/ |date=2009-12-02 }} Brazzilmag</ref><ref>[http://www.thetrumpet.com/index.php?page=article&id=199 Cuba Asks to Join Mercosur] {{Webarchive|url=https://web.archive.org/web/20080228074452/http://www.thetrumpet.com/index.php?page=article&id=199 |date=2008-02-28 }} The Trumpet</ref> Cuba's present foreign minister is [[Bruno Rodríguez Parrilla]].\n\n== History ==\n=== 1917 ===\nIn 1917, Cuba entered World War I on the side of the allies.<ref>{{cite web |url=http://www.emayzine.com/lectures/HISTOR~7.htm |title=History of Cuba |publisher=Emayzine.com |access-date=2012-03-23 |url-status=dead |archive-url=https://web.archive.org/web/20120415064039/http://www.emayzine.com/lectures/Histor~7.htm |archive-date=2012-04-15 }}</ref>\n\n=== The Cold War ===\n{{See also|Cuba–Soviet Union relations}}\n\nFollowing the establishment of diplomatic ties to the Soviet Union, and after the [[Cuban Missile Crisis]], Cuba became increasingly dependent on Soviet markets and military and economic aid. Castro was able to build a formidable military force with the help of Soviet equipment and military advisors. The KGB kept in close touch with Havana, and Castro tightened Communist Party control over all levels of government, the media, and the educational system, while developing a Soviet-style internal police force.\n\nCastro's alliance with the Soviet Union caused something of a split between him and Guevara. In 1966, Guevara left for [[Bolivia]] in an ill-fated attempt to stir up revolution against the country's government.\n\nOn August 23, 1968, Castro made a public gesture to the USSR that caused the Soviet leadership to reaffirm their support for him. Two days after [[Warsaw Pact invasion of Czechoslovakia]] to repress the [[Prague Spring]], Castro took to the airwaves and publicly denounced the Czech rebellion. Castro warned the Cuban people about the Czechoslovakian 'counterrevolutionaries', who \"were moving Czechoslovakia towards capitalism and into the arms of [[imperialism|imperialists]]\". He called the leaders of the rebellion \"the agents of [[West Germany]] and [[fascist]] reactionary rabble.\"<ref>{{cite web|last=Castro |first=Fidel |date=August 1968 |url=http://lanic.utexas.edu/la/cb/cuba/castro/1968/19680824 |title=Castro comments on Czechoslovakia crisis |publisher=FBIS |url-status=dead |archive-url=https://web.archive.org/web/20110515022952/http://lanic.utexas.edu/la/cb/cuba/castro/1968/19680824 |archive-date=2011-05-15 }}</ref>\n\n==== Relations in Latin America during the Cold War ====\n{{blockquote|\"Cuba has a unique symbolic allure. It is the small country that confronted the U.S. empire and has survived despite the attempts by all U.S. presidents since to subdue its communist government. It is the island with iconic leaders like [[Fidel Castro]] and [[Che Guevara]], and the Latin American country that in the language of revolutionaries everywhere embodies the struggle of socialist humanism against the materialism of capitalist societies. Cuba is also the small nation that in the past sent its troops to die in faraway lands in Latin America and even Africa fighting for the poor.\"| [[Moisés Naím]], ''[[Newsweek]]''<ref>[http://www.newsweek.com/id/201752 The Havana Obsession: Why All Eyes are on a Bankrupt Island] by Moisés Naím, ''Newsweek'', June 22, 2009</ref>}}\n\nDuring the Cold War, Cuba's influence in the Americas was inhibited by the [[Monroe Doctrine]] and the dominance of the United States.<ref name=\"foreignaffairs\">Pamela S. Falk, \"Cuba in Africa.\" ''Foreign Affairs'' 65.5 (1987): 1077-1096. [https://www.jstor.org/stable/20043202 online]</ref>   Despite this Fidel Castro became an influential figurehead for leftist groups in the region, extending support to Marxist Revolutionary movements throughout Latin America, most notably [[Cuban assistance to the Sandinista National Liberation Front|aiding]] the [[Sandinista]]s in overthrowing [[Somoza]] in [[Nicaragua]] in 1979. In 1971, Fidel Castro took [[Fidel Castro's state visit to Chile|a month-long visit to Chile]]. The visit, in which Castro participated actively in the internal politics of the country, holding massive rallies and giving public advice to [[Salvador Allende]], was seen by those on the political right as proof to support their view that \"The Chilean Way to Socialism\" was an effort to put Chile on the same path as Cuba.<ref>{{cite book|last=Quirk|first=Robert|date= August 1995|title=Fidel Castro|publisher=W. W. Norton & Company}}</ref>\n\n==== Intervention in Cold War conflicts ====\n{{Further|Cuban military internationalism}}\nDuring the Cold War, Africa was a major target of Cuba's influence. Fidel Castro stated that Africa was chosen in part to represent Cuban solidarity with its own large population of African descent. Exporting Cuba's  revolutionary tactics abroad increased its worldwide influence and reputation. Wolf Grabendorff states that \"Most African states view Cuban intervention in Africa as help in achieving independence through self-help rather than as a step toward the type of dependence which would result from a similar commitment by the super-powers.\"<ref>Wolf Grabendorff,  \"Cuba's involvement in Africa: An interpretation of objectives, reactions, and limitations.\" ''Journal of Interamerican Studies and World Affairs'' 22.1 (1980): 3-29, quoting p. 5. [https://www.jstor.org/stable/165610 online]</ref> Cuban Soldiers were sent to fight in the [[Simba rebellion]] in the DRC during the 1960s. Furthermore, by providing military aid Cuba won trading partners for the Soviet bloc and potential converts to Marxism.<ref name=\"foreignaffairs\"/>\n\nStarting in the 1970s, Cuba's intervened in 17 African nations including three insurgencies.<ref name=\"foreignaffairs\"/> Cuba expanded military programs to Africa and the Middle East, sending military missions to Sierra Leone in 1972, South Yemen in 1973, Equatorial Guinea in 1973, and Somalia in 1974. It sent combat troops to Syria in 1973 to fight against Israel. Cuba was following the general Soviet policy of détente with the West, and secret discussions were opened with the United States about peaceful coexistence. They ended abruptly when Cuba sent combat troops to fight in Angola in 1975.<ref>Louis A. Pérez, '' Cuba: Between Reform and Revolution'' (5th ed. 2015) pp 300-301.</ref>\n\n=====Intervention in Africa=====\n{{Main|Cuban intervention in Angola}}\n\nOn November 4, 1975, Castro ordered the deployment of Cuban troops to [[Angola]] to aid the Marxist [[Popular Movement for the Liberation of Angola|MPLA]] against [[UNITA]], which were supported by the [[People's Republic of China]], United States, [[Israel]], and South Africa (see: [[Cuba in Angola]]). After two months on their own, Moscow aided the Cuban mission with the USSR engaging in a massive airlift of Cuban forces into Angola. Both Cuban and South African forces withdrew in the late 1980s and Namibia was granted  independence. The [[Angolan civil war]] would last until 2002. [[Nelson Mandela]] is said to have remarked \"Cuban internationalists have done so much for African independence, freedom, and justice.\"<ref>[[Wikiquote:Nelson Mandela]]</ref> Cuban troops were also sent to Marxist [[Ethiopia]] to assist [[Mengistu Haile Mariam]]'s government in the [[Ogaden War]] with [[Somalia]] in 1977. Cuba sent troops along with the Soviet Union to aid the [[Mozambican Liberation Front|FRELIMO]] government against the [[Rhodesia]]n and South African-backed [[Mozambican National Resistance|RENAMO]].<ref name=\"Grady2005\">{{cite web|last=O'Grady |first=Mary Anastasia |date=2005-10-30 |url=http://www.cubacenter.org/media/news_articles/countingcastrosvictims.php |title=Counting Castro's Victims |publisher=The Wall Street Journal, Center for a Free Cuba |access-date=2006-05-11 |archive-url=https://web.archive.org/web/20060418094333/http://www.cubacenter.org/media/news_articles/countingcastrosvictims.php |archive-date=2006-04-18 |url-status=dead }}</ref>\nCastro never disclosed the number of casualties in Soviet African wars, but one estimate is that 14,000 Cubans were killed in Cuban military actions abroad.<ref>''Return to Havana'' by Maurice Halperin</ref><ref>{{cite web | date = 2006-08-25 | url = http://www.mediatransparency.org/recipientgrants.php?recipientID=1892 | title = Recipient Grants: Center for a Free Cuba | access-date = 2006-08-25 | url-status = dead | archive-url = https://web.archive.org/web/20070828125037/http://www.mediatransparency.org/recipientgrants.php?recipientID=1892 | archive-date = 2007-08-28 }}</ref>\n\n=====Intervention in Latin America=====\n\nIn addition, Castro extended support to Marxist Revolutionary movements throughout Latin America, such as aiding the [[Sandinista]]s in overthrowing the [[Anastasio Somoza Debayle|Somoza]] government in [[Nicaragua]] in 1979.<ref name=\"Grady2005\" />\n\n=====Leadership of non-aligned movement=====\n{{Further|Cuban medical internationalism}}\nIn the 1970s, Fidel Castro made a major effort to assume a leadership role in the non-aligned movement, which include over 90 countries. Cuba's intervention in Angola other military advisory missions, economic and social programs were praised fellow non-aligned member. The 1976 world conference of the non-aligned Movement applauded Cuban internationalism, stating that it \"assisted the people of Angola in frustrating the expansionist and colonialist strategy of South Africa's racist regime and its allies.\" The next non-aligned conference was held in Havana in 1979, and chaired by Castro, who became the de facto spokesman for the Movement. [[6th Summit of the Non-Aligned Movement|The conference in September 1979]] marked the peak of Cuban global influence. The non-aligned nations had believed that Cuba was not aligned with the Soviet Union in the Cold War.<ref>Quirk, ''Fidel Castro,'' pp 718-21, 782-83</ref>  However, in December 1979, the Soviet Union invaded Afghanistan, an active member of the non-aligned Movement. At the United Nations, non-aligned members voted 56 to 9, with 26 abstaining, to condemn the Soviet invasion. Cuba,   however, was deeply in debt financially and politically to Moscow, and voted against the resolution. It lost its reputation as non-aligned in the Cold War. Castro, instead of becoming a spokesman for the Movement, became inactive, and in 1983, leadership passed to India, which had abstained on the UN vote. Cuba lost its bid to become a member of the United Nations Security Council. Cuba's ambitions for a role in global leadership had ended.<ref>Pérez, '' Cuba: Between Reform and Revolution'' (5th ed. 2015) p 301.</ref><ref>H. V. Hodson, ed. ''The annual register : a record of world events 1979'' (1980) pp 372-75.</ref>\n\n=====Social and economic programs=====\n\nCuba had social and economic programs in 40 developing countries. This was possible by a growing Cuban economy in the 1970s. The largest programs were construction projects, in which 8,000 Cubans provided technical advice, planning, and training of engineers. Educational programs involved 3,500 teachers. In addition thousands of specialists, technicians, and engineers were sent as advisors to agricultural mining and transportation sectors around the globe. Cuba also hosted 10,000 foreign students, mostly from Africa and Latin America, in health programs and technical schools.<ref>Pérez, '' Cuba: Between Reform and Revolution'' (5th ed. 2015) pp 300-301.</ref>  Cuba's extensive program of medical support to international attention. A 2007 study reported:\n:Since the early 1960s, 28,422 Cuban health workers have worked in 37 Latin American countries, 31,181 in 33 African countries, and 7,986 in 24 Asian countries. Throughout a period of four decades, Cuba sent 67,000 health workers to structural cooperation programs, usually for at least two years, in 94 countries ... an average of 3,350 health workers working abroad every year between 1960 and 2000.<ref>Pol De Vos,  et al. \"Cuba's international cooperation in health: an overview.\" ''International Journal of Health Services'' 37.4 (2007): 761-776.  [https://www.researchgate.net/profile/Pol_De_Vos/publication/5776693_Cuba%27s_International_Cooperation_in_Health_An_Overview/links/5448aaa20cf2d62c3052ad8e.pdf online]</ref>\n\n==== Post–Cold War relations ====\n[[Image:Vladimir Putin in Cuba 14-17 December 2000-12.jpg|thumb|right|Fidel Castro with Russian President [[Vladimir Putin]], December 2000]]\n\nIn the post–Cold War environment Cuban support for guerrilla warfare in Latin America has largely subsided, though the Cuban government continued to provide political assistance and support for left leaning groups and parties in the developing Western Hemisphere.\n\nWhen Soviet leader [[Mikhail Gorbachev]] visited Cuba in 1989, the ideological relationship between Havana and Moscow was strained by Gorbachev's implementation of economic and political reforms in the USSR. \"We are witnessing sad things in other socialist countries, very sad things\", lamented Castro in November 1989, in reference to the changes that were sweeping such communist allies as the Soviet Union, [[East Germany]], Hungary, and Poland.<ref>{{cite news | date = 1989-11-09 | url = http://thomas.loc.gov/cgi-bin/query/z?r101:S17NO9-1592: | title = Castro Laments 'Very Sad Things' in Bloc | newspaper = Washington Post | access-date = 2006-05-22 | archive-date = 2013-08-21 | archive-url = https://web.archive.org/web/20130821085547/http://thomas.loc.gov/cgi-bin/query/z?r101:S17NO9-1592: | url-status = dead }}</ref> The subsequent [[dissolution of the Soviet Union]] in 1991 had an immediate and devastating effect on Cuba.\n\nCuba today works with a growing bloc of Latin American politicians opposed to the \"[[Washington consensus]]\", the American-led doctrine that [[free trade]], open markets, and [[privatization]] will lift poor third world countries out of economic stagnation. The Cuban government condemned [[neoliberalism]] as a destructive force in the developing world, creating an alliance with Presidents [[Hugo Chávez]] of [[Venezuela]] and [[Evo Morales]] of [[Bolivia]] in opposing such policies.<ref>Reel, Monte. For Bolivian Majority, a New Promise; Nation's First Indian President Vows to Chart Course Independent of U.S. ''The Washington Post.'' Washington, D.C.: 23 January 2006. pg. A.01</ref><ref>Bolivia to Widen Control of Industry. ''The Washington Post''. Washington, D.C.: May 3, 2006. pg. A.16</ref><ref>[[Pamela Constable|Constable, Pamela]]. For Bolivian Victor, A Powerful Mandate; Populist Faces Practical Constraints. ''The Washington Post''. Washington, D.C.: 20 December 2005. pg. A.01</ref><ref>McDonnell, Patrick J. Global Capital; Leftist Presidents Take Spotlight at Trade Summit; A South American common market welcomes Venezuela, underscoring the bloc's new politics. Cuba's Castro steals the show. ''Los Angeles Times''. Los Angeles, California: 22 July 2006. pg. C.4</ref>\n\nCurrently, Cuba has [[Cuba–Venezuela relations|diplomatically friendly relationships]] with Presidents [[Nicolás Maduro]] of Venezuela with Maduro as perhaps the country's staunchest ally in the post-Soviet era. Cuba has sent thousands of teachers and medical personnel to Venezuela to assist Maduro's [[socialism|socialist]] oriented economic programs. Maduro, in turn provides Cuba with lower priced petroleum. Cuba's debt for oil to Venezuela is believed to be on the order of one billion US dollars.<ref>{{cite news|last1=Patricia Maroday |title=Doing Business with Cuba – The Complete Guide |url=http://www.mercatrade.com/blog/country-profile-cuba/ |access-date=14 February 2015 |date=12 January 2015 |url-status=dead |archive-url=https://web.archive.org/web/20150214100341/http://www.mercatrade.com/blog/country-profile-cuba/ |archive-date=14 February 2015 }}</ref>\n\nHistorically during Nicaragua's initial Sandinista period and since the 2007 election of [[Daniel Ortega]], Cuba has maintained close [[Cuba–Nicaragua relations|relations with Nicaragua]].\n\nIn the wake of the [[Russian invasion of Ukraine]] and the ongoing international isolation of Russia, Cuba emerged as one of the few countries that maintained friendly relations with the [[Kremlin]].<ref>{{cite news|url=https://www.washingtonpost.com/outlook/2022/03/29/despite-cubas-important-history-solidarity-with-ukraine-russia-remains-key-ally/|title=Despite Cuba's important history of solidarity with Ukraine, Russia remains a key ally|author=William Kelly|newspaper=The Washington Post|date=29 March 2022}}</ref><ref>{{cite web|url=https://dialogo-americas.com/articles/cuba-and-russia-strengthen-strategic-partnership/#.ZEsYuC-l0_U|title=Cuba and Russia Strengthen Strategic Partnership|website=dialogo-americas.com|date=6 January 2023}}</ref> Cuban president [[Miguel Diaz-Canel]] visited [[Vladimir Putin]] in Moscow in November 2022, where the two leaders opened a monument of Fidel Castro, as well as speaking out against U.S. sanctions against Russian and Cuba.<ref>{{cite web|url=https://www.reuters.com/world/europe/evoking-castro-putin-cuban-leader-pledge-deepen-ties-2022-11-22/|title=Evoking Castro, Putin and Cuban leader pledge to deepen ties|website=Reuters|date=22 November 2022}}</ref>\n\n== Diplomatic relations ==\nList of countries which Cuba maintains diplomatic relations with:\n{| class=\"wikitable sortable\"\n! colspan=\"3\" |[[File:Diplomatic_relations_of_Cuba.svg|frameless|425x425px]]\n|-\n!#\n!Country\n!Date<ref>{{Cite web |date=2015 |title=Memoria anual 2015 |url=https://archivo.cubaminrex.cu/sites/default/files/memoria_anual_2015.pdf |url-status=dead |archive-url=https://web.archive.org/web/20190507190813/https://archivo.cubaminrex.cu/sites/default/files/memoria_anual_2015.pdf |archive-date=7 May 2019 |pages=19–25 |language=es}}</ref>\n|-\n|1\n|{{flag|Guatemala}}\n|{{dts|30 April 1902}}<ref>{{cite web |title=Relaciones Diplomáticas de Guatemala |url=https://www.minex.gob.gt/DirectorioPaisesRelacion.aspx |access-date=24 July 2021 |language=es}}</ref>\n|-\n|2\n|{{flag|Mexico}}\n|{{dts|20 May 1902}}\n|-\n|3\n|{{flag|Netherlands}}\n|{{dts|20 May 1902}}\n|-\n|4\n|{{flag|United Kingdom}}\n|{{dts|20 May 1902}}<ref name=\"britain\">{{Cite web|author=Cuba News Agency|date=21 May 2022 |title=Cuba and UK mark 120 years of diplomatic relations |url=http://www.cubanews.acn.cu/world/17539-cuba-and-uk-mark-120-years-of-diplomatic-relations|website=Cuba News Agency|access-date=3 April 2024|archive-url=https://web.archive.org/web/20220521171118/http://www.cubanews.acn.cu/world/17539-cuba-and-uk-mark-120-years-of-diplomatic-relations|archive-date=21 May 2022|url-status=live}}</ref>\n|-\n|5\n|{{flag|United States}}\n|{{dts|27 May 1902}}<ref>{{Cite web |title=All Countries |url=https://history.state.gov/countries/all |access-date=12 November 2021 |website=Office of the Historian}}</ref>\n|-\n|6\n|{{flag|France}}\n|{{dts|11 June 1902}}<ref>{{Cite web |title=Cuba celebra el 120 aniversario del establecimiento de relaciones diplomáticas con la República Francesa |url=https://twitter.com/CubaMINREX/status/1535592683984625669?s=20 |access-date=6 September 2023 |website=Cancillería de Cuba |language=es}}</ref>\n|-\n|7\n|{{flag|Venezuela}}\n|{{dts|14 June 1902}}<ref>{{Cite book |title=Libro amarillo correspondiente al año ...: presentado al Congreso Nacional en sus sesiones ordinarias de ... por el titular despacho |publisher=Venezuela. Ministerio de Relaciones Exteriores |year=2003 |pages=528–529 |language=es}}</ref>\n|-\n|8\n|{{flag|Switzerland}}\n|{{dts|18 June 1902}}<ref>{{Cite web |title=La República de Cuba y la Confederación Suiza celebran hoy el 120 aniversario del establecimiento de relaciones diplomáticas |url=https://twitter.com/CubaMINREX/status/1538135793025404931?s=20 |access-date=6 September 2023 |website=Cancillería de Cuba |language=es}}</ref>\n|-\n|9\n|{{flag|Spain}}\n|{{dts|21 June 1902}}<ref>{{Cite web |date=21 June 2022 |title=Celebran Cuba y España aniversario 120 de relaciones diplomáticas |url=https://www.siempreconcuba.org/celebran-cuba-y-espana-aniversario-120-de-relaciones-diplomaticas/ |access-date=6 September 2023 |website=Siempre con Cuba |language=es}}</ref>\n|-\n|10\n|{{flag|Bolivia}}\n|{{dts|19 July 1902}}<ref>{{Cite news |date=26 June 2017 |title=Canciller de Bolivia sostiene reunión bilateral con su Homólogo de Cuba |url=https://cancilleria.gob.bo/mre/2017/06/26/8145/ |access-date=26 June 2025 |language=es}}</ref>\n|-\n|11\n|{{flag|Belgium}}\n|{{dts|18 August 1902}}\n|-\n|12\n|{{flag|Uruguay}}\n|{{dts|1 September 1902}}<ref>{{Cite news |date=24 April 2002 |title=Cronología de las relaciones diplomáticas entre Uruguay y Cuba |language=es |url=https://www.lr21.com.uy/politica/77610-cronologia-de-las-relaciones-diplomaticas-entre-uruguay-y-cuba |access-date=18 May 2022}}</ref>\n|-\n|13\n|{{flag|Sweden}}\n|{{dts|30 September 1902}}<ref>{{Cite web |date=30 September 2023 |title=Today we celebrate the 121st anniversary of the establishment of diplomatic relations between the Kingdom of Sweden and Cuba |url=https://twitter.com/EmbaCubaSuecia/status/1708199399547900244 |access-date=30 September 2023}}</ref>\n|-\n|14\n|{{flag|El Salvador}}\n|{{dts|11 November 1902}}<ref>{{Cite news |date=28 May 2015 |title=Presidente de El Salvador llega a Cuba para impulsar el comercio y la cooperación |language=es |url=https://www.diariolasamericas.com/presidente-el-salvador-llega-cuba-impulsar-el-comercio-y-la-cooperacion-n3126493 |access-date=3 September 2023}}</ref>\n|-\n|15\n|{{flag|Colombia}}\n|{{dts|1902}}<ref>{{Cite web |date=14 April 2015 |title=Directorio del Cuerpo Diplomático y Consular acreditado en la República de Colombia |url=https://www.cancilleria.gov.co/sites/default/files/directoriocuerpodiplomatico-14abril2015jsre.pdf |access-date=4 July 2023 |website=cancilleria.gov.co |pages=7–12 |language=es}}</ref>\n|-\n|16\n|{{flag|Ecuador}}\n|{{dts|24 April 1903}}<ref>{{Cite news |date=9 July 2014 |title=Ecuador y Cuba preparan intercambio agroindustrial y tecnológico |url=http://www.andes.info.ec/es/noticias/ecuador-cuba-preparan-intercambio-agroindustrial-tecnologico.html |url-status=dead |archive-url=https://web.archive.org/web/20140712040005/http://www.andes.info.ec/es/noticias/ecuador-cuba-preparan-intercambio-agroindustrial-tecnologico.html |archive-date=12 July 2014 |access-date=26 June 2025 |language=es}}</ref>\n|-\n|17\n|{{flag|Chile}}\n|{{dts|19 October 1903}}<ref name=\":1\">{{Cite book |title=Boletin oficial |publisher=Cuba. Departamento de Estado |year=1908 |volume=2–5 |pages=68–70 |language=es}}</ref>\n|-\n|18\n|{{flag|Honduras}}\n|{{dts|24 November 1903}}<ref>{{Cite news |date=23 November 2016 |title=Visita oficial del presidente Hernández fortalece lazos de amistad y cooperación con Cuba |language=es |url=https://www.trabajo.gob.hn/wp-content/uploads/2016/11/Visita-oficial-del-presidente-Hernandez-fortalece-lazos-de-amistad-y-cooperacion-con-Cuba.docx |access-date=3 September 2023}}</ref><ref>{{Cite web |title=Hace 113 años Honduras y Cuba iniciaron sus relaciones diplomáticas. |url=https://twitter.com/ClaudiaBanega15/status/801870755940143105?s=20 |access-date=6 September 2023 |language=es}}</ref>\n|-\n|19\n|{{flag|Italy}}\n|{{dts|20 December 1903}}\n|-\n|20\n|{{flag|Haiti}}\n|{{dts|3 February 1904}}<ref>{{Cite news |date=15 May 2013 |title=Primer ministro de Haití inicia hoy visita oficial a Cuba |language=es |url=http://www.cubadebate.cu/noticias/2013/05/15/primer-ministro-de-haiti-inicia-hoy-visita-oficial-a-cuba/ |access-date=3 September 2023}}</ref>\n|-\n|21\n|{{flag|Dominican Republic}}\n|{{dts|5 April 1904}}<ref name=\":1\" />\n|-\n|22\n|{{flag|Panama}}\n|{{dts|1904|4|7|format=dmy}}<ref name=\"date\">{{cite web |title=RELACIONES DIPLOMÁTICAS DE LA REPÚBLICA DE PANAMÁ |url=http://www.mire.gob.pa/sites/default/files/documentos/Trasnsparencia/gestion-anual-2011-2012.pdf |url-status=dead |archive-url=https://web.archive.org/web/20200806131148/https://mire.gob.pa/sites/default/files/documentos/Trasnsparencia/gestion-anual-2011-2012.pdf |archive-date=6 August 2020 |access-date=30 November 2021 |page=195}}</ref>\n|-\n|23\n|{{flag|Peru}}\n|{{dts|11 January 1905}}<ref name=\":1\" />\n|-\n|24\n|{{flag|Nicaragua}}\n|{{dts|3 September 1905}}<ref>{{Cite news |date=18 November 2021 |title=Despedida Embajador de Cuba en Nicaragua |language=es |url=https://redcomunica.csuca.org/index.php/universidad-nacional-autonoma-de-nicaragua-leon-unan-leon/despedida-embajador-de-cuba-en-nicaragua/ |access-date=7 April 2023 |archive-date=11 April 2023 |archive-url=https://web.archive.org/web/20230411153817/https://redcomunica.csuca.org/index.php/universidad-nacional-autonoma-de-nicaragua-leon-unan-leon/despedida-embajador-de-cuba-en-nicaragua/ |url-status=dead}}</ref>\n|-\n|25\n|{{flag|Norway}}\n|{{dts|20 June 1906}}<ref>{{cite web |date=27 April 1999 |title=Norges opprettelse af diplomatiske forbindelser med fremmede stater |url=https://www.regjeringen.no/globalassets/departementene/ud/vedlegg/protokoll/diplomatiske_forbindelser.pdf |access-date=18 October 2021 |website=regjeringen.no |language=no}}</ref>\n|-\n|26\n|{{flag|Paraguay}}\n|{{dts|13 July 1906}}<ref>{{Cite book |title=Boletín oficial de la Secretaría de Estado de la República de Cuba |publisher=Lib. e Imp. \"La Moderna Poesia\" |year=1915 |language=es |quote=\"Sr. Octavio Lamar y Páez... 13 de julio de 1906\"}}</ref>\n|-\n|27\n|{{flag|Brazil}}\n|{{dts|13 December 1906}}<ref>{{Cite journal |title=Legações e embaixadas do Brasil |url=https://funag.gov.br/biblioteca/download/legacoes_embaixadas.pdf |journal=Fundação Alexandre de Gusmão |language=pt |pages=208}}</ref>\n|-\n|28\n|{{flag|Costa Rica}}\n|{{dts|17 December 1907}}<ref name=\":22\">{{Cite web |title=Política Bilateral |url=https://www.rree.go.cr/?sec=exterior&cat=politica |access-date=6 July 2023 |language=es}}</ref><ref>{{Cite book |title=Coleccion de los decretos y ordenes, 2 |publisher=Imprenta nacional |year=1907 |pages=viii |language=es}}</ref>\n|-\n|29\n|{{flag|Argentina}}\n|{{dts|12 May 1909}}<ref>{{Cite news |date=9 October 2015 |title=Argentina y Cuba fortalecen sus relaciones |language=es |url=https://www.granma.cu/mundo/2015-10-09/argentina-y-cuba-fortalecen-sus-relaciones |access-date=27 June 2023}}</ref>\n|-\n|30\n|{{flag|Denmark}}\n|{{dts|29 June 1911}}<ref>{{Cite news |date=8 September 2021 |title=Cuba and Denmark are committed to strengthening bilateral relations |url=https://www.radiohc.cu/en/noticias/nacionales/269568-cuba-and-denmark-are-committed-to-strengthening-bilateral-relations |url-status=dead |archive-url=https://web.archive.org/web/20221208223433/https://www.radiohc.cu/en/noticias/nacionales/269568-cuba-and-denmark-are-committed-to-strengthening-bilateral-relations |archive-date=8 December 2022}}</ref>\n|-\n|31\n|{{flag|Portugal}}\n|{{dts|16 May 1919}}\n|-\n|32\n|{{flag|Czech Republic}}\n|{{dts|23 November 1920}}<ref>{{Cite web |date=23 November 2020 |title=PREMIOS DEL CONCURSO-UN SIGLO DE PRESENCIA CHECA EN CUBA. |website=[[Facebook]] |url=https://www.facebook.com/cartelon.cuba/posts/pfbid02PGdtfWWjSRiyUj6wMxrimNFUWU6zHrfVV8rMknMXB2dgAajgt1vRRMfMSRoPbwzul |access-date=29 September 2023 |language=es}}</ref>\n|-\n|33\n|{{flag|Austria}}\n|{{dts|15 January 1924}}<ref name=\":4\">{{Cite book |title=Gothaisches Jahrbuch für Diplomatie, Verwaltung und Wirtschaft |year=1927 |pages=118 |language=de}}</ref>\n|-\n|34\n|{{flag|Romania}}\n|{{dts|13 April 1927}}<ref>{{Cite web |title=Diplomatic Relations of Romania |url=https://www.mae.ro/en/node/2187 |access-date=2 July 2022}}</ref>\n|-\n|35\n|{{flag|Finland}}\n|{{dts|5 April 1929}}\n|-\n|36\n|{{flag|Japan}}\n|{{dts|21 December 1929}}<ref>{{Cite news |date=21 July 2016 |title=Cuba and Japan Interested in Expanding Economic and Trade Ties |url=https://www.trabajadores.cu/20160721/cuba-and-japan-interested-in-expanding-economic-and-trade-ties/ |access-date=17 July 2023}}</ref>\n|-\n|37\n|{{flag|Greece}}\n|{{dts|29 May 1930}}<ref>{{Cite news |date=29 May 2025 |title=Cuba y Grecia celebran el 95 aniversario de sus relaciones diplomáticas |url=https://misiones.cubaminrex.cu/es/articulo/cuba-y-grecia-celebran-el-95-aniversario-de-sus-relaciones-diplomaticas |access-date=26 June 2025 |language=es}}</ref>\n|-\n|38\n|{{flag|Poland}}\n|{{dts|1 January 1933}}<ref>{{Cite web |title=Szef polskiego MSZ z pierwszą od ponad 30 lat oficjalną wizytą na Kubie |url=https://wydarzenia.interia.pl/zagranica/newsamp-szef-polskiego-msz-z-pierwsza-od-ponad-30-lat-oficjalna-wizy,nId,2402059 |access-date=23 July 2023 |language=pl}}</ref>\n|-\n|—\n|{{flag|Holy See}}\n|{{dts|2 September 1935}}<ref>{{Cite web |title=Diplomatic relations of the Holy See |url=https://holyseemission.org/contents/mission/diplomatic-relations-of-the-holy-see.php |access-date=5 September 2022}}</ref>\n|-\n|39\n|{{flag|Luxembourg}}\n|{{dts|25 November 1942}}\n|-\n|40\n|{{Flag|Serbia}}\n|{{dts|30 August 1943}}<ref>{{Cite web |date=8 May 2013 |title=Celebran 70 años de relaciones diplomáticas entre Cuba y Serbia |url=https://www.granma.cu/granmad/2013/05/08/nacional/artic04.html |url-status=dead |archive-url=https://web.archive.org/web/20170219134958/https://www.granma.cu/granmad/2013/05/08/nacional/artic04.html |archive-date=19 February 2017 |access-date=3 May 2025 |website=Granma |language=es}}</ref>\n|-\n|41\n|{{flag|Canada}}\n|{{dts|16 March 1945}}\n|-\n|42\n|{{flag|Philippines}}\n|{{dts|4 July 1946}}<ref>{{Cite web |date=4 July 2023 |title=The Republic of the Philippines and the Republic of Cuba celebrate 77 years of formal diplomatic relations today, July 04! |url=https://twitter.com/DFAPHL/status/1676192864953573378 |access-date=31 July 2023}}</ref>\n|-\n|43\n|{{flag|Egypt}}\n|{{dts|5 September 1949}}\n|-\n|44\n|{{flag|Turkey}}\n|{{dts|25 November 1952}}\n|-\n|45\n|{{flag|Pakistan}}\n|{{dts|5 February 1954}}\n|-style=\"background:#D3D3D3\"\n|—\n|{{flag|Israel}} (suspended)\n|{{Dts|16 June 1954}}<ref>{{Cite book |title=Jewish Agency's Digest of Press and Events |publisher=Jewish Agency for Israel |year=1954 |pages=1058}}</ref>\n|-\n|46\n|{{flag|Germany}}\n|{{dts|30 June 1955}}<ref>{{Cite web |title=Kuba: Steckbrief |url=https://www.auswaertiges-amt.de/de/service/laender/kuba-node/kuba-212206 |website=Auswärtiges Amt |access-date=6 March 2025 |language=de}}</ref>\n|-\n|47\n|{{flag|Iceland}}\n|{{dts|26 January 1956}}\n|-\n|48\n|{{flag|Saudi Arabia}}\n|{{dts|10 February 1956}}\n|-\n|49\n|{{flag|Thailand}}\n|{{dts|19 May 1958}}\n|-\n|50\n|{{flag|Sri Lanka}}\n|{{dts|29 July 1959}}\n|-\n|—\n|{{flag|Sovereign Military Order of Malta}}\n|{{dts|29 July 1959}}\n|-\n|51\n|{{flag|Ghana}}\n|{{dts|23 September 1959}}\n|-\n|52\n|{{flag|Tunisia}}\n|{{dts|23 September 1959}}\n|-\n|53\n|{{flag|India}}\n|{{dts|12 January 1960}}\n|-\n|54\n|{{flag|Indonesia}}\n|{{dts|22 January 1960}}\n|-\n|55\n|{{flag|Iraq}}\n|{{dts|5 April 1960}}\n|-\n|56\n|{{flag|Russia}}\n|{{dts|8 May 1960}}\n|-\n|57\n|{{flag|Lebanon}}\n|{{dts|15 June 1960}}\n|-\n|58\n|{{flag|North Korea}}\n|{{dts|29 August 1960}}\n|-\n|59\n|{{flag|Guinea}}\n|{{dts|30 August 1960}}\n|-\n|60\n|{{flag|China}}\n|{{dts|28 September 1960}}\n|-\n|61\n|{{flag|Bulgaria}}\n|{{dts|14 October 1960}}\n|-\n|62\n|{{flag|Cyprus}}\n|{{dts|22 November 1960}}\n|-\n|63\n|{{flag|Vietnam}}\n|{{dts|2 December 1960}}\n|-\n|64\n|{{flag|Mongolia}}\n|{{dts|7 December 1960}}<ref>{{cite web |title=List of Countries Maintaining Diplomatic Relations with Mongolia |url=http://www.mfa.gov.mn/old/wp-content/uploads/2020/08/diplist-2020-draft-20200729.pdf |access-date=21 December 2021 |page=3 |archive-date=28 September 2022 |archive-url=https://web.archive.org/web/20220928021439/http://www.mfa.gov.mn/old/wp-content/uploads/2020/08/diplist-2020-draft-20200729.pdf |url-status=dead }}</ref>\n|-\n|65\n|{{flag|Albania}}\n|{{dts|15 December 1960}}\n|-\n|66\n|{{flag|Hungary}}\n|{{dts|18 December 1960}}\n|-\n|67\n|{{flag|Mali}}\n|{{dts|30 December 1960}}\n|-\n|68\n|{{flag|Morocco}}\n|{{dts|16 April 1962}}<ref>{{Cite news |date=1962 |title=Presentacion de credenciales |language=es |pages=4365 |work=Gaceta oficial de la República de Cuba}}</ref>\n|-\n|69\n|{{flag|Tanzania}}\n|{{dts|6 May 1962}}\n|-\n|70\n|{{flag|Algeria}}\n|{{dts|7 October 1962}}\n|-\n|71\n|{{flag|Cambodia}}\n|{{dts|26 October 1962}}\n|-\n|72\n|{{flag|Republic of the Congo}}\n|{{dts|10 May 1964}}\n|-\n|73\n|{{flag|Syria}}\n|{{dts|11 August 1965}}\n|-\n|74\n|{{flag|Sierra Leone}}\n|{{dts|24 April 1972}}\n|-\n|75\n|{{flag|Yemen}}\n|{{dts|4 May 1972}}\n|-\n|76\n|{{flag|Zambia}}\n|{{dts|19 July 1972}}\n|-\n|77\n|{{flag|Mauritania}}\n|{{dts|16 August 1972}}\n|-\n|78\n|{{flag|Barbados}}\n|{{dts|8 December 1972}}\n|-\n|79\n|{{flag|Guyana}}\n|{{dts|8 December 1972}}\n|-\n|80\n|{{flag|Jamaica}}\n|{{dts|8 December 1972}}\n|-\n|81\n|{{flag|Trinidad and Tobago}}\n|{{dts|8 December 1972}}\n|-\n|82\n|{{flag|Equatorial Guinea}}\n|{{dts|27 December 1972}}\n|-\n|83\n|{{flag|Bangladesh}}\n|{{dts|15 January 1973}}\n|-\n|84\n|{{flag|Guinea-Bissau}}\n|{{dts|1 October 1973}}\n|-\n|85\n|{{flag|Benin}}\n|{{dts|1 February 1974}}\n|-\n|86\n|{{flag|Burundi}}\n|{{dts|2 February 1974}}\n|-\n|87\n|{{flag|Gabon}}\n|{{dts|26 March 1974}}\n|-\n|88\n|{{flag|Democratic Republic of the Congo}}\n|{{dts|11 April 1974}}\n|-\n|89\n|{{flag|Madagascar}}\n|{{dts|11 April 1974}}\n|-\n|90\n|{{flag|Liberia}}\n|{{dts|19 April 1974}}\n|-\n|91\n|{{flag|Kuwait}}\n|{{dts|29 April 1974}}\n|-\n|92\n|{{flag|Uganda}}\n|{{dts|9 May 1974}}\n|-\n|93\n|{{flag|Nigeria}}\n|{{dts|1 July 1974}}\n|-\n|94\n|{{flag|Senegal}}\n|{{dts|9 August 1974}}\n|-\n|95\n|{{flag|Cameroon}}\n|{{dts|31 August 1974}}\n|-\n|96\n|{{flag|Laos}}\n|{{dts|1 November 1974}}\n|-\n|97\n|{{flag|Bahamas}}\n|{{dts|30 November 1974}}\n|-\n|98\n|{{flag|Malaysia}}\n|{{dts|6 February 1975}}\n|-\n|99\n|{{flag|Iran}}\n|{{dts|10 February 1975}}\n|-\n|100\n|{{flag|Nepal}}\n|{{dts|19 March 1975}}\n|-\n|101\n|{{flag|Mozambique}}\n|{{dts|25 June 1975}}\n|-\n|102\n|{{flag|Ethiopia}}\n|{{dts|18 July 1975}}\n|-\n|103\n|{{flag|Cape Verde}}\n|{{dts|5 September 1975}}\n|-\n|104\n|{{flag|Afghanistan|2013}}\n|{{dts|23 September 1975}}\n|-\n|105\n|{{flag|Angola}}\n|{{dts|15 November 1975}}\n|-\n|106\n|{{flag|Burkina Faso}}\n|{{dts|11 December 1975}}\n|-\n|107\n|{{flag|Libya}}\n|{{dts|18 February 1976}}<ref>{{Cite web |date=18 February 2025 |title=En ocasión del 49 aniversario del establecimiento de las relaciones diplomáticas entre Cuba y Libia |url=https://x.com/CubaMINREX/status/1891954645150433368 |access-date=26 April 2025 |website=Cancillería de Cuba |language=es}}</ref>\n|-\n|108\n|{{flag|São Tomé and Príncipe}}\n|{{dts|10 April 1976}}\n|-\n|109\n|{{flag|Niger}}\n|{{dts|25 April 1976}}\n|-\n|110\n|{{flag|Myanmar}}\n|{{dts|12 October 1976}}\n|-\n|111\n|{{flag|Chad}}\n|{{dts|18 October 1976}}\n|-\n|112\n|{{flag|Mauritius}}\n|{{dts|18 October 1976}}\n|-\n|113\n|{{flag|Comoros}}\n|{{dts|21 December 1976}}\n|-\n|114\n|{{flag|Maldives}}\n|{{dts|29 January 1977}}\n|-\n|115\n|{{flag|Malta}}\n|{{dts|11 April 1977}}\n|-\n|116\n|{{flag|Botswana}}\n|{{dts|9 December 1977}}\n|-\n|117\n|{{flag|Seychelles}}\n|{{dts|12 April 1978}}\n|-\n|118\n|{{flag|Togo}}\n|{{dts|18 January 1979}}\n|-\n|119\n|{{flag|Grenada}}\n|{{dts|14 April 1979}}\n|-\n|120\n|{{flag|Gambia}}\n|{{dts|19 May 1979}}\n|-\n|121\n|{{flag|Suriname}}\n|{{dts|31 May 1979}}\n|-\n|122\n|{{flag|Lesotho}}\n|{{dts|14 June 1979}}\n|-\n|123\n|{{flag|Sudan}}\n|{{dts|20 June 1979}}\n|-\n|124\n|{{flag|Saint Lucia}}\n|{{dts|23 August 1979}}\n|-\n|125\n|{{flag|Jordan}}\n|{{dts|7 September 1979}}\n|-\n|126\n|{{flag|Rwanda}}\n|{{dts|7 September 1979}}\n|-\n|—\n|{{flag|Sahrawi Arab Democratic Republic}}\n|{{dts|21 January 1980}}\n|-\n|127\n|{{flag|Zimbabwe}}\n|{{dts|20 April 1980}}\n|-\n|128\n|{{flag|Vanuatu}}\n|{{dts|11 March 1983}}\n|-\n|129\n|{{flag|Ivory Coast}}\n|{{dts|11 February 1986}}<ref name=\":132\">{{Cite web |title=Diplomatic relations between Cuba and ... |url=https://digitallibrary.un.org/search?ln=en&as=1&m1=p&p1=Diplomatic+relations+between+Cuba+and+...&f1=series&op1=a&m2=a&p2=&f2=&op2=a&m3=a&p3=&f3=&dt=&d1d=&d1m=&d1y=&d2d=&d2m=&d2y=&rm=&action_search=Search&sf=year&so=a&rg=50&c=United+Nations+Digital+Library+System&of=hb&fti=0&fti=0 |access-date=3 September 2023 |website=United Nations Digital Library}}</ref>\n|-\n|130\n|{{flag|Australia}}\n|{{dts|31 January 1989}}\n|-\n|—\n|{{flag|State of Palestine}}\n|{{dts|3 February 1989}}<ref>{{Cite book |title=Latin American Weekly Report |publisher=Latin American Newsletters Limited |year=1989 |pages=6}}</ref><ref>{{Cite book |title=Daily Report Latin America · Volume 89, Issues 30-38 |publisher=United States. Foreign Broadcast Information Service |year=1989 |pages=7 |quote=Cuba was one of the first coun-tries to acknowledge the Palestinian State. I say here that on 3 February we inaugurated the first embassy ot the Palestinian State in Latin America.}}</ref>\n|-\n|131\n|{{flag|Somalia}}\n|{{dts|31 July 1989}}\n|-\n|132\n|{{flag|Papua New Guinea}}\n|{{dts|13 October 1989}}<ref>{{Cite web |date=23 November 2016 |title=Rindió honores a Martí Primer Ministro de Papúa Nueva Guinea |url=https://www.granma.cu/cuba/2016-11-23/rindio-honores-a-marti-primer-ministro-de-papua-nueva-guinea-23-11-2016-00-11-40 |access-date=24 April 2025 |website=Granma |language=es}}</ref><ref>{{Cite book |title=Summary of World Broadcasts The Far East. Part III · Part 3 |publisher=British Broadcasting Corporation. Monitoring Service |year=1989 |pages=A-22 |quote=.. Papua New Guinea and Cuba establish diplomatic ties PNG Foreign Minister Michael Somare signed a formal agreement to establish diplomatic relations with Cuba in New York on 13th October}}</ref>\n|-\n|133\n|{{flag|Qatar}}\n|{{dts|13 December 1989}}\n|-\n|134\n|{{flag|Namibia}}\n|{{dts|23 March 1990}}\n|-\n|135\n|{{flag|Estonia}}\n|{{dts|12 November 1991}}<ref>{{Cite web |date=30 January 2018 |title=Diplomaatiliste suhete (taas)kehtestamise kronoloogia |url=https://www.vm.ee/rahvusvaheline-suhtlus-uleilmne-eestlus/suhted-teiste-riikidega/diplomaatiliste-suhete |access-date=26 October 2022 |language=et}}</ref>\n|-\n|136\n|{{flag|Latvia}}\n|{{dts|20 December 1991}}\n|-\n|137\n|{{flag|Ukraine}}\n|{{dts|12 March 1992}}\n|-\n|138\n|{{flag|Moldova}}\n|{{dts|17 March 1992}}\n|-\n|139\n|{{flag|Kyrgyzstan}}\n|{{dts|20 March 1992}}\n|-\n|140\n|{{flag|Turkmenistan}}\n|{{dts|23 March 1992}}\n|-\n|141\n|{{flag|Tajikistan}}\n|{{dts|25 March 1992}}\n|-\n|142\n|{{flag|Armenia}}\n|{{dts|27 March 1992}}\n|-\n|143\n|{{flag|Azerbaijan}}\n|{{dts|10 April 1992}}\n|-\n|144\n|{{flag|Kazakhstan}}\n|{{dts|14 April 1992}}\n|-\n|145\n|{{flag|Belarus}}\n|{{dts|16 April 1992}}\n|-\n|146\n|{{flag|Georgia}}\n|{{dts|18 April 1992}}\n|-\n|147\n|{{flag|Saint Vincent and the Grenadines}}\n|{{dts|26 May 1992}}\n|-\n|148\n|{{flag|Slovenia}}\n|{{dts|22 September 1992}}<ref>{{Cite web |last=Đogić |first=Mojca Pristavec |date=September 2016 |title=Priznanja samostojne Slovenije |url=https://fotogalerija.dz-rs.si/datoteke/Publikacije/Zborniki_RN/2016/Priznanja_samostojne_Slovenije_.pdf |access-date=11 July 2023 |language=sl |archive-date=26 April 2023 |archive-url=https://web.archive.org/web/20230426044554/https://fotogalerija.dz-rs.si/datoteke/Publikacije/Zborniki_RN/2016/Priznanja_samostojne_Slovenije_.pdf |url-status=dead }}</ref>\n|-\n|149\n|{{flag|Croatia}}\n|{{dts|23 September 1992}}<ref>{{cite web |title=Bilateral relations - Date of Recognition and Establishment of Diplomatic Relations |url=https://mvep.gov.hr/foreign-policy/bilateral-relations/date-of-recognition-and-establishment-od-diplomatic-relations/22800 |access-date=5 February 2022 |website=Ministry of Foreign Affairs of Croatia}}</ref>\n|-\n|150\n|{{flag|Slovakia}}\n|{{dts|1 January 1993}}\n|-\n|151\n|{{flag|Antigua and Barbuda}}\n|{{dts|6 April 1994}}\n|-\n|152\n|{{flag|South Africa}}\n|{{dts|11 May 1994}}\n|-\n|153\n|{{flag|Oman}}\n|{{dts|23 May 1994}}\n|-\n|154\n|{{flag|Bahrain}}\n|{{dts|17 June 1994}}\n|-\n|155\n|{{flag|Saint Kitts and Nevis}}\n|{{dts|10 May 1995}}\n|-\n|156\n|{{flag|Belize}}\n|{{dts|15 July 1995}}\n|-\n|157\n|{{flag|Eswatini}}\n|{{dts|22 September 1995}}\n|-\n|158\n|{{flag|Andorra}}\n|{{dts|19 October 1995}}\n|-\n|159\n|{{flag|Kenya}}\n|{{dts|19 October 1995}}\n|-\n|160\n|{{flag|Dominica}}\n|{{dts|18 May 1996}}\n|-\n|161\n|{{flag|San Marino}}\n|{{dts|28 May 1996}}\n|-\n|162\n|{{flag|Eritrea}}\n|{{dts|8 November 1996}}\n|-\n|163\n|{{flag|Brunei}}\n|{{dts|4 April 1997}}\n|-\n|164\n|{{flag|Singapore}}\n|{{dts|18 April 1997}}\n|-\n|165\n|{{flag|Bosnia and Herzegovina}}\n|{{dts|29 April 1997}}\n|-\n|166\n|{{flag|Liechtenstein}}\n|{{dts|11 June 1997}}\n|-\n|167\n|{{flag|Malawi}}\n|{{dts|10 December 1997}}\n|-\n|168\n|{{flag|Djibouti}}\n|{{dts|20 November 1998}}<ref name=\":132\" />\n|-\n|169\n|{{flag|New Zealand}}\n|{{dts|17 February 1999}}\n|-\n|170\n|{{flag|Ireland}}\n|{{dts|27 October 1999}}\n|-\n|171\n|{{flag|Central African Republic}}\n|{{dts|3 March 2000}}\n|-\n|172\n|{{flag|North Macedonia}}\n|{{dts|5 May 2000}}\n|-\n|173\n|{{flag|United Arab Emirates}}\n|{{dts|18 March 2002}}\n|-\n|174\n|{{flag|Nauru}}\n|{{dts|7 May 2002}}\n|-\n|175\n|{{flag|Timor-Leste}}\n|{{dts|20 May 2002}}\n|-\n|176\n|{{flag|Tonga}}\n|{{dts|17 June 2002}}\n|-\n|177\n|{{flag|Fiji}}\n|{{dts|19 July 2002}}\n|-\n|—\n|{{flag|Cook Islands}}\n|{{dts|1 September 2002}}\n|-\n|178\n|{{flag|Kiribati}}\n|{{dts|1 September 2002}}\n|-\n|179\n|{{flag|Solomon Islands}}\n|{{dts|19 December 2002}}\n|-\n|180\n|{{flag|Uzbekistan}}\n|{{dts|13 March 2006}}\n|-\n|181\n|{{flag|Tuvalu}}\n|{{dts|26 April 2006}}\n|-\n|182\n|{{flag|Montenegro}}\n|{{dts|20 October 2006}}\n|-\n|183\n|{{flag|Samoa}}\n|{{dts|11 October 2007}}\n|-\n|184\n|{{flag|Monaco}}\n|{{dts|19 December 2007}}\n|-\n|185\n|{{flag|South Sudan}}\n|{{dts|10 July 2011}}\n|-\n|186\n|{{flag|Bhutan}}\n|{{dts|26 September 2011}}<ref name=\":132\" />\n|-\n|187\n|{{flag|Lithuania}}\n|{{dts|26 September 2013}}\n|-\n|—\n|{{flag|Niue}}\n|{{dts|5 September 2014}}\n|-\n|188\n|{{flag|Federated States of Micronesia}}\n|{{dts|9 September 2015}}\n|-\n|189\n|{{flag|Palau}}\n|{{dts|26 September 2015}}\n|-\n|190\n|{{flag|Marshall Islands}}\n|{{dts|27 September 2015}}\n|-\n|191\n|{{flag|South Korea}}\n|{{dts|14 February 2024}}<ref>{{Cite news |date=14 February 2024 |title=S. Korea establishes diplomatic relations with Cuba |language=en |url=https://english.news.cn/asiapacific/20240214/abf1d4e8d34d40f68ae9151edf74d555/c.html |access-date=14 February 2024}}</ref>\n|}\n\n==Bilateral relations==\n=== Africa ===\n\n{| class=\"wikitable sortable\" style=\"width:100%; margin:auto;\"\n|-\n! style=\"width:15%;\"| Country\n! style=\"width:12%;\"| Formal Relations Began\n!Notes\n|- valign=\"top\"\n| {{flag|Angola}} ||<!-- Date started -->|| See [[Angola–Cuba relations]]\n|- valign=\"top\"\n| {{flag|Ethiopia}} || <!-- Date started --> 18 July 1975||See [[Cuba–Ethiopia relations]]\n\n* Cuba has an embassy in [[Addis Ababa]].<ref>{{cite web| url = http://misiones.minrex.gob.cu/es/etiopia| title = Embassy of Cuba in Ethiopia| date = 9 May 2017| access-date = 11 August 2017| archive-date = 11 August 2017| archive-url = https://web.archive.org/web/20170811104337/http://misiones.minrex.gob.cu/es/etiopia| url-status = dead}}</ref>\n* Ethiopia has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Kenya}} || <!-- Date started --> || See [[Cuba–Kenya relations]]\n\n* Cuba has an embassy in [[Nairobi]].\n* Kenya has an embassy in Havana.\n|-\n|{{Flag|Libya}} || 1 March 1976 || See [[Cuba–Libya relations]]\nBoth countries established diplomatic relations on 1 March 1976.<ref>{{Cite web |title=Relaciones Diplomaticas y Consulares |url=https://archivo.cubaminrex.cu/sites/default/files/memoria_anual_2015.pdf |url-status=dead |archive-url=https://web.archive.org/web/20190507190813/https://archivo.cubaminrex.cu/sites/default/files/memoria_anual_2015.pdf |archive-date=7 May 2019 |access-date=3 November 2023 |website=Memoria Anual 2015 |page=22 |language=es}}</ref>\n* Cuba is accredited to Libya from its embassy in [[Cairo]].\n* Libya has an embassy in [[Havana]].\n|- valign=\"top\"\n| {{flag|Namibia}} || <!-- Date started --> || See [[Cuba–Namibia relations]]\n\nCuban-Namibian relations began during the [[South African Border War]], when Cuba helped establish a number of training camps in [[Angola]] for the [[People's Liberation Army of Namibia]] (PLAN), armed wing of the [[South West African People's Organisation]] (SWAPO).<ref name=\"MAA\">{{cite book|last=Peter|first=Abbott|author2=Helmoed-Romer Heitman|author3=Paul Hannon|title=Modern African Wars (3): South-West Africa|pages=5–13|url=https://books.google.com/books?id=t9Aj997IO9gC|isbn=978-1-85532-122-9|year=1991|publisher=Osprey Publishing}}{{Dead link|date=January 2023 |bot=InternetArchiveBot |fix-attempted=yes }}</ref> Cuba also supported both SWAPO and PLAN through a number of political and diplomatic initiatives.<ref name=\"radiohc.cu\">[http://www.radiohc.cu/ingles/noticias/julio05/5julio/cuba7.htm Cuba-Namibia Joint Commission Meeting Kicks off in Havana]{{dead link|date=January 2017 |bot=InternetArchiveBot |fix-attempted=yes }}, Radio Habana, Cuba, 5 July 2005</ref> Since independence, Namibia and Cuba have held joint meetings every two years for Economic, Scientific-Technical and Commercial Cooperation. In 2005, it was reported that 1,460 Cuban professionals had worked in Namibia, including 208 in 2005.<ref name=\"radiohc.cu\"/>\n* Cuba has an embassy in [[Windhoek]].\n* Namibia has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Sahrawi Arab Democratic Republic}} || <!-- Date started -->30 January 1980 || See [[Cuba–Sahrawi Arab Democratic Republic relations]]\n|- valign=\"top\"\n| {{anchor|Sierra Leone}}{{flag|Sierra Leone}} || <!-- Date started --> ||\n\nThe Cuban government initially pledged to send one hundred and sixty five health workers to [[Sierra Leone]] to take part in combating the [[Ebola virus epidemic in West Africa]].<ref>{{cite web|title=WHO welcomes Cuban doctors for Ebola response in west Africa|url=https://www.who.int/mediacentre/news/statements/2014/cuban-ebola-doctors/en/|archive-url=https://web.archive.org/web/20140913113043/http://www.who.int/mediacentre/news/statements/2014/cuban-ebola-doctors/en/|url-status=dead|archive-date=September 13, 2014|website=The World Health Organization Media Centre|publisher=World Health Organization|access-date=26 September 2014|ref=WHO Statement}}</ref> Later the Cuban government expanded this pledge with an additional three hundred health workers being sent throughout the region.<ref>{{cite news|title=Cuba pledges 300 more doctors, nurses to combat Ebola|url=http://america.aljazeera.com/articles/2014/9/26/ebola-cuba-who.html|access-date=26 September 2014|work=Al Jazeera America|agency=Al Jazeera and wire services|publisher=Al Jazeera|date=September 26, 2014|ref=AJA Ebola}}</ref>\n|- valign=\"top\"\n| {{flag|South Africa}} || <!-- Date started --> || See [[Cuba–South Africa relations]]\n\n* Cuba has an embassy in [[Pretoria]].<ref>{{cite web| url = http://misiones.minrex.gob.cu/es/sudafrica| title = Embassy of Cuba in South Africa| date = 30 September 2016| access-date = 11 August 2017| archive-date = 11 August 2017| archive-url = https://web.archive.org/web/20170811104621/http://misiones.minrex.gob.cu/es/sudafrica| url-status = dead}}</ref>\n* South Africa has an embassy in Havana.\n|}\n\n=== Americas ===\n\nCuba has supported a number of leftist groups and parties in Latin America and the Caribbean since the 1959 revolution. In the 1960s Cuba established close ties with the emerging [[Guatemala]]n social movement led by Luis Augusto Turcios Lima, and supported the establishment of the [[Guatemalan National Revolutionary Unity|URNG]], a militant organization that has evolved into one of Guatemala's current political parties. In the 1980s Cuba backed both the [[Sandinistas]] in [[Nicaragua]] and the [[Farabundo Martí National Liberation Front|FMLN]] in [[El Salvador]], providing military and intelligence training, weapons, guidance, and organizational support.\n\n{| class=\"wikitable sortable\" style=\"width:100%; margin:auto;\"\n|-\n! style=\"width:15%;\"| Country\n! style=\"width:12%;\"| Formal Relations Began\n!Notes\n|- valign=\"top\"\n| {{flag|Argentina}} || <!-- Date started -->12 May 1909 || See [[Argentina–Cuba relations]]\n\n* Argentina has an embassy in Havana.<ref>{{Cite web|url=https://ecuba.cancilleria.gob.ar/|title=Embajada en Cuba|website=ecuba.cancilleria.gob.ar}}</ref>\n* Cuba has an embassy in [[Buenos Aires]].<ref>{{cite web| url = http://misiones.minrex.gob.cu/es/argentina/| title = Embassy of Cuba in Argentina (in Spanish)| date = 15 December 2015| access-date = 11 August 2017| archive-date = 10 August 2017| archive-url = https://web.archive.org/web/20170810091654/http://misiones.minrex.gob.cu/es/argentina/| url-status = dead}}</ref>\n|- valign=\"top\"\n| {{flag|Bolivia}} || <!-- Date started --> ||See [[Bolivia–Cuba relations]]\n\n* Bolivia has an embassy in Havana.\n* Cuba has an embassy in [[La Paz]].\n|- valign=\"top\"\n| {{flag|Brazil}} || <!-- Date started --> || See [[Brazil–Cuba relations]]\n\nWith the electoral win of the President of [[Brazil]], [[Luiz Inácio Lula da Silva]] in 2002 ties between Cuba and Brazil steadily warmed. Brazil continued to play its part in trying to revive and upgrade the offshore oil and gas infrastructure of Cuba.<ref>{{cite news| url=http://news.bbc.co.uk/2/hi/business/3266509.stm | work=BBC News | title=Cuba's new oil industry | date=2003-11-13 | access-date=2010-05-02 | first=Tom | last=Fawthrop}}</ref> In addition, talks led by Brazil  were underway seeking to develop a framework for Cuba to become a normalised affiliate member of the [[Mercosur]] bloc of countries.<ref>{{Cite web|url=https://www.brazzil.com/789-brazil-confirms-cuba-on-the-verge-of-joining-mercosur/|title = Brazil Confirms: Cuba on the Verge of Joining Mercosur}}</ref>\n\nBrazilian-Cuban relations deteriorated greatly under the presidency of Brazilian rightwing president [[Jair Bolsonaro]] since 2019 .He stopped Mais Medicos (More Doctors) programme and thousands of Cuban doctors left Brazil.<ref>{{cite news| url = https://www.reuters.com/article/us-brazil-cuba-idUSKCN1N71ZF| title = Reuters| website = [[Reuters]]| date = 2 November 2018}}</ref><ref>{{cite news| url = https://www.reuters.com/article/us-brazil-cuba-doctors-idUSKCN1NR2C5| title = Reuters| website = [[Reuters]]| date = 22 November 2018}}</ref> In November 2019, Brazil voted for the first time against an annual United Nations resolution condemning and calling for an end to Washington's economic embargo on Cuba.<ref>{{cite news| url = https://www.reuters.com/article/us-un-cuba-brazil-exclusive-idUSKBN1XG2ZZ| title = Reuters| website = [[Reuters]]| date = 6 November 2019}}</ref>\n* Brazil has an embassy in Havana.\n* Cuba has an embassy in [[Brasília]] and a consulate-general in [[São Paulo]].\n|- valign=\"top\"\n| {{flag|Canada}} || <!-- Date started -->1945 || See [[Canada–Cuba relations]]\n\n[[Canada]] has always maintained consistently cordial relations with Cuba, in spite of considerable pressure from the United States, and the island is also one of the most popular travel destinations for Canadian citizens. Canada-Cuba relations can be traced back to the 18th century, when vessels from the [[Atlantic Canada|Atlantic provinces]] of Canada traded codfish and beer for rum and sugar. Cuba was the first country in the Caribbean selected by Canada for a diplomatic mission. Official diplomatic relations were established in 1945, when Emile Vaillancourt, a noted writer and historian, was designated Canada's representative in Cuba. Canada and Mexico were the only two countries in the hemisphere to maintain uninterrupted diplomatic relations with Cuba following the Cuban Revolution in 1959.\n\nIn 1994, a joint venture was formed between the Cuban Nickel Union and the Canadian firm [[Sherritt International]], which operates a mining and processing plant on the island in [[Moa, Cuba|Moa]]. A second enterprise, Cobalt Refinery Co. Inc., was created in Alberta for nickel refining. Canada has been critical of the U.S. trade embargo against Cuba, and strongly objected to the [[Helms-Burton Act]]. In 1996 Foreign Affairs Minister [[Lloyd Axworthy]] stated: \"Canada shares the U.S. objectives of improving human rights standards and moving to more representative government in Cuba. But we are concerned that the Helms-Burton Act takes the wrong approach. That is why we have been working with other countries to uphold the principles of international law\". In 1996 a [[Private Member's Bill]] was introduced, but not made law, in the [[Parliament of Canada|Canadian Parliament]]; this law called the [[Godfrey–Milliken Bill]] was in response to the extraterritoriality of the aforementioned Act.\n\nFormer Prime Minister [[Pierre Trudeau]] and [[Fidel Castro]] were personal friends. Castro was among Pierre Trudeau's pallbearers at [[State funeral of Pierre Trudeau|his funeral]] in 2000. Former Prime Minister [[Jean Chrétien]] and Fidel Castro also maintained a close relationship.\n\n* Canada has an embassy in Havana.<ref>{{Cite web|url=https://www.canadainternational.gc.ca/cuba/index.aspx?lang=eng|title=Embassy of Canada to Cuba|first=Global Affairs|last=Canada|date=September 9, 2013|website=GAC}}</ref>\n* Cuba has an embassy in [[Ottawa]].<ref>{{cite web| url = http://misiones.minrex.gob.cu/es/canada| title = Embassy of Cuba in Canada| date = 3 June 2016| access-date = 11 August 2017| archive-date = 11 August 2017| archive-url = https://web.archive.org/web/20170811105026/http://misiones.minrex.gob.cu/es/canada| url-status = dead}}</ref>\n\n|- valign=\"top\"\n| {{flag|Chile}} || <!-- Date started --> || See [[Chile–Cuba relations]]\n\n{{see also|Fidel Castro's state visit to Chile}}\nCuba has been since the 1960s a reference point to left wing politicians in [[Chile]]. Recently relations to Cuba has been hot subject in [[Concert of Parties for Democracy|Concertación]] politics since the [[Christian Democrat Party of Chile]], member of the Concertación, has supported a harder line in the diplomatic relations with Cuba while the [[Socialist Party of Chile]] has opposed this.{{Citation needed|date=June 2009}}\n\nIn 1971, despite an [[Organization of American States]] convention that no nation in the Western Hemisphere would have a relationship with Cuba (the only exception being Mexico, which had refused to adopt that convention), Castro took a month-long visit to Chile, following the re-establishment of diplomatic relations with Cuba. The visit, in which Castro participated actively in the internal politics of the country, holding massive rallies and giving public advice to [[Salvador Allende]], was seen by those on the political right as proof to support their view that \"The Chilean Way to Socialism\" was an effort to put Chile on the same path as Cuba.<ref>{{cite book | last = Quirk | first = Robert |date= August 1995 | title = Fidel Castro | publisher = W. W. Norton & Company }}</ref>\n* Chile has an embassy in Havana.\n* Cuba has an embassy in [[Santiago]].\n|- valign=\"top\"\n| {{flag|Colombia}} || <!-- Date started --> ||See [[Colombia–Cuba relations]]\n\nCuba gave training, money, medicines, weapons and safe haven to members of [[Colombian people|Colombian]] guerrilla movements, especially to the [[National Liberation Army (Colombia)|ELN]] and also to members of the [[Revolutionary Armed Forces of Colombia|FARC]], both of which were founded in the early 1960s. In the years leading up to his death, Fidel Castro made gestures of reconciliation with different Colombian government administrations, and has been considered responsible for facilitating talks between them and the opposing guerrilla groups.\n* Colombia has an embassy in Havana.\n* Cuba has an embassy in [[Bogotá]].\n|- valign=\"top\"\n| {{flag|Costa Rica}} || <!-- Date started --> ||\n\n[[Costa Rica]] broke relations with Cuba in 1961 to protest Cuban support of the left in Central America and renewed formal diplomatic ties with Fidel Castro's government in March 2009. In 1995, Costa Rica established a consular office in Havana. Cuba opened a consular office in Costa Rica in 2001, but relations continued to be difficult. In 2006, shortly after the death of [[Augusto Pinochet]], Costa Rican President [[Óscar Arias]] compared Fidel Castro's human rights record to that of the former Chilean president. In response, Cuban officials released a statement describing the Washington aligned Arias as a \"vulgar mercenary\" of U.S. officials, and asserting that Washington \"always had on hand another opportunistic clown ready to follow its aggressive plans against Cuba.\"<ref>{{cite news |url=http://www.mlive.com/newsflash/international/index.ssf?/base/international-10/11672682008600.xml&storylist=international |title=Cuba slams Costa Rican leader's remarks |agency=Associated Press |url-status=dead |archive-url=https://web.archive.org/web/20070930165104/http://www.mlive.com/newsflash/international/index.ssf?%2Fbase%2Finternational-10%2F11672682008600.xml&storylist=international |archive-date=2007-09-30 }}</ref><ref>{{cite web | url = http://granmai.cubaweb.com/ingles/2006/diciembre/mier27/01decla.html | title = Statement from the Ministry of Foreign Affairs: Oscar Arias: Vain, mediocre and obsessed with being a star | publisher = Granma | url-status = dead | archive-url = https://web.archive.org/web/20110524184407/http://granmai.cubaweb.com/ingles/2006/diciembre/mier27/01decla.html | archive-date = 2011-05-24 }}</ref>\n* Costa Rica has an embassy in Havana.\n* Cuba has an embassy in [[San José, Costa Rica|San José]].\n|- valign=\"top\"\n| {{flag|Dominican Republic}} || <!-- Date started --> ||See [[Cuba-Dominican Republic relations]]\n\n* Cuba has an embassy in [[Santo Domingo]].\n* Dominican Republic has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|El Salvador}} || <!-- Date started --> ||\n\nCuba and [[El Salvador]] resumed diplomatic relations on June 1, 2009. El Salvador previously suspended diplomatic relations with Cuba in 1961 due to the Cuban Revolution.<ref>{{cite web|url=https://www.google.com/hostednews/afp/article/ALeqM5jdUQFbECZYRXiqkl75Rzs3cPsH6w |archive-url=https://web.archive.org/web/20110315073814/http://www.google.com/hostednews/afp/article/ALeqM5jdUQFbECZYRXiqkl75Rzs3cPsH6w |url-status=dead |archive-date=March 15, 2011 |title=El Salvador and Cuba reestablish diplomatic ties |date=2009-06-01 |access-date=2012-03-23}}</ref> Diplomatic ties were resumed after El Salvador's new president [[Mauricio Funes]], who had pledged to reestablish them, was sworn into office. El Salvador is also the very last Latin American nation to resume diplomatic relations with Cuba.<ref>{{Cite web|url=https://foreignpolicyblogs.com/2009/06/02/el-salvador-and-cuba-normalize-relations/|title = El Salvador and Cuba normalize relations| date=2 June 2009 }}</ref>\n* Cuba has an embassy in [[San Salvador]].\n* El Salvador has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Grenada}} || <!-- Date started --> ||See [[Cuba–Grenada relations]]\n\n* Cuba has an embassy in [[St. George's, Grenada|St. George's]].\n* Grenada has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Guatemala}} ||<!-- Date started -->||See [[Cuba–Guatemala relations]]\n\n* Cuba has an embassy in [[Guatemala City]].\n* Guatemala has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Guyana}} || <!-- Date started --> 1972||\n*Both countries established diplomatic relations on December 8, 1972.<ref>{{Cite web|url=http://www.minfor.gov.gy/diplomatic-relations/|title=Countries with which Guyana has Establishment Diplomatic Relations – Ministry of Foreign Affairs and International Cooperation&#124; Co-operative Republic of Guyana|access-date=2019-02-24|archive-date=2019-12-24|archive-url=https://web.archive.org/web/20191224073504/http://www.minfor.gov.gy/diplomatic-relations/|url-status=dead}}</ref> \n*Both countries are full members of the [[Organization of American States]].\n* Cuba has an embassy in [[Georgetown, Guyana|Georgetown]].\n* Guyana has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Haiti}} || <!-- Date started --> ||See [[Cuba-Haiti relations]]\n\n* Cuba has an embassy in [[Port-au-Prince]].\n* Haiti has an embassy in Havana.\n* Cuba resumed relations with Haiti in 1997 and since has sent thousands of doctors to Haiti since relations were re-established in 1997, performing hundreds of thousands of surgeries, medical consultations and have trained over 1,000 Haitian doctors at its medical schools. In addition, over 100,000 people in Haiti have become literate through Cuban efforts.\n|- valign=\"top\"\n| {{flag|Jamaica}} ||1972||See [[Cuba–Jamaica relations]]\n\n* Cuba has an embassy in [[Kingston, Jamaica|Kingston]].\n* Jamaica has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Mexico}} || <!-- Date started -->1902 || See [[Cuba–Mexico relations]]\n[[File:Enrique Peña Nieto y Fidel Castro.jpg|thumb|right|Mexican President [[Enrique Peña Nieto]] with former Cuban President [[Fidel Castro]] in January 2014]]\n\nBefore the Cuban revolution, [[Mexico]] was the country where several Cubans were exiled fleeing political persecution by the government of Batista like [[Julio Antonio Mella]], Juan Marinello, [[Fidel Castro]] and [[Raúl Castro]].\n\nAfter the Cuban revolution when Cuba was expelled from the [[Organization of American States]], Mexico did not support this resolution and abstained, claiming a non-intervention policy. Relations were stable from 1934 to 1998.\n\nAlthough the relationship between Cuba and Mexico remains strained, each side appears to make attempts to improve it. In 1998, Fidel Castro apologized when he said that \"Mexican kids knew [[Mickey Mouse]] better than national heroes of their own country\", which led Mexico to recall its ambassador from Havana.<ref>{{cite web |url=http://www2.fiu.edu/~fcf/castroapologizes.html |title=Castro apologizes to Mexico's kids for put-down |publisher=.fiu.edu |date=1998-12-19 |access-date=2012-07-26 |url-status=dead |archive-url=https://web.archive.org/web/20100808044249/http://www2.fiu.edu/~fcf/castroapologizes.html |archive-date=2010-08-08 }}</ref> Rather, he said, his words were meant to underscore the cultural dominance of the US.<ref>{{cite news |date=1998-12-19 |url=http://news.bbc.co.uk/1/hi/world/americas/238827.stm | title = Castro says sorry to Mexico | work = BBC News | access-date = 2006-05-21 | location=London}}</ref>\n\nMexican [[President of Mexico|President]] [[Vicente Fox]] apologized to Fidel Castro in 2002 over statements by Castro, who had taped their telephone conversation, to the effect that Fox forced him to leave a United Nations summit in Mexico so that he would not be in the presence of President Bush, who also attended.<ref>{{cite news |date=2002-04-25 | url = http://news.bbc.co.uk/2/hi/americas/1946089.stm | title = Mexico's Fox apologises to Castro | work = BBC News | access-date = 2006-05-21 | location=London}}</ref>\n\nIn 2004, Mexico suspended relations with Cuba after businessman [[Carlos Ahumada]] was arrested and deported to Mexico and the paperwork provided by the Cuban government proved that there was a plan from the Mexican government to make a complot against the potential presidential candidate from the opposition party [[Andrés Manuel López Obrador]]. In April 2012, Mexican president [[Felipe Calderón]] made a two-day visit to Havana. In January 2014, Mexican president [[Enrique Peña Nieto]] paid an official visit to Cuba.<ref>{{cite web|url=http://mexico.cnn.com/nacional/2014/01/28/pena-nieto-llega-a-cuba-para-reafirmar-la-amistad-entre-los-paises|title=Peña Nieto llega a Cuba para \"reafirmar\" la amistad entre los países|access-date=27 April 2016}}</ref>\n\n* Cuba has an embassy in [[Mexico City]] and consulates-general in [[Cancún]], [[Mérida, Yucatán|Mérida]], [[Monterrey]] and [[Veracruz (city)|Veracruz City]].<ref>{{cite web| url = http://misiones.minrex.gob.cu/es/mexico| title = Embassy of Cuba in Mexico| date = 4 April 2016| access-date = 11 August 2017| archive-date = 22 May 2019| archive-url = https://web.archive.org/web/20190522055930/http://misiones.minrex.gob.cu/es/mexico| url-status = dead}}</ref>\n* Mexico has an embassy in Havana.<ref>{{Cite web|url=https://embamex.sre.gob.mx/cuba/|title=Inicio|website=embamex.sre.gob.mx}}</ref>\n|- valign=\"top\"\n| {{flag|Panama}} || <!-- Date started --> ||\n\nCuba and [[Panama]] have restored diplomatic ties after breaking them off in 2004 when Panama's former president [[Mireya Moscoso]] pardoned four Cubans, including [[Luis Posada Carriles]], who were accused of attempting to assassinate Cuban President [[Fidel Castro]]. The foreign minister of each country re-established official diplomatic relations in Havana by signing a document describing a spirit of fraternity that has long linked both nations.<ref name=\"Cuba and Panama restore relations\">{{cite news | last = Gibbs| first = Stephen| url = http://news.bbc.co.uk/2/hi/americas/4170374.stm | title = Cuba and Panama restore relations | work = BBC News | access-date = 2006-05-21 | date=2005-08-21 | location=London}}</ref> In March 2009, the governments of Costa Rica and El Salvador announced that they plan on re-establishing full diplomatic relations with Cuba.<ref>{{cite news|url=http://news.bbc.co.uk/2/hi/americas/7951908.stm|title=Cuba neighbours to restore ties |work= BBC News|date=2009-03-18|access-date=2009-03-19 | location=London}}</ref>\n* Cuba has an embassy in [[Panama City]].\n* Panama has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Peru}} || <!-- Date started --> ||See [[Cuba–Peru relations]]\n\n* Cuba has an embassy in [[Lima]].\n* Peru has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Suriname}} || <!-- Date started --> ||See [[Cuba–Suriname relations]]\n\n* Cuba has an embassy in [[Paramaribo]].\n* Suriname has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|United States}} || <!-- Date started --> || See [[Cuba–United States relations]]\n\nThe [[Cuban Revolution]] led to the deterioration of relations between the two countries, with diplomatic ties broken on January 3, 1961. After an initial 54-year stretch of hostility, relations eased briefly from 2015 to 2017 in an effort known as the [[Cuban thaw]]. The [[Détente|diplomatic détente]] was reversed by the U.S. government shortly thereafter due to a variety of subsequent geopolitical issues. Modern diplomatic relations remain cold, stemming from historic conflict and divergent political ideologies.<ref>{{Cite news |last=Robles |first=Frances |last2=Augustin |first2=Ed |last3=Cohen |first3=Hannah Berkeley |date=27 December 2024 |title=10 Years Ago, a U.S. Thaw Fueled Cuban Dreams. Now Hope Is Lost. |url=https://www.nytimes.com/2024/12/27/world/americas/obama-us-thaw-cuba-crisis.html |access-date=12 July 2025 |work=The New York Times |language=en-US |issn=0362-4331}}</ref><ref>{{Cite news |last=Frank |first=Marc |date=January 24, 2025 |title=As Cuba-US relations sour, the island needs dollars more than ever |url=https://www.reuters.com/world/americas/cuba-us-relations-sour-island-needs-dollars-more-than-ever-2025-01-24/ |access-date=July 12, 2025 |work=Reuters |language=en}}</ref>\n\n* Cuba has an embassy in [[Washington, D.C.]]<ref>{{Cite web |url=http://www.cubadiplomatica.cu/eeuu/EN/Mission/ConsularSectioninWashington.aspx |title=Embassy of Cuba in the United States |access-date=2017-08-11 |archive-url=https://web.archive.org/web/20170811104425/http://www.cubadiplomatica.cu/eeuu/EN/Mission/ConsularSectioninWashington.aspx |archive-date=2017-08-11 |url-status=dead }}</ref>\n* United States has an embassy in Havana.<ref>{{Cite web|url=https://cu.usembassy.gov/|title=U.S. Embassy in Cuba|website=U.S. Embassy in Cuba}}</ref>\n|- valign=\"top\"\n| {{flag|Uruguay}} || <!-- Date started --> ||See [[Cuba–Uruguay relations]]\n\n* Cuba has an embassy in [[Montevideo]].\n* Uruguay has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Venezuela}} || <!-- Date started --> || See [[Cuba–Venezuela relations]]\n\nRelations between Cuba and [[Venezuela]] significantly improved during the [[Presidency of Hugo Chávez]]. Chávez formed a major alliance with Cuban president Fidel Castro and significant trade relationship with Cuba since his election in 1999. The warm relationship between the two countries continued to intensify.<ref name=BRITANNICA>{{cite encyclopedia|url=http://www.britannica.com/eb/article-9403289/Cuba|title=Cuba|author=Daniel P. Erikson|access-date=2008-06-10|encyclopedia=[[Encyclopædia Britannica Online]]}}</ref>  Hugo Chávez described Castro as his mentor<ref name=DNAWAHC>{{cite news|url=http://www.dnaindia.com/report.asp?newsid=1043203&pageid=0|title=The world according to Hugo Chávez|date=2006-07-22|access-date=2008-06-08|newspaper=[[DNA (newspaper)|DNA]]|url-status=dead|archive-url=https://web.archive.org/web/20080618232327/http://www.dnaindia.com/report.asp?newsid=1043203&pageid=0|archive-date=2008-06-18}}</ref> and called Cuba \"a revolutionary democracy\".<ref name=BBCVEUCV>{{cite news|url=http://news.bbc.co.uk/2/hi/americas/4179050.stm|title=Venezuela ends upbeat Cuba visit|date=2005-08-24|access-date=2008-06-09|work=BBC News | location=London|first=Stephen|last=Gibbs}}</ref>\n\nIn 2005 the two countries also signed cooperation agreements in the area of energy and electricity, an accord between Venezuela's oil company [[PDVSA]] and its Cuban counterpart [[Cupet]] to buy and sell crude oil and a crude oil storage agreement between the two companies.<ref>{{cite web|url=http://www.bilaterals.org/article.php3?id_article=1835 |title=Cuba and Venezuela sign millionaire bilateral trade agreement |publisher=Bilaterals.org |access-date=2012-03-23}}</ref>\n\nHugo Chávez, who said he was one of the few people in the world who knew Castro's illness from July 31, 2006, helped Cuba undermine a strict U.S. embargo by sending cheap oil and boosting commercial relations. Agreements between Cuba and Venezuela, the world's No. 5 oil exporter, have brought more than 20,000 Cuban doctors to Venezuela to provide medical services for the poor. The program, one of numerous oil-funded social projects, helped Chávez build a strong political support base, and he won a reelection bid in December 2006.<ref name=reuters-09-03>{{cite news|title=Castro recovering and giving orders: Chavez|date=2006-09-03|work=Reuters|url=http://today.reuters.com/news/articlenews.aspx?type=topNews&storyID=2006-09-03T213241Z_01_N03251032_RTRUKOC_0_US-CUBA-CASTR0-VENEZUELA.xml&archived=False|url-status=dead|archive-url=https://web.archive.org/web/20061025044729/http://today.reuters.com/news/articlenews.aspx?type=topNews|archive-date=2006-10-25}}</ref>\n\nA U.S. official told the ''Miami Herald'' in 2016 that U.S. estimates of total Venezuelan subsidies to Cuba per year \"are up to the $2 billion figure.\" This is comparable to the $4 billion to $6 billion that the Soviet Union once pumped into Cuba per year.<ref>[http://www.miami.com/mld/miamiherald/news/world/cuba/15395148.htm] {{dead link|date=June 2016|bot=medic}}{{cbignore|bot=medic}}</ref>\n* Cuba has an embassy in [[Caracas]].\n* Venezuela has an embassy in Havana.\n|}\n\n=== Asia ===\n\n{| class=\"wikitable sortable\" style=\"width:100%; margin:auto;\"\n|-\n! style=\"width:15%;\"| Region\n! style=\"width:12%;\"| Formal Relations Began\n!Notes\n|- valign=\"top\"\n| {{flag|Armenia}} || <!-- Date started -->27 March 1992 ||\n\n* Both countries established diplomatic relations on 27 March 1992.<ref name=\"mfa.am\">{{Cite web |url=http://www.mfa.am/en/country-by-country/cu/ |title=Cuba - Bilateral Relations - Ministry of Foreign Affairs of the Republic of Armenia |access-date=2017-02-26 |archive-url=https://web.archive.org/web/20170702183505/http://mfa.am/en/country-by-country/cu/ |archive-date=2017-07-02 |url-status=dead }}</ref>\n* Armenia is accredited to Cuba from its embassy in Mexico City, Mexico.<ref name=\"mfa.am\"/>\n* Cuba is accredited to Armenia from its embassy in Moscow, Russia.<ref name=\"mfa.am\"/>\n|- valign=\"top\"\n| {{flag|Azerbaijan}} || 27 March 1992<ref name=\":0\">{{Cite web|title=Cuba|url=https://mfa.gov.az/en/content/369/cuba|access-date=2021-01-25|website=mfa.gov.az}}{{Dead link|date=July 2021 |bot=InternetArchiveBot |fix-attempted=yes }}</ref><!-- Date started -->||See [[Azerbaijan–Cuba relations]]\n* The diplomatic relations between the Republic of Azerbaijan and the Republic of Cuba were established on March 27, 1992.<ref name=\":0\" />\n*There is an Azerbaijan-Cuba interparliamentary working group acting within the parliament of the Republic of Azerbaijan.<ref name=\":0\" />\n*There is a Cuba-Azerbaijan interparliamentary working group acting within the parliament of the Republic of Cuba.<ref name=\":0\" />\n*Azerbaijan has an embassy in Havana.\n* Cuba has an embassy in [[Baku]].\n|- valign=\"top\"\n| {{flag|China}} || <!-- Date started --> || See [[China–Cuba relations]]\n\nAs the economy of the [[Soviet Union]] fell into a decline which ultimately led to [[Collapse of the Soviet Union|its collapse]] in 1991, the [[People's Republic of China]] has emerged as a new key partner for Cuba's foreign relations and the guardian of [[List of non-communist socialist states|socialist countries]] around the world. Relations between Cuba and China continue to grow including deals for China to set up a possible military base in Cuba, similar to the [[Bejucal]] Base and an agreement was signed between China and Cuba for China open more factories producing local goods such as televisions. Cuba has also purchased from China a wide range of items including bicycles, buses, refrigerators, rice cookers, energy-saving lightbulbs and diesel-electric locomotives with the aim of providing a boost to Cuba's national infrastructure.<ref>[http://www.caribbeannetnews.com/2006/01/16/trains.shtml Cuba gets China's first trains exported to Latin America] {{webarchive|url=https://web.archive.org/web/20060510171902/http://www.caribbeannetnews.com/2006/01/16/trains.shtml |date=2006-05-10 }} Caribbean Net News</ref>\n* China has an embassy in Havana.\n* Cuba has an embassy in [[Beijing]] and consulates-general in [[Guangzhou]] and [[Shanghai]].\n|- valign=\"top\"\n| {{flag|India}} || <!-- Date started --> || See [[Cuba–India relations]]\n\nRelations between India and Cuba have generally been warm and cordial since the Cuban revolution. Both nations are part of the [[Non-Aligned Movement]] and Cuba has repeatedly called for a more \"democratic\" representation of the United Nations Security Council, supporting India's candidacy for permanent membership on a reformed Security Council.<ref>{{cite web|url=http://www.indembassyhavana.org/?q=en/node/9|title=Ind Embassy Havana|access-date=27 April 2016|archive-date=28 December 2013|archive-url=https://web.archive.org/web/20131228012957/http://www.indembassyhavana.org/?q=en%2Fnode%2F9|url-status=dead}}</ref> [[Fidel Castro]] had said that  \"The maturity of India…, its unconditional adherence to the principles which lay at the foundation of the Non-Aligned Movement give us the assurances that under the wise leadership of [[Indira Gandhi]] (the former [[Prime Minister of India]]), the non-aligned countries will continue advancing in their inalienable role as a bastion for peace, national independence and development…\"\n<ref name=\"frontlineonnet.com\">{{cite web|url=http://www.frontlineonnet.com/fl2708/stories/20100423270805500.htm |title=50 years of friendship |access-date=2013-06-02 |url-status=dead |archive-url=https://web.archive.org/web/20110203145522/http://frontlineonnet.com/fl2708/stories/20100423270805500.htm |archive-date=2011-02-03 }}</ref>\n\nIndia provided Cuba with 10,000 tonnes of wheat and 10,000 tonnes of rice in 1992 when Cuba was undergoing hardship. Fidel Castro termed the donation as the \"Bread of India\" because it was sufficient for one loaf of bread for each one of the then Cuban population of eleven million people.<ref name=\"frontlineonnet.com\"/>\nIndia also provided donations worth two million dollars during the Cuban earthquake.<ref>{{cite web|url=http://www.latinamericanstudies.org/cuba/india-04.htm|title=Reitera la India su apoyo a Cuba frente a políticas agresivas de Estados Unidos|access-date=27 April 2016}}</ref>\n\n* Cuba has an embassy in [[New Delhi]].\n* India has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Indonesia}} || <!-- Date started --> ||See [[Cuba–Indonesia relations]]\n\n* Cuba has an embassy in [[Jakarta]].\n* Indonesia has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Iran}} || <!-- Date started --> || See [[Iran–Cuba relations]]\n\nIran has a productive trade balance with Cuba. The two governments signed a document to bolster cooperation in Havana in January 2006.<ref name=ge>{{cite news |title=Iran, Cuba sign banking agreement |url=http://www.globalexchange.org/countries/americas/cuba/3768.html |work=Islamic Republic News Agency |date=2008-02-19 |access-date=2008-06-08 |url-status=dead |archive-url=https://web.archive.org/web/20080124150809/http://www.globalexchange.org/countries/americas/cuba/3768.html |archive-date=2008-01-24 }}</ref> President [[Mahmoud Ahmadinejad]] called relations \"firm and progressive\" over the past three decades.<ref>{{cite web|url=http://www2.irna.ir/en/news/view/menu-3/0806037601194249.htm |title=President urges Tehran-Havana cooperation in NAM – Irna |access-date=2012-03-23 |url-status=dead |archive-url=https://web.archive.org/web/20120210103311/http://www2.irna.ir/en/news/view/menu-3/0806037601194249.htm |archive-date=2012-02-10 }}</ref>  Ahmadinejad made an official visit to the island in January 2012 as part of a series of official visits to various countries in Latin America.<ref>{{cite news| url=http://www.huffingtonpost.com/2012/01/11/mahmoud-ahmadinejad-cuba_n_1200050.html | work=Huffington Post | title=PHOTOS: Ahmadinejad In Cuba | date=2012-01-11}}</ref>  During his brief stay in Cuba, Ahmadinejad met with Fidel Castro and said that the two countries were \"fighting on the same front.\"<ref>{{cite news| url=http://www.huffingtonpost.com/2012/01/12/ahmadinejad-castro_n_1202471.html | work=Huffington Post | title=Ahmadinejad: Iran And Cuba Fighting On The Same Front | date=2012-01-12}}</ref>\n* Cuba has an embassy in [[Tehran]].\n* Iran has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Iraq}} || <!-- Date started --> || See [[Cuba–Iraq relations]]\n\n* Cuba is accredited to Iraq from its embassy in Tehran, Iran.\n* Iraq is accredited to Cuba from its embassy in Mexico City, Mexico.\n|- valign=\"top\"\n| {{flag|Israel}} || <!-- Date started --> || See [[Cuba–Israel relations]]\n[[File:Cuban ambassador to Israel1960.jpg|thumb|Cuban ambassador to Israel with [[Golda Meir]], 1960]]\n\nOn 29 November 1947, Cuba voted against the [[United Nations Partition Plan for Palestine]], the Cuban delegation stating they would vote against partition because they could not be party to coercing the majority in Palestine.<ref>[http://find.galegroup.com/ttda/infomark.do?&source=gale&prodId=TTDA&userGroupName=nypl&tabID=T003&docPage=article&searchType=BasicSearchForm&docId=CS68896125&type=multipage&contentSet=LTO&version=1.0 Palestine Vote Delayed] The Times of London, 29 Nov, 1947</ref> Nevertheless, Israel came into being on 14 May 1948, and Cuba recognised the [[State of Israel]] ''de facto'' on 14 January 1949. In March 1949 Cuba voted in the UN Security Council in favour of admission of Israel to the United Nations, and recognised Israel ''de jure'' on 18 April 1949.<ref>{{Cite book|author=Levinson, Jay|title=Jewish Community of Cuba: The Golden Age, 1906-1958|publisher=Westview Publishing Co|year=2006|page=150|isbn=978-0-9776207-0-8}}</ref> In May of that year Cuba also voted in favour of Israel's admission to the UN in the UN General Assembly.\n\nIsrael-Cuba relations have been icy since the 1960s. Cuba didn't succumb to Arab pressure to sever relations with Israel,  but sent troops to fight against Israel during the [[War of Attrition]] (1967–70), and also joined the expeditionary forces during the 1973 [[Yom Kippur War]], and broke diplomatic relations with Israel the same year. Israel has been the only country to consistently vote with the U.S. in the UN General Assembly against the annual [[United States embargo against Cuba#Criticism of embargo laws and rules|resolution criticizing the embargo]], which began in 1992.\n\nIn late 2010, [[Fidel Castro]], who no longer held office in Cuba's government, stated that he believes Israel has a \"right to exist\", which is a shift from his regime's earlier policy.<ref>{{cite web|url=http://www.elmundo.es/america/2010/09/22/cuba/1285188678.html |title=Fidel Castro reconoce el derecho de Israel a la existencia como un Estado judío &#124; Cuba |work=El Mundo|location=Spain |date=22 September 2010}}</ref> Margalit Bejarano posed in 2015 that any future relationship between Israel and Cuba will not solely rest on the course that will take Havana-Washington ties, but will also factor in Cuba's dependence on Iran, on Venezuela and its closeness to the Palestinians.<ref name=\"test\">[http://www.tandfonline.com/doi/pdf/10.1080/23739770.2015.1005450 Israel and Cuba: A New Beginning?], Margalit Bejarano. (2015). Israel Journal of Foreign Affairs, IX(1), 75-85.</ref><ref>See also Margalit Bejarano, La Comunidad Hebrea de Cuba: La memoria y la historia, (Jerusalem: Abraham Harman Institute of Contemporary Judaism, Hebrew University of Jerusalem, 1996)</ref>\n\nIn the light of the [[United States–Cuban Thaw|thaw in US-Cuba relations]], the Israeli government is re-examining the state of its relations with Cuba – Israel is presently represented in Cuba through an interest section in the Canadian embassy.<ref>{{cite web|url=http://www.cjnews.com/news/Israel/will-see-Israeli-cuban-rapprochement|title=Will we see an Israeli-Cuban rapprochement?|author=The CJN|date=10 August 2015|work=The Canadian Jewish News|access-date=27 April 2016}}</ref>\n|- valign=\"top\"\n| {{flag|Japan}} || <!-- Date started -->21 December 1929|| See [[Cuba–Japan relations]]\nCuba and Japan established diplomatic relations on 21 December 1929.\n|- valign=\"top\"\n| {{flag|Malaysia}} || <!-- Date started --> ||See [[Cuba–Malaysia relations]]\n\n* Cuba has an embassy in [[Kuala Lumpur]].\n* Malaysia has an embassy in Havana.\n|-\n|{{flag|Mongolia}}\n|<!-- Date started -->7 December 1960\n|\n* Cuba has an embassy in [[Ulaanbaatar]].\n* Mongolia has an embassy in Havana.\n*In the 1980s, the trade and cooperation agreements between the two governments were ratified.<ref>{{Cite web|title=Cuba y Mongolia celebran 60 años de amistad {{!}} Ministerio de Relaciones Exteriores de Cuba|url=http://www.cubaminrex.cu/es/cuba-y-mongolia-celebran-60-anos-de-amistad|access-date=2021-06-04|website=www.cubaminrex.cu|archive-date=2021-06-04|archive-url=https://web.archive.org/web/20210604021354/http://www.cubaminrex.cu/es/cuba-y-mongolia-celebran-60-anos-de-amistad|url-status=dead}}</ref>\n\n|-\n|{{flag|Nepal}}\n|<!-- Date started -->25 March 1975<ref>{{Cite web|title=Nepal - Cuba Relations - Ministry of Foreign Affairs Nepal MOFA|url=https://mofa.gov.np/nepal-cuba-relations/|access-date=2021-09-21|website=mofa.gov.np|archive-date=2021-09-21|archive-url=https://web.archive.org/web/20210921001429/https://mofa.gov.np/nepal-cuba-relations/|url-status=dead}}</ref>\n|\n* Cuban Ambassador to India is accredited to Nepal.\n* Embassy of Nepal in Ottawa is concurrently accredited to Cuba.\n* The friendly relations between the two countries have been further strengthened by exchange of visits and contacts at various levels in the past. Late King Birendra paid an official visit to Havana in September 1979 to represent Nepal in the 6th NAM summit.\n* The Cuban Government had offered some scholarships to the Nepalese students in the streams of culture and sports, engineering, psychology and agriculture for bachelor's degrees.\n* A medical team from the Government of Cuba extended medical treatment to the earthquake affected people of Nepal.\n\n|- valign=\"top\"\n| {{flag|North Korea}} || <!-- Date started -->29 August 1960|| See [[Cuba–North Korea relations]]\nThe Republic of Cuba has had diplomatic relations with [[North Korea]] since 29 August 1960.<ref>{{cite book|last1=Wertz|first1=Daniel|last2=Oh|first2=JJ|last3=Kim|first3=Insung|date=August 2016|title=Issue Brief: DPRK Diplomatic Relations|publisher=The National Committee on North Korea|url=http://www.ncnk.org/resources/publications/NCNK_Issue_Brief_DPRK_Diplomatic_Relations.pdf|access-date=22 February 2019|url-status=dead|archive-url=https://web.archive.org/web/20161228074114/http://www.ncnk.org/resources/publications/NCNK_Issue_Brief_DPRK_Diplomatic_Relations.pdf|archive-date=28 December 2016|page=8}}</ref> Cuba maintains an embassy in [[Pyongyang]] and North Korea maintains an embassy in [[Havana]]. [[Che Guevara]] then a [[Cuban government]] minister visited North Korea in 1960 and proclaimed it a model for Cuba to follow.<ref>Bruce Cumings, ''Korea's Place in the Sun: A Modern History'', W W Norton & Company, New York, 1997, p 394</ref> Cuban leader [[Fidel Castro]] visited in 1986. In 2013 a North Korean cargo ship seized while travelling through the [[Panama Canal]] and was found to be carrying weapons from Cuba, apparently to be repaired in North Korea. The ship was later returned to the North Korean government.\n|- valign=\"top\"\n| {{flag|Pakistan}} || <!-- Date started --> || See [[Cuba–Pakistan relations]]\nThe relations between the two countries strengthened after Cuba provided humanitarian assistance to the victims of the [[2005 Kashmir earthquake]]. Both nations continue to strengthen the bilateral relations especially in the fields of higher education, agriculture, industry and science and technology and have also held talks for military cooperation. In March 2008 ambassador Gustavo Machin Gomez met Gen. [[Tariq Majid]], the [[Chairman Joint Chiefs of Staff Committee (Pakistan)|Chairman of Joint Chiefs of Staff Committee (CJCSC)]] at Joint Staff Headquarters and discussed issues related to military cooperation. Both of them expressed positive views over the increasing relations between the two nations and were optimistic that the bilateral cooperation will expand in different fields. Majid stressed that Pakistan has formed strong defence infrastructure both in defence production and in shape of military academies to provide help and cooperation to the [[Military of Cuba]]. He also said that both countries should use their capacity for expanding military cooperation. In an interview with Overseas Pakistani Friends, Machin Gomez suggested further ways that Cuba and Pakistan might be able to help each other.<ref>{{cite web|url=http://www.opfblog.com/7087/interview-of-honorable-gustavo-machin-gomez-ambssador-of-cuba-in-pakistan/|title=Interview with Honorable Gustavo Machin Gomez Ambassador of Cuba in Pakistan|work=Overseas Pakistani Friends|access-date=27 April 2016|date=2009-03-04|archive-date=2015-09-24|archive-url=https://web.archive.org/web/20150924061046/http://www.opfblog.com/7087/interview-of-honorable-gustavo-machin-gomez-ambssador-of-cuba-in-pakistan/|url-status=dead}}</ref>\n* Cuba has an embassy in [[Islamabad]].\n* Pakistan has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Philippines}} || <!-- Date started --> || See [[Cuba-Philippines relations]]\n\nLike Cuba, the [[Philippines]] was once a [[Spanish East Indies|Spanish possession]], and Spanish rule in both colonies ended with the victory of the United States in the [[Spanish–American War]]. Provisions in the subsequent 1898 [[Treaty of Paris (1898)|Treaty of Paris]] gave Cuba independence while giving the Philippine Islands over to [[American Colonial Period (Philippines)|American control]], which was gradually lessened until the country achieved full sovereignty on 4 July 1946. Despite the Philippines being a long-time American ally, it has denounced the [[United States embargo against Cuba|American sanctions]] against Cuba.<ref>{{cite web |url=http://www.mb.com.ph/articles/349064/cuba-thanks-philippines-support |title=Cuba thanks Philippines for support &#124; Manila Bulletin |publisher=Mb.com.ph |date=2001-06-08 |access-date=2012-06-02 |url-status=dead |archive-url=https://archive.today/20130113144430/http://www.mb.com.ph/articles/349064/cuba-thanks-philippines-support |archive-date=2013-01-13 }}</ref> \n* Cuba is accredited to the Philippines from its embassy in Kuala Lumpur, Malaysia.\n* Philippines is accredited to Cuba from its embassy in Mexico City, Mexico.\n|- valign=\"top\"\n| {{flag|South Korea}} || <!-- Date started -->14 February 2024|| See [[Cuba–South Korea relations]]\nBoth countries established diplomatic relations on 12 July 1949, Cuba was the first country that recognize South Korea in Latin America.\n\nThere was no official-level diplomatic relation between the Cuba and [[South Korea]] from 1 January 1959 to 14 February 2024. Despite this there has been unofficial interactions in the economic level between the two countries. For instance South Korea's [[Hyundai Heavy Industries]] sent Packaged power station mobile generators to Cuba for the country's power grids. A picture of a PPS was later incorporated into the 10 [[Cuban convertible peso]] banknote.<ref>{{cite news | first = Ji-eun | last = Seo | title = 'Viva Hyundai' on a Cuban bill | date = 2007-01-30 | url = http://joongangdaily.joins.com/article/view.asp?aid=2871887 | work = Joongang Daily | access-date = 2011-07-28}}</ref>\n|- valign=\"top\"\n| {{flag|Syria}} || ||See [[Cuba–Syria relations]]\n|- valign=\"top\"\n| {{flag|Turkey}} || <!-- Date started --> 1952<ref name=\"auto43\">{{Cite web | url=http://www.mfa.gov.tr/relations-between-turkey-and-republic-of-cuba.en.mfa| title= Relations between Turkey and the Republic of Cuba}}</ref>||See [[Cuba–Turkey relations]] \n*Cuba has an embassy in [[Ankara]].\n*Turkey has an embassy in [[Havana]].<ref name=\"auto43\"/>\n*Trade volume between the two countries was US$54.7 million in 2019 (Cuban exports/imports: 11.8/42.9 million USD).<ref name=\"auto43\"/>\n|- valign=\"top\"\n| {{flag|Uzbekistan}} || <!-- Date started -->13 March 2006 || See [[:ru:Узбекистанско-кубинские отношения|Cuba–Uzbekistan relations]]\n* Both countries established diplomatic relations on 13 March 2006.\n* Uzbekistan is accredited to Cuba from its embassy in [[Washington, D.C.]] ([[United States|USA]]).\n* Cuba is accredited to Uzbekistan from its embassy in [[Baku]] ([[Azerbaijan]]).\n|- valign=\"top\"\n| {{flag|Vietnam}} || <!-- Date started -->December 1960 || See [[Cuba–Vietnam relations]]\nDiplomatic relations between the two countries was established in December 1960. Since then, Vietnam has become Cuba's second-largest trading partner in Asia, with Vietnam trailing behind China. Vietnam, just as Cuba is, is a [[Communist state]] and [[socialist state]].<ref>{{cite web | url = http://www.china.org.cn/world/2012-07/06/content_25840216.htm | title = Cuban leader Raul Castro to visit Vietnam | access-date = 13 October 2012 | date = 6 July 2012 | publisher = [[Xinhua]]. China.org.ch | author = Staff writer| author-link = Staff writer }}</ref>\n|}\n\n=== Europe ===\n\n{| class=\"wikitable sortable\" style=\"width:100%; margin:auto;\"\n|-\n! style=\"width:15%;\"| Country\n! style=\"width:12%;\"| Formal Relations Began\n!Notes\n|- valign=\"top\"\n| {{flag|European Union}} || <!-- Date started --> || See [[Cuba–European Union relations]]\n\n[[European Union]] (EU) relations with Cuba are governed by the Common Position, as approved by the [[European Council of Ministers]] in 1996, which is updated every six months following regular evaluations. According to the Common Position \"the objective of the European Union in its relations with Cuba is to encourage a process of transition to a pluralist democracy and respect for human rights and fundamental freedoms, as well as sustainable recovery and improvement in the living standards of the Cuban people\". Cuba rejects the Common Position as interference in its internal affairs. There is an EU Delegation in Havana that works under the responsibility of the EC Delegation in [[Santo Domingo]], [[Dominican Republic]].\n\nCuba benefits from the GPS (Generalized Preference System) preferential treatment for its exports. Furthermore, Cuba does not benefit from the ACP-EU Sugar Protocol but from a sugar quota granted by the EU (some 59,000 tonnes per year; duty paid on this quota is EUR 98/t).<ref>{{cite web|url=http://ec.europa.eu/comm/development/body/country/country_home_en.cfm?cid=cu&status=new |title=European Union – EEAS (European External Action Service) &#124; Countries / Territories |publisher=Ec.europa.eu |date=2010-06-21 |access-date=2012-03-23 |url-status=dead |archive-url=https://web.archive.org/web/20061019232940/http://ec.europa.eu/comm/development/body/country/country_home_en.cfm?cid=cu&status=new |archive-date=2006-10-19 }}</ref>\n|- valign=\"top\"\n| {{flag|Belgium}} || <!-- Date started --> ||\n\nDuring Spanish Governor-general period, Cuba was offered for sale in 1837.<ref>{{cite journal | s2cid=222514899 | doi=10.1215/00182168-39.3.413 | title=Belgium and the Prospective Sale of Cuba in 1837 | year=1959 | last1=Gooch | first1=Brison D. | journal=Hispanic American Historical Review | volume=39 | issue=3 | pages=413–427 | doi-access=free }}</ref>\n* Belgium has an embassy in Havana.\n* Cuba has an embassy in [[Brussels]].\n|- valign=\"top\"\n| {{flag|France}} || <!-- Date started --> ||See [[Cuba–France relations]]\n\n* Cuba has an embassy in [[Paris]].<ref>{{cite web| url = http://misiones.minrex.gob.cu/es/francia| title = Embassy of Cuba in France| date = 18 August 2016| access-date = 11 August 2017| archive-date = 13 August 2018| archive-url = https://web.archive.org/web/20180813094612/http://misiones.minrex.gob.cu/es/francia| url-status = dead}}</ref>\n* France has an embassy in Havana.<ref>{{Cite web|url=https://cu.ambafrance.org/|title=La France à Cuba|website=cu.ambafrance.org}}</ref>\n|- valign=\"top\"\n| {{flag|Greece}} || <!-- Date started --> || See [[Cuba–Greece relations]]\n\n* Cuba has an embassy in [[Athens]].\n* Greece has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Holy See}} || <!-- Date started --> ||See [[Cuba–Holy See relations]]\n\n* Cuba has an embassy in Rome accredited to the Holy See.\n* Holy See has an apostolic nunciature in Havana.\n|- valign=\"top\"\n| {{flag|Ireland}} || <!-- Date started --> ||\n\n* Cuba has an embassy in [[Dublin]].<ref>{{cite web| url = http://misiones.minrex.gob.cu/es/irlanda| title = Embassy of Cuba in Ireland| date = 11 April 2016| access-date = 11 August 2017| archive-date = 11 August 2017| archive-url = https://web.archive.org/web/20170811105321/http://misiones.minrex.gob.cu/es/irlanda| url-status = dead}}</ref>\n* Ireland is accredited to Cuba from its embassy in Mexico City, Mexico.<ref>{{Cite web|url=https://www.dfa.ie/irish-embassy/mexico/|title=Mexico - Department of Foreign Affairs|first=Department of Foreign|last=Affairs|website=www.dfa.ie}}</ref>\n\n|- valign=\"top\"\n| {{flag|Italy}} || <!-- Date started --> ||\n\n* Cuba has an embassy in [[Rome]].<ref>{{Cite web |url=http://misiones.minrex.gob.cu/es/italia |title=Embassy of Cuba in Italy |access-date=2017-08-11 |archive-url=https://web.archive.org/web/20170811104658/http://misiones.minrex.gob.cu/es/italia |archive-date=2017-08-11 |url-status=dead }}</ref>\n* Italy has an embassy in Havana.<ref>{{Cite web |url=http://www.amblavana.esteri.it/ambasciata_lavana/it/ |title=Embassy of Italy in Havana |access-date=2017-08-11 |archive-url=https://web.archive.org/web/20170811105514/http://www.amblavana.esteri.it/ambasciata_lavana/it/ |archive-date=2017-08-11 |url-status=dead }}</ref> \n|- valign=\"top\"\n| {{flag|Poland}} || <!-- Date started -->1933||See [[Cuba–Poland relations]]\n\n* Cuba has an embassy in [[Warsaw]].\n* Poland has an embassy in Havana. \n|- valign=\"top\"\n| {{flag|Russia}} || <!-- Date started --> || See [[Cuba–Russia relations]]\n\nRelations between the two countries suffered somewhat during the [[Boris Yeltsin]] administration, as Cuba was forced to look for new major allies, such as China, after the dissolution of the Soviet Union. Relations improved when [[Vladimir Putin]] was elected as the new Russian President. Putin, and later [[Dmitry Medvedev]], emphasized re-establishing strong relations with old Soviet allies. In 2008, Medvedev visited Havana and [[Raúl Castro]] made a week-long trip to Moscow. In that same year the two governments signed multiple economic agreements and Russia sent tons of humanitarian aid to Cuba. Cuba, meanwhile, gave staunch political support for Russia during the [[2008 South Ossetia war]]. Relations between the two nations are currently at a post-Soviet high, and talks about potentially re-establishing a Russian military presence in Cuba are even beginning to surface.\n* Cuba has an embassy in [[Moscow]].\n* Russia has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Serbia}} || <!-- Date started --> || See [[Cuba–Serbia relations]]\n\nCuba and [[Serbia]] have a long history of diplomatic relations from the period of [[Socialist Federal Republic of Yugoslavia]] when both countries were members of [[Non-Aligned Movement]]. Cuba supports Serbia in its [[Serbia's reaction to the 2008 Kosovo declaration of independence|stance]] towards [[Kosovo]] considering [[2008 Kosovo declaration of independence|Kosovo's independence]] an illegitimate act and a violation of [[international law]] and principles of the [[United Nations Charter]].<ref>{{cite web |url=http://www.mfa.gov.rs/Srpski/Foreinframe.htm |title=Spoljna politika |publisher=Mfa.gov.rs |access-date=2012-07-26 |url-status=dead |archive-url=https://web.archive.org/web/20120617213259/http://www.mfa.gov.rs/Srpski/Foreinframe.htm |archive-date=2012-06-17 }}</ref> Serbia supports Cuba at the [[United Nations]] in condemning the [[United States embargo against Cuba|United States embargo]].<ref>{{cite web|author=Beta |url=http://www.novosti.rs/vesti/naslovna/aktuelno.69.html:270736-Dobri-odnosi-Kube-i-Srbije |title=Dobri odnosi Kube i Srbije &#124; Aktuelno |publisher=Novosti.rs |date=2012-03-20 |access-date=2012-07-26}}</ref>\n* Cuba has an embassy in [[Belgrade]].\n* Serbia has an embassy in Havana.\n|- valign=\"top\"\n| {{flag|Spain}} || <!-- Date started -->1899 || See [[Cuba–Spain relations]]\n\n* Cuba has an embassy in [[Madrid]] with consulates-general in [[Barcelona]], [[Las Palmas de Gran Canaria]], [[Santiago de Compostela]] and [[Seville]].<ref>{{cite web| url = http://misiones.minrex.gob.cu/es/espana| title = Embassy of Cuba in Spain| date = 22 April 2016| access-date = 11 August 2017| archive-date = 15 September 2018| archive-url = https://web.archive.org/web/20180915230323/http://misiones.minrex.gob.cu/es/espana| url-status = dead}}</ref>\n* Spain has an embassy in Havana.<ref>{{Cite web|url=http://www.exteriores.gob.es/embajadas/lahabana/es/Paginas/inicio.aspx|title=Páginas - Embajada de España en Cuba|website=www.exteriores.gob.es|access-date=2017-08-11|archive-date=2017-08-11|archive-url=https://web.archive.org/web/20170811104528/http://www.exteriores.gob.es/embajadas/lahabana/es/Paginas/inicio.aspx|url-status=dead}}</ref>\n|- valign=\"top\"\n| {{flag|United Kingdom}} || 20 May 1902 || See [[Cuba–United Kingdom relations]]\n[[File:Cuban Ambassador to the United Kingdom (8241540248).jpg|thumb|right|Foreign Office Minister [[Hugo Swire]] with Cuban Ambassador to the UK Esther Gloria Armenteros Cárdenas in London, December 2012.]]\nCuba established [[Foreign relations of the United Kingdom|diplomatic relations with the United Kingdom]] on 20 May 1902.<ref name=\"britain\"/>\n*Cuba maintains an [[Embassy of Cuba, London|embassy]] in [[London]].<ref>{{Cite web|author=Diplomat Magazine|title=Cuba|url=https://diplomatmagazine.com/heads-of-mission/north-america/cuba/|date=30 April 2019|website=Diplomat Magazine|access-date=25 April 2025|archive-url=https://web.archive.org/web/20250513003936/https://diplomatmagazine.com/heads-of-mission/north-america/cuba/|archive-date=13 May 2025|url-status=live}}</ref>\n* United Kingdom is accredited to Cuba from its embassy in Havana.<ref>{{Cite web |url=https://www.gov.uk/world/organisations/british-embassy-havana|title=British Embassy Havana|website=[[gov.uk|GOV.UK]]|access-date=3 April 2024|archive-date=13 February 2024|archive-url=https://web.archive.org/web/20240213190815/https://www.gov.uk/world/organisations/british-embassy-havana|url-status=live}}</ref>\n\nBoth countries share common membership of the [[World Trade Organization]]. Bilaterally the two countries have an Investment Agreement,<ref>{{Cite web |url=https://investmentpolicy.unctad.org/international-investment-agreements/treaties/bilateral-investment-treaties/1154/cuba---united-kingdom-bit-1995-|title=Cuba - United Kingdom BIT (1995)|website=[[UN Trade and Development]]|access-date=3 June 2024|archive-date=20 February 2024|archive-url=https://web.archive.org/web/20240220225738/https://investmentpolicy.unctad.org/international-investment-agreements/treaties/bilateral-investment-treaties/1154/cuba---united-kingdom-bit-1995-|url-status=live}}</ref> and a Political Dialogue and Co-operation Agreement.<ref>{{Cite web|last=Rutley|first=David|author-link=David Rutley|url=https://www.gov.uk/government/news/uk-minister-visits-cuba-to-agree-new-cooperation-agreement|title=UK Minister visits Cuba to agree new cooperation agreement|date=21 November 2023|website=GOV.UK|access-date=3 June 2024|archive-date=21 November 2023|archive-url=https://web.archive.org/web/20231121204344/https://www.gov.uk/government/news/uk-minister-visits-cuba-to-agree-new-cooperation-agreement|url-status=live}}</ref>\n|}\n\n=== Oceania ===\n{{Main|Cuban-Pacific relations}}\n\nCuba has two embassies in Oceania, located in [[Wellington]] (opened in November 2007)<ref name=\"autogenerated1\">{{cite web |url=http://www.stuff.co.nz/4259546a11.html |title=Cuban connection runs deeper than the carnival |date=3 November 2007 |work=[[The Post (New Zealand newspaper)|The Dominion Post]] |access-date=30 September 2011 |archive-date=26 February 2008 |archive-url=https://web.archive.org/web/20080226132654/http://www.stuff.co.nz/4259546a11.html |url-status=dead }}</ref> and also one in [[Canberra]] opened October 24, 2008. It also has a [[Consulate General]] in [[Sydney]].<ref>[http://embacuba.cubaminrex.cu/Default.aspx?alias=embacuba.cubaminrex.cu/australiaing General Consulate of The Republic of Cuba in Australia<!-- Bot generated title -->]  {{webarchive|url=https://web.archive.org/web/20080110202140/http://embacuba.cubaminrex.cu/Default.aspx?alias=embacuba.cubaminrex.cu%2Faustraliaing |date=January 10, 2008 }}</ref> However, Cuba has official diplomatic relations with [[Nauru]] since 2002<ref>{{Cite web|url=http://www.cubanews.acn.cu/|archive-url=https://web.archive.org/web/20080226212507/http://www.cubanews.ain.cu/2007/1001proque_nauru.htm|url-status=dead|title=Cuba expects US reverses measures taken under the pretext of sonic incidents|archive-date=February 26, 2008|website=Agencia Cubana de Noticias}}</ref> and the [[Solomon Islands]] since 2003,<ref name=\"autogenerated3\">{{cite web|url=http://www.solomonstarnews.com/?q=node/13224 |title=solomonstarnews.com |publisher=solomonstarnews.com |access-date=2012-03-23}}</ref> and maintains relations with other Pacific countries by providing aid.\n\nIn 2008, Cuba will reportedly be sending doctors to the [[Solomon Islands]], [[Vanuatu]], [[Tuvalu]], Nauru and Papua New Guinea,<ref>[http://www.plenglish.com:80/article.asp?ID=%7B771AA7E5-B9F3-4129-AFF7-208C0DC1D65D%7D)&language=EN \"Cuban Physicians to Aid 81 Nations\"]{{dead link|date=January 2017 |bot=InternetArchiveBot |fix-attempted=yes }}, [[Prensa Latina]], March 29, 2008</ref> while seventeen medical students from Vanuatu will study in Cuba.<ref name=\"RNZI_41373\">{{cite web |url=http://www.rnzi.com/pages/news.php?op=read&id=41373 |title=Vanuatu to get six doctors from Cuba |date=10 August 2008 |work=[[Radio New Zealand International]] |access-date=30 September 2011}}</ref> It may also provide training for Fiji doctors. Indeed, Fiji's ambassador to the United Nations, [[Berenado Vunibobo]], has stated that his country may seek closer relations with Cuba, and in particular medical assistance, following a decline in [[New Zealand-Fiji relations|Fiji's relations with New Zealand]].<ref name=\"RNZI_38964\">{{cite web |url=http://www.rnzi.com/pages/news.php?op=read&id=38964 |title=Fiji says Cuban help sought as neighbours turn away |date=4 April 2008 |work=[[Radio New Zealand International]] |access-date=30 September 2011}}</ref>\n\n{| class=\"wikitable sortable\" style=\"width:100%; margin:auto;\"\n|-\n! style=\"width:15%;\"| Country\n! style=\"width:12%;\"| Formal Relations Began\n!Notes\n|- valign=\"top\"\n| {{flag|Australia}} || <!-- Date started -->1989 ||\n\n[[Australia]] and Cuba have a growing relationship on positive terms. Relations began in 1989. Relations were given a rebirth in 2009 when the foreign minister [[Stephen Smith (Australian politician)|Stephen Smith]] visited Cuba. In 2010, Cuba's foreign minister Bruno Rodríguez visited Australia. The ministers signed a memorandum of understanding in political cooperation between the foreign ministries and for closer bilateral relations. There is a Cuban embassy in Australia. It was opened on 24 October 2008. There are only two Australia–Cuba bilateral treaties, extended to Australia by the [[British Empire]] covering extradition.\n\n* Australia is accredited to Cuba from its embassy in Mexico City, Mexico.<ref>{{Cite web |url=http://mexico.embassy.gov.au/ |title=Embassy of Australia in Mexico |access-date=2020-01-22 |archive-url=https://web.archive.org/web/20190706202321/https://mexico.embassy.gov.au/ |archive-date=2019-07-06 |url-status=dead }}</ref>\n* Cuba has an embassy in [[Canberra]].<ref>{{cite web| url = http://misiones.minrex.gob.cu/es/australia| title = Embassy of Cuba in Australia| date = 2 June 2016| access-date = 11 August 2017| archive-date = 11 August 2017| archive-url = https://web.archive.org/web/20170811104816/http://misiones.minrex.gob.cu/es/australia| url-status = dead}}</ref>\n\n|- valign=\"top\"\n| {{flag|Kiribati}} || <!-- Date started --> || See [[Cuba–Kiribati relations]]\n\nRelations between Cuba and Kiribati are nascent, having developed in the 2000s (decade). Like other countries in Oceania, Kiribati is a beneficiary of Cuban medical aid; bilateral relations between [[Tarawa]] and Havana should be viewed within the scope of [[Cuban-Pacific relations|Cuba's regional policy in Oceania]].\n\nThere are currently sixteen Cuban doctors providing specialised medical care in [[Kiribati]], with sixteen more scheduled to join them.<ref>{{Cite web|url=http://www.pacificmagazine.net/news/2007/10/01/six-more-cuban-physicians-to-serve-in-kiribati|title=Pacific Magazine: Six More Cuban Physicians To Serve In Kiribati<!-- Bot generated title -->}}{{Dead link|date=December 2021 |bot=InternetArchiveBot |fix-attempted=yes }}</ref> Cubans have also offered training to I-Kiribati doctors.<ref name=\"RNZI_26617\">{{cite web |url=http://www.rnzi.com/pages/news.php?op=read&id=26617 |title=Kiribati discusses medical training with Cuba |date=6 September 2006 |work=[[Radio New Zealand International]] |access-date=30 September 2011 |archive-url=https://web.archive.org/web/20110522033754/http://www.rnzi.com/pages/news.php?op=read&id=26617 |archive-date=22 May 2011 |url-status=dead }}</ref> Cuban doctors have reportedly provided a dramatic improvement to the field of medical care in Kiribati, reducing the child mortality rate in that country by 80 percent,<ref name=\"autogenerated2\">{{cite web |url=http://www.rnzi.com/pages/news.php?op=read&id=33793 |title=Cuban doctors reduce Kiribati infant mortality rate by 80 percent |date=19 July 2007 |work=[[Radio New Zealand International]] |access-date=30 September 2011}}</ref> and winning the proverbial hearts and minds in the Pacific. In response, the [[Solomon Islands]] began recruiting Cuban doctors in July 2007, while [[Papua New Guinea]] and [[Fiji]] considered following suit.<ref name=\"autogenerated2\" />\n|- valign=\"top\"\n| {{flag|Nauru}} || <!-- Date started --> ||\n\nIn June 2007, [[Nauru]] adopted the \"Cuban literacy method\", reportedly used also in several other countries.<ref>{{cite web |url=http://www.plenglish.com/article.asp?ID=%7B047A98FA-B977-4545-9AA9-94CEA03C1C93%7D)&language=EN |title=Cuban Literacy Method to Pacific Isle – Prensa Latina |publisher=Plenglish.com |date= |access-date=2012-03-23 |url-status=dead |archive-url=https://web.archive.org/web/20080228023539/http://www.plenglish.com/article.asp?ID=%7B047A98FA-B977-4545-9AA9-94CEA03C1C93%7D%29&language=EN |archive-date=2008-02-28 }}</ref> In October 2007, Nauruan Foreign Minister and Trade Minister [[David Adeang]] travelled to Cuba to strengthen relations between the two island nations.<ref>{{cite web |url=http://www.plenglish.com/article.asp?ID=%7B024A0C98-99F7-4CEA-92F2-B6F13A3A4A60%7D)&language=EN |title=Cuba, Nauru to Strengthen Links – Prensa Latina |publisher=Plenglish.com |date= |access-date=2012-03-23 |url-status=dead |archive-url=https://web.archive.org/web/20080228023535/http://www.plenglish.com/article.asp?ID=%7B024A0C98-99F7-4CEA-92F2-B6F13A3A4A60%7D%29&language=EN |archive-date=2008-02-28 }}</ref> This led to the creation of a Cuba-Nauru Joint Intergovernmental Commission for Economic Cooperation.<ref>{{cite web|url=http://www.cubanews.ain.cu/2007/1002nauru-cuba.htm|archive-url=https://web.archive.org/web/20080226212521/http://www.cubanews.ain.cu/2007/1002nauru-cuba.htm |title=ECONOMY|archive-date=26 February 2008|access-date=27 April 2016}}</ref> An unspecified number of Cuban doctors are serving in Nauru.\n|- valign=\"top\"\n| {{flag|New Zealand}} || <!-- Date started --> ||\n\nRegarding relations with [[New Zealand]], Cuban ambassador José Luis Robaina García said his country had \"admiration for [[Foreign relations of New Zealand|New Zealand's independent foreign policy]]\".<ref name=\"autogenerated1\" />\n\n* Cuba has an embassy in [[Wellington]].<ref>{{Cite web |url=http://misiones.minrex.gob.cu/es/nuevazelanda |title=Embassy of Cuba in New Zealand |access-date=2017-08-11 |archive-url=https://web.archive.org/web/20180419180414/http://misiones.minrex.gob.cu/es/nuevazelanda |archive-date=2018-04-19 |url-status=dead }}</ref>\n* New Zealand is accredited to Cuba from its embassy in Mexico City, Mexico.<ref>{{Cite web |url=https://www.mfat.govt.nz/en/countries-and-regions/latin-america/mexico/embajada-de-nueva-zelandia |title=Embassy of New Zealand in Mexico |access-date=2017-08-11 |archive-date=2017-08-11 |archive-url=https://web.archive.org/web/20170811142621/https://www.mfat.govt.nz/en/countries-and-regions/latin-america/mexico/embajada-de-nueva-zelandia |url-status=dead }}</ref>\n\n|- valign=\"top\"\n| {{flag|Solomon Islands}} || <!-- Date started --> || See [[Cuba – Solomon Islands relations]]\nRelations between the [[Solomon Islands]] and Cuba have only a short history. The two countries moved to establish relations from the 2000s (decade), and particularly from 2007, within the context of Cuba's growing interest in the [[Pacific Islands]] region. Like other countries in Oceania, Solomon Islands is a beneficiary of Cuban medical aid; bilateral relations between Havana and [[Honiara]] must be viewed within the scope of [[Cuban-Pacific relations|Cuba's regional policy in Oceania]].\n\nIn April 2007, the ''[[Solomon Star]]'' reported that the [[Solomon Islands]]' High Commissioner to the United Nations was soon to be sworn in as Ambassador to Cuba.<ref>{{cite web|url=http://www.solomonstarnews.com/?q=node/13688 |title=solomonstarnews.com |publisher=solomonstarnews.com |access-date=2012-03-23}}</ref> In September 2007, it was announced that 40 Cuban doctors would be sent to the Solomon Islands.<ref>{{cite web|url=http://www.radioaustralia.net.au/news/stories/s2030359.htm |title=News &#124; ABC Radio Australia |publisher=Radioaustralia.net.au |access-date=2012-03-23}}</ref> The Solomons' Minister of Foreign Affairs [[Patterson Oti]] said that Solomon Islander doctors would \"learn from their Cuban colleagues in specialized areas\".<ref>{{cite web|url=http://www.solomonstarnews.com/?q=node/13243 |title=solomonstarnews.com |publisher=solomonstarnews.com |access-date=2012-03-23}}</ref> In addition to providing doctors, Cuba provided scholarships for 50 Solomon Islanders to study medicine in Cuba for free.<ref name=\"autogenerated3\" /><ref name=\"RNZI_38300\">{{cite web |url=http://www.rnzi.com/pages/news.php?op=read&id=38300 |title=Cuban-trained doctors sorely needed in Solomons |date=28 February 2008 |work=[[Radio New Zealand International]] |access-date=30 September 2011}}</ref>\n|- valign=\"top\"\n| {{flag|Tuvalu}} || <!-- Date started --> || See [[Cuba–Tuvalu relations]]\n\nRelations between Tuvalu and Cuba are recent, having developed in the 2000s (decade). Like other countries in Oceania, Tuvalu is a beneficiary of [[Cuban medical internationalism|Cuban medical aid]]; bilateral relations between [[Funafuti]] and Havana must be viewed within the scope of [[Cuban-Pacific relations|Cuba's regional policy in Oceania]].\n|- valign=\"top\"\n| {{flag|Vanuatu}} || <!-- Date started --> || See [[Cuba–Vanuatu relations]]\n\nRelations between the Republic of [[Vanuatu]] and Cuba began shortly after the former gained its independence from [[France]] and the United Kingdom in 1980, and began establishing [[Foreign relations of Vanuatu|its own foreign policy]] as a newly independent state. Vanuatu and Cuba established official diplomatic relations in 1983.<ref name=hommes>{{cite book |last= Huffer |first=Elise |title=Grands hommes et petites îles: La politique extérieure de Fidji, de Tonga et du Vanuatu |year=1993 |publisher=ORSTOM |language=fr | url=https://books.google.com/books?id=R--2AAAACAAJ |isbn=978-2-7099-1125-2 }}</ref>\n|}\n\n== International organizations and groups ==\n\n[[Association of Caribbean States|ACS]] • [[Bolivarian Alliance for the Americas|ALBA]] • [[Alliance of Small Island States|AOSIS]] • [[Community of Latin American and Caribbean States|CELAC]] • [[Caribbean Tourism Organization|CTO]] • [[United Nations Economic Commission for Latin America and the Caribbean|ECLAC]] • [[G33 (developing countries)|G33]] • [[Group of 77|G77]] • [[International Atomic Energy Agency|IAEA]] • [[International Civil Aviation Organization|ICAO]] • [[International Red Cross and Red Crescent Movement|ICRM]] • [[International Fund for Agricultural Development|IFAD]] • [[International Labour Organization|ILO]] • [[International Maritime Organization|IMO]] • [[Interpol (organization)|Interpol]] • [[IOC]] • [[International Organization for Standardization|ISO]] • [[International Telecommunication Union|ITU]] • [[Latin American Economic System|LAES]] • [[Non-Aligned Movement|NAM]] • [[Organization of American States|OAS]] • [[Organization of Ibero-American States|OEI]] • [[OPANAL]] • [[Organisation for the Prohibition of Chemical Weapons|OPCW]] • [[Pan American Health Organization|PAHO]] • [[Rio Group]] • [[United Nations|UN]] • [[United Nations Conference on Trade and Development|UNCTAD]] • [[UNESCO]] • [[Universal Postal Union|UPU]] • [[World Customs Organization|WCO]] • [[WHO]] • [[World Intellectual Property Organization|WIPO]] • [[World Meteorological Organization|WMO]]\n\n=== Caribbean Community (CARICOM) ===\n\nTies between the nations of the [[Caribbean Community]] (CARICOM) and Cuba have remained cordial over the course of the later half of the 20th century.<ref>[http://www.nationnews.com/story/284896411769321.php Arthur points out ties that bind] {{webarchive|url=https://web.archive.org/web/20120222071701/http://www.nationnews.com/story/284896411769321.php |date=2012-02-22 }} ''The Nation'' newspaper</ref> Formal diplomatic relations between the CARICOM economic giants: [[Barbados]], [[Jamaica]], [[Guyana]] and [[Trinidad and Tobago]] have existed since 1972,<ref>{{cite web |url=http://www.barbadosadvocate.com/NewViewNewsleft.cfm?Record=23679 |title=Advocate |publisher=Barbadosadvocate.com |access-date=2012-03-23 |url-status=dead |archive-url=https://web.archive.org/web/20120215152242/http://www.barbadosadvocate.com/NewViewNewsleft.cfm?Record=23679 |archive-date=2012-02-15 }}</ref><ref>{{Cite web|url=http://www.jamaicaobserver.com/news/html/20051207t210000-0500_94154_obs_all_set_for_cuba_caricom_summit.asp|archive-url=https://web.archive.org/web/20080228073721/http://www.jamaicaobserver.com/news/html/20051207t210000-0500_94154_obs_all_set_for_cuba_caricom_summit.asp|url-status=dead|title=All set for Cuba/Caricom Summit – JAMAICAOBSERVER.COM|archive-date=February 28, 2008}}</ref> and have over time led to an increase in cooperation between the [[CARICOM Heads of Government]] and Cuba. At a summit meeting of sixteen Caribbean countries in 1998, Fidel Castro called for regional unity, saying that only strengthened cooperation between Caribbean countries would prevent their domination by rich nations in a global economy.<ref>{{cite news | url = http://news.bbc.co.uk/2/hi/americas/156312.stm | title = Castro calls for Caribbean unity | publisher = BBC New | access-date = 2006-05-21 | date=1998-08-21 | location=London}}</ref> Cuba, for many years regionally isolated, increased grants and scholarships to the Caribbean countries.\n\nTo celebrate ties between the Caribbean Community and Cuba in 2002 the Heads of Government of Cuba and CARICOM have designated the day of December 8 to be called 'CARICOM-Cuba Day'.<ref>[http://www.caribbeannetnews.com/2004/12/07/sanders.htm Caribbean Net News: CARICOM-Cuba Day: 8 December – A time for Celebration] {{webarchive |url=https://web.archive.org/web/20080226133925/http://www.caribbeannetnews.com/2004/12/07/sanders.htm |date=February 26, 2008 }}</ref> The day is the exact date of the formal opening of diplomatic relations between the first CARICOM-four and Cuba.\n\nIn December 2005, during the second CARICOM/CUBA summit held in Barbados, heads of CARICOM and Cuba agreed to deepen their ties in the areas of socio-economic and political cooperation in addition to medical care assistance. Since the meeting, Cuba has opened four additional embassies in the Caribbean Community including: [[Antigua and Barbuda]], [[Dominica]], [[Suriname]], and [[Saint Vincent and the Grenadines]]. This development makes Cuba the only nation to have embassies in all independent countries of the Caribbean Community.<ref>[http://www.caribbeannetnews.com/cgi-script/csArticles/articles/000008/000823.htm Caribbean Net News: Cuba opens more Caribbean embassies] {{webarchive |url=https://web.archive.org/web/20090415220746/http://www.caribbeannetnews.com/cgi-script/csArticles/articles/000008/000823.htm |date=April 15, 2009 }}</ref> CARICOM and Canadian politicians<ref>{{Cite web|url=http://www.caricom.org/jsp/pressreleases/pres21_98.htm|archive-url=https://web.archive.org/web/20080302020536/http://www.caricom.org/jsp/pressreleases/pres21_98.htm|url-status=dead|title=New focus on CARICOM/Canada relations|archive-date=March 2, 2008}}</ref> have jointly maintained that through the International inclusion of Cuba, a more positive change might indeed be brought about there (politically) as has been witnessed in the [[People's Republic of China]].\n\nCuban cooperation with the Caribbean was extended by a joint health programme between Cuba and Venezuela named [[Operación Milagro]], set up in 2004. The initiative is part of the Sandino commitment, which sees both countries coming together with the aim of offering free ophthalmology operations to an estimated 4.5 million people in Latin America and the Caribbean over a ten-year period.<ref>[http://news.scotsman.com/health.cfm?id=2305142005 Havana's Operation Miracle helps eye patients see light] News. Scotsman</ref> According to [[Denzil Douglas]], the prime minister of [[St. Kitts and Nevis]], more than 1,300 students from member nations are studying in Cuba while more than 1,000 Cuban doctors, nurses and other technicians are working throughout the region. In 1998 Trinidadian and Tobagonian Prime Minister [[Patrick Manning]] had a heart valve replacement surgery in Cuba and returned in 2004 to have a pacemaker implanted.\n\nIn December 2008 the CARICOM Heads of Government opened the third Cuba-CARICOM Summit in Cuba. The summit is to look at closer integration of the Caribbean Community and Cuba.<ref>[http://www.cananews.net/news/131/ARTICLE/32294/2008-12-08.html TIES THAT BIND: CUBA/CARICOM leaders talk closer cooperation]{{dead link|date=July 2017 |bot=InternetArchiveBot |fix-attempted=yes }} – Caribbean News Agency (CANA) – Monday, 08 December 2008</ref> During the summit the Caribbean Community (CARICOM) bestowed Fidel Castro with the highest honour of CARICOM, [[Order of the Caribbean Community|The Honorary Order of the Caribbean Community]] which is presented in exceptional circumstances to those who have offered their services in an outstanding way and have made significant contributions to the region.<ref>[http://www.granma.cu/ingles/2008/diciembre/mar9/50orden-i.html]{{dead link|date=March 2012}}</ref><ref>[http://www.trinidadexpress.com/index.pl/article_news?id=161410291 Caricom's highest honour for Fidel]{{dead link|date=October 2017 |bot=InternetArchiveBot |fix-attempted=yes }} – Trinidad and Tobago Express Newspaper – December 7, 2008</ref>\n\nIn 2017 Cuba and the [[Caribbean Community]] (CARICOM) bloc signed the \"CARICOM-Cuba Trade and Economic Cooperation Agreement\"<ref>{{Cite web|url=https://caricom.org/Document-Library/view-document/caricom-cuba-trade-and-economic-cooperation-agreement|title=CARICOM-Cuba Trade and Economic Cooperation Agreement}}{{Dead link|date=December 2021 |bot=InternetArchiveBot |fix-attempted=yes }}</ref>\n\n=== Organization of American States ===\n{{Main|Cuban relations with the Organization of American States}}\n\nCuba was formerly excluded from participation in the [[Organization of American States]] under a decision adopted by the Eighth Meeting of Consultation in [[Punta del Este]], [[Uruguay]], on 21 January 1962. The resolution stated that as Cuba had officially identified itself as a Marxist–Leninist government, it was incompatible with \"the principles and objectives of the inter-American system.\"<ref>{{cite web|url=http://www.cidh.oas.org/countryrep/Cuba79eng/intro.htm |title=Cuba 1979 – Introduction |publisher=Cidh.oas.org |access-date=2012-03-23}}</ref> This stance was frequently questioned by some member states. This situation came to an end on 3 June 2009, when foreign ministers assembled in [[San Pedro Sula]], [[Honduras]], for the OAS's 39th [[General Assembly of the Organization of American States|General Assembly]], passed a vote to lift Cuba's suspension from the OAS. In its resolution ([http://www.oas.org/consejo/sp/AG/ag04632e01.doc AG/RES 2438]), the General Assembly decided that:\n\n# Resolution VI, [...] which excluded the Government of Cuba from its participation in the Inter-American system, hereby ceases to have effect\n# The participation of the Republic of Cuba in the OAS will be the result of a process of dialogue initiated at the request of the Government of Cuba, and in accordance with the practices, purposes, and principles of the OAS.\n\nThe reincorporation of Cuba as an active member had arisen regularly as a topic within the inter-American system (e.g., it was intimated by the outgoing ambassador of Mexico in 1998)<ref>{{cite web|url=http://www.oas.org/OASpage/press2002/en/Press98/020498ce.htm |title=Mexico Calls for Cuba's Reinstatement into the |publisher=OAS |date=1998-02-04 |access-date=2012-03-23}}</ref> but most observers did not see it as a serious possibility while the Socialist government remained in power. On 6 May 2005, [[President of Cuba|President]] Fidel Castro reiterated that the island nation would not \"be part of a disgraceful institution that has only humiliated the honor of Latin American nations\".<ref>{{cite web |url=http://www.plenglish.com/article.asp?ID=%7B2355B35C-068E-4DFE-879E-3E8836A38EA4%7D&language=EN |title=Fidel Castro: OAS Is an Instrument of the US – Prensa Latina |publisher=Plenglish.com |date= |access-date=2012-03-23 |url-status=dead |archive-url=https://web.archive.org/web/20081011190122/http://www.plenglish.com/article.asp?ID=%7B2355B35C-068E-4DFE-879E-3E8836A38EA4%7D&language=EN |archive-date=2008-10-11 }}</ref>\n\nIn an editorial published by ''[[Granma (newspaper)|Granma]]'', Fidel Castro applauded the Assembly's \"rebellious\" move and said that the date would \"be recalled by future generations.\"<ref>{{cite news|url=http://www.granma.cu/ingles/2009/junio/mier3/Reflections-2june.html |title=The Trojan horse |author=Fidel Castro |work=[[Granma (newspaper)|Granma]] |date=2009-06-02 |access-date=2009-06-04 |url-status=dead |archive-url=https://web.archive.org/web/20110622101120/http://www.granma.cu/ingles/2009/junio/mier3/Reflections-2june.html |archive-date=2011-06-22 }}</ref> However, a Declaration of the Revolutionary Government dated 8 June 2009 stated that while Cuba welcomed the Assembly's gesture, in light of the Organization's historical record  \"Cuba will not return to the OAS\".<ref>{{cite news|url=http://www.granma.cu/ingles/2009/junio/lun8/Declaration.html |title=Declaration of the Revolutionary Government |work=[[Granma (newspaper)|Granma]] |date=2009-06-08 |access-date=2009-06-15 |url-status=dead |archive-url=https://web.archive.org/web/20120219170708/http://www.granma.cu/ingles/2009/junio/lun8/Declaration.html |archive-date=2012-02-19 }}</ref>\n\nCuba joined the [[Latin American Integration Association]] becoming the tenth member (out of 12) on 26 August 1999. The organization was set up in 1980 to encourage trade integration association. Its main objective is the establishment of a common market, in pursuit of the economic and social development of the region.\n\nOn September 15, 2006, Cuba officially took over leadership of the [[Non-Aligned Movement]] during the 14th summit of the organization in Havana.<ref>{{cite web|url=https://abcnews.go.com/International/wireStory?id=2448962&CMP=OTC-RSSFeeds0312 |title=ABC News: ABC News |publisher=Abcnews.go.com |access-date=2012-03-23}}</ref>\n\n== Cuban intervention abroad: 1959 – Early 1990s ==\nCuba became a staunch ally of the USSR during the Cold War, modeling its political structure after that of the [[Communist Party of the Soviet Union|CPSU]]. Owing to the fundamental role Internationalism plays in Cuban socialist ideology, Cuba became a major supporter of liberation movements not only in Latin America, but across the globe.<ref>''SOVIET-CUBAN INTERVENTION IN THE HORN OF AFRICA: Impact and Lessons'', Valenta, 1980/81, Journal of International Affairs</ref>\n\n=== Black Panthers ===\nIn the 1960s and 1970s, Cuba openly supported the black nationalist and Marxist-oriented [[Black Panther Party]] of the U.S. Many members found their way into Cuba for political asylum, where Cuba welcomed them as refugees after they had been convicted in the U.S.<ref>{{cite news |last1=Anderson |first1=Jon |title=The American Fugitives of Havana |url=https://www.newyorker.com/news/daily-comment/the-american-fugitives-of-havana |access-date=9 February 2021 |publisher=newyorker.com |date=August 31, 2016}}</ref>\n\n=== Palestine ===\n\nCuba also lent support to [[Palestinian people|Palestinian]] [[nationalism|nationalist]] groups against [[Israel]], namely the [[Palestine Liberation Organization]] (PLO) and lesser-known [[Marxism–Leninism|Marxist–Leninist]] [[Popular Front for the Liberation of Palestine]] (PFLP). Fidel Castro called Israel practices \"[[Zionism|Zionist]] Fascism.\" The Palestinians received training from Cuba's General Intelligence Directorate, as well as financial and diplomatic support from the Cuban government. However, in 2010, Castro indicated that he also strongly supported Israel's right to exist.<ref>{{cite web |url=https://www.google.com/hostednews/afp/article/ALeqM5gTESm0GlM9yQizdmGzrIOoEGdq0w |title=AFP: Fidel Castro firmly backs Israel's right to exist: report |date=2010-09-22 |access-date=2012-03-23 |archive-url=https://web.archive.org/web/20100926103740/https://www.google.com/hostednews/afp/article/ALeqM5gTESm0GlM9yQizdmGzrIOoEGdq0w |archive-date=2010-09-26 |url-status=dead }}</ref>\n\n=== Irish Republicans ===\n\nThe [[Irish Republican]] political party, [[Sinn Féin]] has political links to the Cuban government. Fidel Castro expressed support for the Irish Republican cause of a [[United Ireland]].<ref>{{Cite web|date=2016-11-26|title=Fidel Castro was a strong supporter of Irish hunger strikers and Bobby Sands|url=http://www.irishcentral.com/roots/history/fidel-castro-was-a-strong-supporter-of-irish-hunger-strikers-and-bobby-sands|access-date=2021-05-08|website=IrishCentral.com|language=en}}</ref>\n\n== Humanitarian aid ==\n{{see also|Cuban medical internationalism}}\n\nSince the establishment of the Revolutionary Government of Cuba in 1959, the country has sent more than 52,000 medical workers abroad to work in needy countries, including countries affected by the [[2004 Indian Ocean earthquake]] and the [[2005 Kashmir earthquake]].<ref>{{cite web |url=http://www.irna.ir/en/news/view/menu-236/0607178261185837.htm |title=خطای نابهنگام |publisher=Irna.ir |access-date=2012-03-23 |url-status=dead |archive-url=https://web.archive.org/web/20120204044323/http://www.irna.ir/en/news/view/menu-236/0607178261185837.htm |archive-date=2012-02-04 }}</ref> There are currently about 20,000 Cuban doctors working in 68 countries across three continents, including a 135-strong medical team in [[Java]], [[Indonesia]].<ref>{{cite news| url=http://news.bbc.co.uk/2/hi/americas/4792071.stm | work=BBC News | title=Cuba doctors popular in quake-stricken Java | date=2006-08-18 | access-date=2010-05-02 | first=Tom | last=Fawthrop}}</ref>\n\n'''Read more about Cuba's medical collaboration in Africa at:'''\n\n* White Coats by the Gambia River<ref>[http://www.cadenagramonte.cu/english/health/white_coats_gambia_river.asp] {{webarchive|url=https://web.archive.org/web/20080902091542/http://www.cadenagramonte.cu/english/health/white_coats_gambia_river.asp|date=September 2, 2008}}</ref>\n\n'''Cuba provides Medical Aid to Children Affected by Chernobyl Nuclear Accident:'''\n\n* The children of Chernobyl in My Memory<ref>[http://www.cadenagramonte.cu/english/health/chernobil_medical_assistance.asp] {{webarchive|url=https://web.archive.org/web/20080902091537/http://www.cadenagramonte.cu/english/health/chernobil_medical_assistance.asp|date=September 2, 2008}}</ref>\n\n== List of Foreign Ministers of Cuba ==\n{{Main|List of Foreign Ministers of Cuba}}\n\n== See also ==\n{{Portal|Cuba}}\n\n* [[Censorship in Cuba]]\n* [[Cocktail Wars]]\n* [[Human rights in Cuba]]\n* [[Intelligence Directorate]]\n* [[List of diplomatic missions in Cuba]]\n* [[List of diplomatic missions of Cuba]]\n* [[Organization of Solidarity with the People of Asia, Africa and Latin America]]\n\n== References ==\n{{Reflist|30em}}\n\n==Further reading==\n* Adams, Gordon. \"Cuba and Africa: The International Politics of the Liberation Struggle: A Documentary Essay\" ''Latin American Perspectives'' (1981)  8#1 pp:108-125.\n* Bain, Mervyn J. \"Russia and Cuba: 'doomed' comrades?.\" ''Communist and Post-Communist Studies'' 44.2 (2011): 111–118.\n* Bain, Mervyn J. '' Soviet-Cuban Relations, 1985 to 1991: Changing Perceptions in Moscow and Havana'' (2007)\n* Bernell, David. \"The curious case of Cuba in American foreign policy.\" ''Journal of Interamerican Studies and World Affairs'' 36.2 (1994): 65–104. [https://www.jstor.org/stable/166174 online]\n* Blue, Sarah. \"Cuban Medical Internationalism: Domestic and International Impacts.\" ''Journal of Latin American Geography'' (2010)  9#1.\n* Domínguez, Jorge I. ''To Make a World Safe for Revolution: Cuba's Foreign Policy'' (Harvard UP, 1989) [https://www.amazon.com/Make-World-Safe-Revolution-International/dp/0674893255/  excerpt]\n* Erisman, H. Michael, and John M. Kirk, eds. ''Redefining Cuban Foreign Policy: The Impact of the \"Special Period\"'' (2006)\n* Falk, Pamela S.  \"Cuba in Africa.\" ''Foreign Affairs'' 65.5 (1987): 1077–1096. [https://www.jstor.org/stable/20043202 online]\n* Falk, Pamela S. ''Cuban Foreign Policy: Caribbean Tempest'' (1986).\n* Fauriol, Georges,  and Eva Loser, eds. '' Cuba: The International Dimension'' (1990)\n* Feinsilver,  Julie M. \"Fifty Years of Cuba’s Medical Diplomacy: From Idealism to Pragmatism,\" ''Cuban Studies'' 41 (2010), 85–104; \n* Gleijeses, Piero. \"Moscow's Proxy? Cuba and Africa 1975–1988.\" ''Journal of Cold War Studies'' 8.4 (2006): 98–146.  [https://web.archive.org/web/20170809075742/http://penultimosdias.com/wp-content/uploads/2008/10/82gleijeses.pdf online]\n* Gleijeses, Piero. ''Conflicting Missions: Havana, Washington, and Africa, 1959-1976'' (2002) [https://www.questia.com/library/120089380/conflicting-missions-havana-washington-and-africa online]\n* Gleijeses, Piero. ''The Cuban Drumbeat. Castro’s Worldview: Cuban Foreign Policy in a Hostile World'' (2009)\n* Harmer, Tanya. \"Two, Three, Many Revolutions? Cuba and the Prospects for Revolutionary Change in Latin America, 1967–1975.\" ''Journal of Latin American Studies'' 45.1 (2013): 61–89.\n* Hatzky, Christine. ''Cubans in Angola: South-South Cooperation and Transfer of Knowledge, 1976–1991. '' (U of Wisconsin Press, 2015).\n* Krull, Catherine. ed. ''Cuba in a Global Context: International Relations, Internationalism, and Transnationalism'' (2014)  [https://www.questia.com/library/120088910/cuba-in-a-global-context-international-relations online] {{Webarchive|url=https://web.archive.org/web/20190207015542/https://www.questia.com/library/120088910/cuba-in-a-global-context-international-relations |date=2019-02-07 }}\n* Pérez-Stable, Marifeli. \"The United States and Cuba since 2000.\" in ''Contemporary US-Latin American Relations'' (Routledge, 2010) pp.&nbsp;64–83.\n* Pérez-Stable, Marifeli. ''The United States and Cuba: Intimate Enemies'' (2011) recent history [https://www.questia.com/library/120092385/the-united-states-and-cuba-intimate-enemies online] {{Webarchive|url=https://web.archive.org/web/20190207015643/https://www.questia.com/library/120092385/the-united-states-and-cuba-intimate-enemies |date=2019-02-07 }}\n* Smith, Robert F. ''The United States and Cuba: Business and Diplomacy, 1917-1960'' (1960) [https://www.questia.com/library/61721456/the-united-states-and-cuba-business-and-diplomacy online] {{Webarchive|url=https://web.archive.org/web/20190207015341/https://www.questia.com/library/61721456/the-united-states-and-cuba-business-and-diplomacy |date=2019-02-07 }}\n* Taylor, Frank F. \"Revolution, race, and some aspects of foreign relations in Cuba since 1959.\" ''Cuban Studies'' (1988): 19–41.\n\n== External links ==\n{{Commons category|International relations of Cuba}}\n\n* [http://www.cubaminrex.cu/English/ Cuban Ministry of Foreign Affairs] {{Webarchive|url=https://web.archive.org/web/20060518024027/http://www.cubaminrex.cu/English/ |date=2006-05-18 }}\n* [http://misiones.minrex.gob.cu/en/un Cuban Mission to the United Nations] {{Webarchive|url=https://web.archive.org/web/20210724141401/http://misiones.minrex.gob.cu/en/un |date=2021-07-24 }}\n* [http://www.yale.edu/lawweb/avalon/diplomacy/cuba/cuba003.htm Text of U.S.- Cuban agreement on military bases] {{Webarchive|url=https://web.archive.org/web/20030813171440/http://www.yale.edu/lawweb/avalon/diplomacy/cuba/cuba003.htm |date=2003-08-13 }}\n* [http://www.miamiherald.com/news/americas/cuba/story/998681.html Fidel Castro's 'Reflection' on U.S. Travel Restrictions] ''Miami Herald'', April 14, 2009\n* [https://www.wilsoncenter.org/publication/visions-freedom-new-documents-the-closed-cuban-archives CWIHP e-Dossier No. 44], with an introduction by [[Piero Gleijeses]] (October 2013). The dossier features [http://digitalarchive.wilsoncenter.org/collection/173/cuba-and-southern-africa over 160 Cuban documents] pertaining to Havana's policy toward Southern Africa in the final fifteen years of the Cold War.\n\n'''Representations of other countries in Cuba'''\n\n* [http://cu.chineseembassy.org/ Chinese Embassy in Havana]\n* [https://eoi.gov.in/havana/ Embassy of India in Havana]\n* [https://www.canadainternational.gc.ca/cuba/ The Canadian Embassy in Cuba]\n\n'''Cuban representations to other countries'''\n\n* [http://misiones.minrex.gob.cu/en Cuban embassies around the world] {{Webarchive|url=https://web.archive.org/web/20210804132339/http://misiones.minrex.gob.cu/en |date=2021-08-04 }}\n\n'''Aspects of Cuba's foreign policy'''\n\n* [http://news.bbc.co.uk/2/hi/programmes/world_news_america/8537928.stm \"Cuba's health diplomacy\"], [[British Broadcasting Corporation]], February 25, 2010.\n\n{{Cuba topics}}\n{{Foreign relations of Cuba}}\n{{Foreign relations in the Caribbean}}\n{{Bolivarian Alliance for the Americas (ALBA)}}\n{{Americas topic|Foreign relations of|title=Foreign relations in the Americas}}\n\n[[Category:Foreign relations of Cuba| ]]"